{"output":"Para cada caso, imprima o número do caso de teste seguido pela quantidade total de tinta requerida com 2 dígitos depois do ponto decimal. Se as linhas não podem ser desenhadas sem que se levante a caneta, imprima o número do caso de teste seguido de “~ x (“, conforme exemplo abaixo (caso 2).","input":"A primeira linha de entrada é um inteiro T(T<20) que indica o número total de casos de teste. Cada caso inicia com um inteiro N (N<10). Então N linhas vem a seguir, cada uma descrevendo um segmento de linha. Um segmento de linha é definido por dois pontos Y   1   X  1    Y 2 X2  . Y1 e  Y2 estarão no intervalo [A,E]. X1 e X2 estarão no intervalo [1,5]. O  primeiro exemplo é mostrado na figura acima. Portanto, olhe para o exemplo para compreender o formato exato.","level":10,"name":"Desenho Contínuo","has_images":true,"description":"Uma tarefa simples! Você receberá os pontos finais de alguns segmentos de linha. Basta desenhá-los! Está achando muito fácil, certo?\n                    \n                    Você decide desafiar a si mesmo e, portanto, adicionar algumas restrições.\n                    1] Iniciar a partir do ponto final de qualquer segmento de linha.\n                    2] Não levante a caneta do papel.\n                    3] Você pode passar por cima de uma linha de mais de uma vez.\n                    4] Não desenhar qualquer outra linha além das citadas.\n                    5] Você só pode mudar de direção em coordenadas inteiras de x e y.\n                    6] Use a menor quantidade de tinta necessária.\n                    \n                    Você precisa de uma unidade de tinta para desenhar uma unidade de linha. As distâncias entre os pontos sucessivos\n                    são: 1 unidade.\n                    \n                    Portanto Distância (A1 até B1) = 1 unidade and Distância (A1 até A2) = 1 unidade.","id":"1053","category":"Grafos","statistics":{"level":"10 / 10","submissions":1044,"solved":43,"ratio":"4.12%"}}