{"output":"Para cada caso, imprima o número do caso seguido do menor tempo requerido. Se for impossível movê-los como descrito, imprima ‘trapped’ ao invés de imprimir o tempo. Note que o primeiro caso de teste corresponde à figura acima.","input":"A primeira linha de entrada é um inteiro T (T < 50), que indica o número de casos de testes. Cada caso inicia com um inteiro N (2 < N < 10).  Cada uma das próximas N linhas contém N caracteres cada que preencherão o labirinto.","level":8,"name":"Chegando Junto","has_images":true,"description":"Você está jogando um jogo de computador no qual três robôs (Aneed, Ben e Cindy) estão presos em um labirinto. Inicialmente todos os três estão situados em três localizações diferentes no labirinto. Existem três saídas através das quais os robôs têm que sair. Como esperado, há vários obstáculos no labirinto e os robôs não podem passar por eles.\n    \n\tO labirinto pode ser modelado como uma grade quadrada, com células NxN. Os robôs são colocados em três diferentes células no labirinto. Você pode comandá-los a se mover. Um único comando será ativado para os três robôs simultaneamente. Um robô irá mover-se para uma nova posição se for uma célula vazia dentro do labirinto ou se for uma das células alvo. Caso contrário, o comando será ignorado para aquele robô. A sua tarefa é comandá-los de forma  que todos eles cheguem nas três células alvo (em qualquer ordem).\n\t\n\tCada movimento leva 1 unidade de tempo e consiste em:\n\tMove North  - O robô se move uma célula para o norte.\n\tMove East  - O robô se move uma célula para o leste.\n\tMove South - O robô se move uma célula para o sul.\n\tMove West  - O robô se move uma célula para o oeste.\n    \n\tCada célula consiste em um dos seguintes caracteres:\n\tA – Posição Inicial de Aneed\n\tB – Posição Inicial de Ben\n\tC – Posição Inicial de Cindy\n\t. – Célula vazia\n\t# - Obstáculo\n\tX – Célula alvo\n    \n\tAssuma que para todo labirinto cada uma das três letras  (A B C) aparecerá exatamente uma vez e cada X aparecerá 3 vezes.","id":"1057","category":"Grafos","statistics":{"level":"8 / 10","submissions":908,"solved":264,"ratio":"29.07%"}}