{"output":"Para cada caso de teste da entrada, deve ser apresentada uma mensagem Case #n:, onde n indica o número do caso de teste (conforme exemplo abaixo). Segue a listagem dos vértices de cada segmento, um segmento por linha, separados por vírgula (inclusive com uma virgula no final da linha). Finalizando o caso de teste, deve ser apresentada uma mensagem indicando a quantidade de componentes conexos do grafo (em inglês). Todo caso de teste deve ter uma linha em branco no final, inclusive o último caso de teste.\n                \n                    Obs: os nodos devem sempre ser apresentados em ordem crescente e se há caminho de a até b significa que há caminho de b até a.","input":"A primeira linha do arquivo de entrada contém um valor inteiro N que representa a \n                    quantidade de casos de teste que vem a seguir. Cada caso de teste contém dois valores \n                    V e E que são, respectivamente, a quantidade \n                    de Vértices e arestas (Edges) do grafo. Seguem E linhas na sequência, \n                    cada uma delas representando uma das arestas que ligam tais vértices. \n                    Cada vértice é representado por uma letra minúscula do alfabeto ('a'-'z'), ou seja, \n                    cada grafo pode ter no máximo 26 vértices. Cada grafo tem no mínimo 1 componente conexo.\n                    \n                        Obs: Os vértices de cada caso de teste sempre iniciam no 'a'. Isso significa que um caso de teste que tem 3 vértices, \n                    tem obrigatoriamente os vértices 'a', 'b' e 'c'.","level":4,"name":"Componentes Conexos","has_images":true,"description":"Com base nestas três definições:\n                    \n                        Grafo conexo: Um grafo G(V,A) é conexo se para cada par de nodos u e v existe um caminho entre u e v. Um grafo com apenas um componente é um grafo conexo.\n                    \n                        Grafo desconexo: Um grafo G(V,A) é desconexo se ele for formado por 2 ou mais componentes conexos.\n                    \n                        Componente conexo: Componentes conexos de um grafo são os subgrafos conexos deste grafo.\n                    \n                        O grafo a seguir possui 3 componentes conexos. O primeiro é formado pelos nodos a,b,c. O segundo é formado unicamente pelo nodo d e o terceiro componente é formado pelos nodos e,f.\n                \n                    \n                \n                    Com base nestes conceitos, onde cada entrada fornecida que tem a identificação de cada um dos vértices, arestas e as ligações entre os vértices através destas arestas,  liste cada um dos componentes conexos que existem no grafo, segundo a entrada fornecida.","id":"1082","category":"Grafos","statistics":{"level":"4 / 10","submissions":7641,"solved":2610,"ratio":"34.16%"}}