{"output":"Para cada caso de teste, imprima uma linha com o percurso posfixo (sub-árvore esquerda, sub-árvore direita, raíz).","input":"A entrada irá conter um ou mais casos de teste. Cada caso de teste consiste em uma linha contendo duas strings representando o percurso prefixo e infixo de uma árvore binária. Ambas as strings consistem de letras maiúsculas, sem repetir. (Então elas não são maiores de 26 caracteres.)\n                    \n                    Entrada termina com EOF (fim de arquivo).","level":3,"name":"Recuperação da Árvore","has_images":false,"description":"A pequena Valentina gostava muito de brincar com árvores binárias. Seu jogo favorito era construir árvores binárias aleatórias com letras em maiúsculo nos nodos.\n                    \n                    Este é um exemplo de uma de suas criações:\n                     \n                \n                    D\n                        / \\\n                        /   \\\n                        B     E\n                        / \\     \\\n                        /   \\     \\\n                        A     C     G\n                                  /\n                                /\n                              F\n                     \n                \n                    Para salvar suas árvores para uso futuro, ela escreveu duas strings para cada árvore: o percurso prefixo (raíz, sub-árvore esquerda, sub-árvore direita) e o percurso infixo (sub-árvore esquerda, raíz, sub-árvore direita).\n                    \n                    Para o desenho acima o percurso prefixo é DBACEGF e o infixo é ABCDEFG.\n                    \n                    Agora, anos depois, olhando para as strings, ela notou que reconstruir as árvores era realmente possível, mas só porque ela não havia usado a mesma letra duas vezes na mesma árvore.\n                    \n                    Reconstruir a árvore a mão tornou-se chato.\n                    \n                    Então agora ela pede que você escreva um programa que faça o trabalho por ela!","id":"1191","category":"Grafos","statistics":{"level":"3 / 10","submissions":3257,"solved":1622,"ratio":"49.80%"}}