{"output":"Cada linha de entrada, com exceção das linhas que contém o comando \"I\", deve produzir uma linha de saída. \n                        A saída deve ser de acordo com o exemplo fornecido abaixo. Não deve haver espaço em branco após o último caractere de cada linha, \n                        caso contrário, sua submissão receberá Presentation Error.","input":"A entrada contém N operações utilizando letras (A-Z,a-z) sobre uma árvore binária de Busca, que inicialmente se encontra vazia. \n                        A primeira linha de entrada contém a inserção de algum elemento. As demais linhas de entrada podem conter quaiquer um dos comandos descritos acima, \n                        conforme exemplo abaixo. O final da entrada é determinado pelo final de arquivo (EOF).\n                    \n                        Obs: Considere que não serão inseridos elementos repetidos na árvore.","level":5,"name":"Operações em ABP I","has_images":false,"description":"Marcela recebeu como trabalho de Algoritmos a tarefa de fazer um programa que implemente uma Árvore Binária de Pesquisa (ou Busca). \n                    O Programa deve aceitar os seguintes comandos:\n                \n                    \n                        I n: Insere na árvore binária de pesquisa o elemento n.\n                    \n                        INFIXA: lista os elementos já cadastrado segundo o percurso infixo\n                    \n                        PREFIXA: lista os elementos já cadastrado segundo o percurso prefixo\n                    \n                        POSFIXA: lista os elementos já cadastrado segundo o percurso posfixo\n                    \n                        P n: pesquisa se o elemento n existe ou não.\n                \n                \n                    A qualquer momento pode-se inserir um elemento, visitar os elementos previamente inseridos na ordem infixa, prefixa ou posfixa \n                    ou ainda procurar por um elemento na árvore para saber se o elemento existe ou não.","id":"1200","category":"Grafos","statistics":{"level":"5 / 10","submissions":3258,"solved":1299,"ratio":"39.87%"}}