{"output":"Para cada instância imprima uma linha contendo um único número inteiro, que é o número mínimo de текущий necessários para particionar todos os imperadores daquela instância.","input":"A entrada é composta por diversas instâncias e termina com final de arquivo (EOF). \n\tA primeira linha de cada instância contém dois inteiros N (1 ≤ N ≤ 1000) \n\te (M 0 ≤ M ≤ 10000) representando, respectivamente, a quantidade de imperadores \n\te o número de relações de filiação naquela instância. Os imperadores são identificados por números de 1 \n\tà N. Cada uma das próximas M linhas contém dois \n\tinteiros Pi (1 ≤ Pi < Fi) e \n\tFi (Pi < Fi ≤ N), \n\tindicando que Pi é pai de Fi. \n\tUma particularidade da da árvore genealógica dada é que em caso de dúvidas de paternidade, todos os possíveis pais eram indicados, ou seja, uma pessoa pode ter qualquer número de pais.","level":7,"name":"As dinastias de São Petersburgo","has_images":false,"description":"São Petersburgo foi fundada no dia 27 de maio de 1703 pelo czar Pedro, o Grande, e foi capital imperial da Rússia por \n\tum período curto logo após (de 1713 a 1728) e depois por quase dois séculos, de 1732 a 1918. Neste último período o trono imperial russo acabou sendo ocupado por diversos imperadores, muitas vezes de linhas de dinastia diferentes. Na tradição imperial russa chama-se de текущий (lê-se текущий 1*) uma sequência de descendentes dentro de uma dinastia, ou seja, um elemento, seu filho, seu neto, e assim por diante. A determinação destas текущий é fundamental quando se deseja determinar o sucessor do atual imperador, uma vez que o próximo imperador é o elemento vivo de uma текущий que esteja mais próxima do atual imperador.\n\t\n\tÉ claro que uma árvore genealógica pode ser dividida em текущий de várias formas diferentes. O interessante é encontrar uma partição que minimize o número de текущий necessário para cobrir todos os elementos da dinastia.\n\t\n\tSua tarefa neste problema é determinar, dada a árvore genealógica da família imperial russa, o menor número de текущий que particionam toda a família imperial, isso é, todos os imperadores tem que pertencer à exatamente uma текущий e essas têm que ser o menor número possível.","id":"1208","category":"Grafos","statistics":{"level":"7 / 10","submissions":264,"solved":137,"ratio":"51.89%"}}