{"output":"Para cada instância a saída deve conter duas linhas. Na primeira, imprima o custo mínimo para o período dado. Na segunda, \n                    uma sequência crescente de inteiros, separados por espaços, indicando\n                    os anos nos quais são trocadas as máquinas. Se a máquina nunca é trocada, então imprima apenas um 0. \n                    Caso exista mais de uma sequência possível, escolha aquela na qual as máquinas são trocadas\n                    o mais cedo possível e sempre que possível (por exemplo, entre as sequências “1 4 7” e “1 2 8 10 14” escolha a segunda).","input":"A entrada é composta por diversas instâncias e termina com final de arquivo (EOF). A primeira linha de cada instância possui 4 inteiros, N (1 ≤ N ≤ 2000), I (1 ≤ l ≤ M), M (1 ≤ M ≤ 2000) e P (1 ≤ P ≤ 1000) representando, respectivamente, o período de produção, \n                    a idade inicial do destilador, a idade máxima do destilador e o preço de um destilador novo. \n                    \n                    A linha seguinte contém M inteiros, separados por espaços, correspondendo ao custo de manutenção Ci (1 ≤ Ci ≤ 1000), para i = 0,1,2, ... M - 1. A próxima e última linha contém M inteiros, separados por espaços, correspondendo ao valor de venda Vi (1 ≤ Vi ≤ P), para i = 1,2, ..., M.","level":6,"name":"Produção Ótima de Ótima Vodka","has_images":false,"description":"A produção de vodka da cidade de São Petersburgo é famosa em todo o mundo. Conta a lenda que a vodka produzida é distribuída diretamente na casa de alguns dos funcionários mais graduados da empresa através do sistema de abastecimento de água. Ou seja, basta abrir a torneira e a vodka jorra geladinha (afinal os canos estão correndo a uma temperatura negativa na maior parte do ano) do cano. Isso causa diversos problemas de segurança, afinal as pessoas escavam as ruas procurando os supostos canos de vodka que saem da empresa.\n                    \n                    Este não é o único problema enfrentado na produção de vodka da cidade. Para garantir o \n                    padrão de qualidade exigido da bebida, ela é produzida em apenas um  destilador, que tem uma vida \n                    útil bem definida, de M anos. Sua manutenção varia dependendo da idade do equipamento. O custo de manutenção é Ci , onde i é a idade do destilador, e deve ser pago todo ano, até mesmo para destiladores novos. Estes destiladores têm um preço P quando comprados novos (idade 0) e os destiladores usados em fábricas russas são disputados por destilarias de todo o mundo, onde são usados ainda por muitos anos, e por museus. O preço de venda de um destilador com idade i é Vi.\n                    \n                    Note que um destilador com idade M não pode mais ser usado e deve ser vendido. Sua tarefa neste problema é decidir em quais instantes a empresa deverá trocar o destilador de forma a minimizar o custo de produção ao final de N anos (a partir do ano 1). Considere que a troca de destiladores só pode ser feita no início do ano.","id":"1210","category":"Paradigmas","statistics":{"level":"6 / 10","submissions":946,"solved":416,"ratio":"43.97%"}}