{"output":"Para cada caso de teste imprima uma linha contendo um único número, com exatamente duas casas decimais, indicando o maior diâmetro de bolinha tal que esta consiga percorrer todo o brinquedo.","input":"A primeira linha de um caso de teste contém um inteiro N (1 ≤ N ≤ 103) indicando o número de aletas do brinquedo. A segunda linha contém dois inteiros L (1 ≤ L ≤ 103) e H (1 ≤ H ≤ 103), indicando respectivamente a distância entre as hastes e a altura das hastes do brinquedo. A haste esquerda do brinquedo está na posição 0 do eixo de ordenadas X, de forma que a haste direita está na posição L do eixo X.\n\t\n\tCada uma das N linhas seguintes descreve uma aleta. As aletas são descritas da mais alta para a mais baixa, de forma alternada em relação à haste na qual a aleta está conectada. A aleta mais alta do brinquedo (a primeira a ser descrita) tem a extremidade ligada à haste esquerda; a segunda aleta mais alta (a segunda a ser descrita) tem a extremidade ligada à haste direita, assim alternadamente. As aletas ímpares têm a extremidade ligada à haste esquerda, as aletas pares têm a extremidade ligada à haste direita.\n\t\n\tCada aleta é descrita em uma linha contendo três números inteiros Yi, Xf (0 < Xf < L) e Yf (0 ≤ Yf ≤ H), separados por um espaço em branco. (Xf , Yf) indica a coordenada do final da aleta; para aletas ímpares a coordenada do início da aleta  é (0, Yi (0 ≤ Yi ≤ H)), e para aletas pares a coordenada do início da aleta é (L, Yi ). \n\t\n\tPara todas as aletas Yi > Yf  (ou seja, há um declive entre o início e o final da aleta), e o comprimento da aleta é menor do que a largura do brinquedo. Além disso, para duas aletas consecutivas A e B, Yfa >= YiB  (ou seja, o final da aleta A tem altura maior do que ou igual ao início da aleta B). Considere que as aletas são muito finas, de forma que a sua espessura pode ser desconsiderada, e que a sua largura é sempre maior do que o diâmetro da bolinha (ou seja, a bolinha sempre tem espaço lateral para deslizar pela aleta).","level":8,"name":"Tobogan de Bolinhas","has_images":true,"description":"Uma fábrica quer produzir um tobogan de brinquedo como o da figura abaixo, composto de duas hastes de madeira sustentando aletas que se alternam nas duas hastes. Uma bolinha de aço é solta na aleta mais alta do tobogan; sob efeito da gravidade, a bolinha desliza pelas aletas, \n\tterminando por sair do brinquedo.\n\t \n\n\t \n\n\t\n\tO projeto do brinquedo, contendo as especificações do tamanho, posição e inclinação das hastes e de cada aleta, foi feito pelo dono da fábrica, e milhares de unidades já estão sendo confeccionadas na China. O gerente da fábrica foi incumbido de comprar as bolinhas de aço, mas antes de fazer o pedido das milhares de bolinhas quer saber o diâmetro máximo da bolinha, para que esta não pare no meio do brinquedo.\n\t \n\n\t \n\n\t\n\tFigura 1: Dois exemplos: em (a) a bolinha chega ao final, e (b) a bolinha para no meio do brinquedo e não chega ao final.\n\t\n\tO gerente da fábrica quer que você escreva um programa que, dadas as especificações do brinquedo, determine o diâmetro máximo da bolinha para que esta não pare no meio do brinquedo.","id":"1223","category":"Geometria Computacional","statistics":{"level":"8 / 10","submissions":1313,"solved":416,"ratio":"31.68%"}}