{"output":"Compute o comprimento médio das palavras do enunciado do problema, e mostre a classificação do problema, \n                    para mais detalhes olhe o exemplo abaixo.","input":"A entrada contém vários casos de teste. Cada caso de teste é composto por uma linha que contém o \n                    enunciado de um problema, é uma string que contém entre 1 e 50 caracteres ('A'-'Z', 'a'-'z', '0'-'9', ' ', '.'), \n                    inclusive.\n                    O final da entrada é determinado por EOF.","level":6,"name":"O Quão Fácil é...","has_images":false,"description":"TopCoder decidiu automatizar o processo de atribuição de níveis de dificuldade para os problemas. \n                    Os desenvolvedores do TopCoder concluíram que a dificuldade do problema esta relacionado apenas ao \n                    comprimento médio das palavras do enunciado do problema.\n                    Se o comprimento médio das palavras do enunciado é menor ou igual a 3, o problema recebe dificuldade de 250 pontos.\n                    Se o comprimento médio das palavras do enunciado for 4 ou 5, o problema recebe dificuldade de 500 pontos.\n                    Se o comprimento médio das palavras do enunciado for maior ou igual a 6, o problema recebe dificuldade de 1000 pontos.\n                \n                \n                    Definições:\n                    Símbolo: um conjunto de carateres ligados em ambos os lados por espaços, ou pelo início da \n                    descrição do problema, ou ainda pelo fim da descrição do problema.\n                    Palavra: um símbolo que contenha apenas letras a-z ou A-Z, e pode terminar com um único ponto.\n                    Comprimento da palavra: número de letras de uma palavra (um ponto não é uma letra).\n                \t\n                    Exemplos de símbolos que são palavras (aspas duplas apenas para exemplificar): \"AB\", \"ab\".\n                    Exemplo de símbolos que não são palavras: \"ab..\", \"a.b\", \".ab\", \"a.b.\", \"a2b.\", \".\".\n                \n                    O comprimento médio das palavras é dado pela soma dos tamanhos das palavras do enunciado dividido \n                    pelo numero de palavras, a divisão é feita por números inteiros. Se o número de palavras for zero, \n                    então o comprimento médio das palavras é zero.\n                \n                    Sua tarefa é dado o enunciado do problema, computar a sua classificação de dificuldade do problema, \n                    que poderá ser 250, 500, ou 1000.","id":"1243","category":"Strings","statistics":{"level":"6 / 10","submissions":5749,"solved":1247,"ratio":"21.69%"}}