{"output":"Para cada caso, seu programa deve imprimir um inteiro\n                    representando o número de vezes que KiloMan é atingido.","input":"A entrada contém vários casos de teste. A primeira linha da\n                    entrada contém um inteiro N que indica o número de\n                    casos de teste. Cada caso de teste é composto por 3 linhas. A primeira linha contém um inteiro \n                    T (1 ≤ T ≤ 50) que indica o número de tiros. A segunda linha contém T\n                    inteiros, que representam a sequência das alturas às quais os\n                    tiros estão sendo disparados. Cada elemento da sequência será\n                    entre 1 e 7, inclusive. A terceira linha da entrada contém a\n                    string \"pulos\", que representa a sequência de pulos que KiloMan\n                    tentará; 'J' significa que ele irá pular e 'S' significa que\n                    ele ficará parado. Por exemplo, se o primeiro número da\n                    sequência de tiros for 3 e o primeiro caractere de \"pulos\" for\n                    'J', então KiloMan pulará assim que o chefão atirar a uma\n                    altura 3 (e, portanto, ele será atingido).","level":1,"name":"KiloMan","has_images":false,"description":"Você chegou a um dos últimos chefões no novo jogo de ação\n                    2-D de deslocamento lateral, KiloMan. O chefão tem uma arma\n                    grande que pode atirar projéteis em várias alturas. Para cada\n                    tiro, KiloMan pode ficar parado ou pular. Se ele ficar parado e\n                    o tiro estiver na altura 1 ou 2, ele será atingido. Se ele\n                    pular e o tiro estiver a uma altura maior que 2, então ele\n                    também será atingido. Caso contrário, ele não é atingido. Dada\n                    a altura de cada tiro e a sequência de pulos, quantas vezes\n                    KiloMan será atingido?","id":"1250","category":"Ad-Hoc","statistics":{"level":"1 / 10","submissions":3816,"solved":2638,"ratio":"69.13%"}}