{"output":"Converto o texto do documento que é dado na entrada, utilizando as específicações dadas acima e \n                    imprima em uma única linha, o novo texto do documento com as novas tags, para maiores \n                    esclarecimentos consulte o exemplo abaixo.","input":"A entrada contém vários casos de teste. Cada caso de teste é composto de três linhas. A primeira linha contém a tag original \n                    presente no texto do documento, que irá conter apenas letras (a-z, A-Z), e seu tamanho será entre 1 e 10 caracteres inclusive. \n                    A segunda linha contém um valor numérico pela qual a tag original deverá ser substituida, que será um número \n                    entre 1 e 1000 inclusive. A terceira e última linha terá entre 1 e 50 caracteres inclusive, \n                    e poderá conter os letras (a-z, A-Z), números (0-9), sinal de menor (<), sinal de maior (>), \n                    sinais de igual (=), barras (/), ou espaços em branco. Todos os '<' e '>' são usados apenas em tags.","level":4,"name":"Substituição de Tag","has_images":false,"description":"Você está no comando de um sistema de documentos que utiliza tags de código numérico para renderizar \n                    documentos para impressão. Há um lote de documentos com o texto baseado em tags, que você deve analisar \n                    e converter para tags numéricas para a entrada no sistema.\n                    Uma tag é iniciada por um caracter '<', que pode ser seguida por letras, números, barras ou espaços, \n                    e para finalizar a tag um caracter '>'. As tags não podem ser encaixadas umas nas outras.\n                \n                    As seguintes tags não são válidas:\n                    \">HI\", \"<a<b>c>\", \"<a b c><\", \"<a<b>\".\n                \n                    As seguintes tags são válidas:\n                    \"/=<>HI\", \"/<>H=I<>/\", \"<><><><>\", \"<a=/><b==//bb><c223>\", \"<a b c>\".\n                \n                    Para as comparações entre caracteres deve ser desconsiderado o case sensitive.","id":"1254","category":"Strings","statistics":{"level":"4 / 10","submissions":2457,"solved":954,"ratio":"38.83%"}}