{"output":"A saída deverá ser impressa conforme os exemplos fornecidos abaixo, onde a quantidade de linhas de cada caso de teste é determinada pelo valor de M. Uma linha em branco deverá separar dois conjuntos de saída.","input":"A entrada contém vários casos de teste. A primeira linha de entrada contém um inteiro N indicando a quantidade de casos de\n\tteste. Cada caso de teste é composto por duas linhas. \n\tA primeira linha contém um valor M (1 ≤ M ≤ 100) que indica a quantidade de \n\tendereços-base na tabela (normalmente um número primo) seguido por um espaço e um \n\tvalor C (1 ≤ C ≤ 200) que indica a quantidade de chaves a serem armazenadas. \n\tA segunda linha contém cada uma das chaves (com valor entre 1 e 200), separadas por um espaço em branco.","level":5,"name":"Tabelas Hash","has_images":false,"description":"As tabelas Hash, também conhecidas como tabelas de dispersão, armazenam elementos com base no valor absoluto de suas chaves e em técnicas de tratamento de colisões. Para o cálculo do endereço onde deve ser armazenada uma determinada chave, utiliza-se uma função denominada função de dispersão, que transforma a chave em um dos endereços disponíveis na tabela.\n                    \n\tSuponha que uma aplicação utilize uma tabela de dispersão com 13 endereços-base (índices de 0 a 12) e empregue a função de dispersão h(x) = x mod 13, em que x representa a chave do elemento cujo endereço-base deve ser calculado.\n                    \n\tSe a chave x for igual a 49, a função de dispersão retornará o valor 10, indicando o local onde esta chave deverá ser armazenada. Se a mesma aplicação considerar a inserção da chave 88, o cálculo retornará o mesmo valor 10, ocorrendo neste caso uma colisão. O Tratamento de colisões serve para resolver os conflitos nos casos onde mais de uma chave é mapeada para um mesmo endereço-base da tabela. Este tratamento pode considerar, ou o recálculo do endereço da chave ou o encadeamento externo ou exterior.\n                    \n\tO professor gostaria então que você o auxiliasse com um programa que calcula o endereço para inserções de diversas chaves em algumas tabelas, com funções de dispersão e tratamento de colisão por encadeamento exterior.","id":"1256","category":"Estruturas e Bibliotecas","statistics":{"level":"5 / 10","submissions":9389,"solved":3193,"ratio":"34.01%"}}