{"output":"Para cada caso de teste da entrada, seu programa deve produzir uma linha contendo ou “Mission impossible” ou “Contact informer K”, onde \"K\" é o índice do informante (como dado na entrada) com o maior coeficiente de infiltração, que pode ser alcançado pelo espião sem ir dentro de qualquer área de cobertura de radar. Se houver mais do que um informante que satisfaça esta condição, seu programa deve imprimir aquele te tiver o menor índice.","input":"A entrada consiste de diversos casos de teste. A primeira linha de cada caso de teste descreve a borda do país inimigo, no formato:\n                    \n                    B X1 Y1 X2 Y2 ... XB YB \n                    \n                    onde 3 ≤ B ≤ 1000 é o número de pontos na borda, e cada Xi Yi é a coordenada do enésimo ponto na borda. A borda do país consiste de segmentos de linha entre os pontos i e i + 1, e entre os pontos B e 1. A segunda linha denota o número de informantes e as suas respectivas posições, no formato:\n                    \n                    N X1 Y1 X2 Y2 ... XN YN \n                    \n                    onde 1 ≤ N ≤ 1000 é o número de informantes, e Xi Yi é a coordenada do enésimo(i-th) informante. A terceira linha descreve a posição e o raio dos radares, no formato:\n                    \n                    M X1 Y1 R1 X2 Y2 R2 ... XM YM RM \n                    \n                    onde 1 ≤ M ≤ 30 é o número de radares, Xi Yi é a coordenada do enésimo (i-th) radar, e Ri é o raio do enésimo (i-th) radar. Todas as coordenadas não inteiros 0 ≤ X, Y ≤ 1000. O raio dos radares são inteiros no intervalo 1 ≤ R ≤ 1000. Um caso de teste onde B = N = M = 0 indica o final da entrada. Este caso de teste não deverá ser processado.","level":8,"name":"Missão Impossível","has_images":true,"description":"Você foi contratado para explorar o território inimigo. É um negócio arriscado, você sabe disso. Então, é melhor você estar preparado! O inimigo colocou uma série de pontos de segurança por todo o país, a partir do qual os radares estão detectando qualquer veículo em movimento dentro de sua faixa de cobertura. Qualquer objeto detectado será imediatamente destruído. Felizmente lhe foi dado pelo seu governo um mapa do território inimigo, consistindo de coordenadas e dos raios de cobertura de cada radar. Você também tem uma lista de informantes locais (juntamente com suas localizações) com os quais poderá entrar em contato para obter informações valiosas. Sua missão é tentar entrar em contato com um desses informantes, de preferência aquele com maior coeficiente de infiltração. O coeficiente de infiltração de cada informante é simplesmente a distância do informante até a borda do país, onde tal distância é definida como o mínimo sobre todas as distâncias a partir da localização do informante até cada ponto da fronteira. Em sentido intuitivo, o informante com o maior coeficiente de infiltração é aquele que está localizado o máximo possível dentro do país e, presumivelmente, terá informações mais valiosas sobre o país.\n                    \n                    Seu primeiro pensamento é então projetar um programa de computador que vai verificar se existe um caminho de sua posição inicial, sempre o ponto (2000, 2000), até a localização de qualquer um dos informantes, sem cruzar qualquer região que é coberta pelo radar. Sempre que possível, o programa deve indicar qual informante alcançável é aquele que deverá ser contactado, de acordo com os critérios de coeficiente de infiltração acima descritos.\n                \n                    \n                        \n                    \n                        Figura 1: Cenário Possível: o país inimigo tem a forma de um polígono simples (não necessariamente convexo).\n                \n                \n                     \n                \n                    Lembre-se que um polígono é chamado de simples se ele é descrito por um único limite não intersectado. As fronteiras do país serão dadas como uma seqüência de coordenadas X, Y correspondentes à seqüência de vértices do polígono. Você pode considerar que todos os centros do radar e coordenadas dos informantes estão localizados dentro das fronteiras do país. Note contudo, que a área coberta pelos radares podem incluir regiões de fora da fronteira.\n                \n                     \n                \n                    No cenário exemplo da Figura 1, o informante I1 não pode ser conectado uma vez que ele está dentro da região coberta pelos radares. O informante I2, embora fora da região do radar, também não pode ser contactado uma vez que qualquer deslocamente até a localização dele irá através de regiões cobertas por radar, que são fatais. Ambos informantes I3 e I4 podem ser contactados e portanto, o informante I4 é o escolhido uma vez que o seu coeficiente de infiltração é maior do que o coeficiente do I3.","id":"1268","category":"Geometria Computacional","statistics":{"level":"8 / 10","submissions":91,"solved":29,"ratio":"31.87%"}}