{"output":"Cada problema de projeto da P-Network na entrada deverá gerar uma única linha de saída. Se o problema não tem solução a saída deve ser No solution. Caso contrário, a linha deverá conter uma descrição de uma P-Network qualquer (com N fios e menos do que 4N2 cursos), que realiza o conjunto de transformações solicitado. A descrição é dada por um conjunto de valores M, s1, s2, . . . sM, em que os valores consecutivos são separados por um único espaço em branco. O valor de M é o tamanho da P-Network, isto é, o número de cursos. Os valores de s1, s2, . . . sM descrevem os cursos da P-Network; isto deve ser entendido como o i-ésimo curso da esquerda para a direita, que liga os fios si e 1 + si (1 ≤ i ≤ M). Observe que 0 ≤ M < 4N2 , enquanto 1 ≤ si < N para cada 1 ≤ i ≤ M.","input":"A entrada tem um certo número de problemas de projeto da P-Network. Cada problema é descrito em apenas uma linha que contém os valores N, i1, i2,. . . iN, separados por um único espaço em branco. O valor de N é a ordem da P-Network desejada, isto é, o seu número de fios (1 ≤ N ≤ 20). Os valores i1, i2,. . . iN representam que a P-Network deve determinar o conjunto de transformações {1 → i1, 2 → i2,. . . N → iN} (1 ≤ ij ≤ N, para cada 1 ≤ j ≤ N). A entrada termina com uma linha com N = 0 e que não deve ser processada.","level":5,"name":"P-Networks","has_images":true,"description":"Pretty Networks Inc. é uma empresa que constrói alguns artefatos curiosos, cujo propósito é transformar um conjunto de valores de entrada de uma determinada maneira. A transformação é determinada por aquilo que eles chamam de uma P-Network. A imagem abaixo mostra um exemplo de uma P-Network.\n                \n                    \n                \n                    No caso geral, uma P-Network de ordem N e tamanho M, tem N fios horizontais numerados de 1, 2,. . . N, e M cursos verticais. Cada curso conecta dois fios consecutivos. Não há dois cursos diferentes tocando o mesmo ponto de nenhum fio e não há nenhum curso tocando o ponto mais à esquerda ou mais à direita de qualquer fio. O exemplo acima é uma P-Network de ordem 5 e tamanho 9.\n                    \n                    A transformação determinada por uma P-Network pode ser explicada através de um conjunto de regras que governam a maneira como um P-Network deve ser percorrida:\n                    1. comece no ponto mais à esquerda de um fio, e vá para a direita;\n                    2. cada vez que um curso aparecer mude para o fio conectado, e continue indo da esquerda para a direita;\n                    3. pare quando o ponto mais à direita de um fio for alcançado.\n                    Se partindo do fio i a travessia termina no fio j, dizemos que o P-Network transforma i em j, e denotamos isso com i → j. No exemplo acima, o P-Network determina o conjunto de transformações\n                \n                    {1 → 3, 2 → 5, 3 → 4, 4 → 1, 5 → 2}.\n                \n                    A empresa Pretty Networks contratou você para resolver o seguinte problema de projeto da P-Network: dado um número N e um conjunto de transformações {1 → i1, 2 → i2, . . . N → iN}, decida se uma P-Network de ordem N pode ser construída para realizar estas transformações e, nesse caso, forneça uma P-Network que faça isto.\n                    \n                    Quando existe uma solução com um determinado tamanho, em muitos casos há uma outra solução com um tamanho maior. Cientistas da Pretty Networks afirmaram que se existe uma solução para um problema de projeto da P-Network, então esta solução tem tamanho inferior a 4N2 . Portanto, eles estão interessados apenas em soluções com um tamanho inferior a este limite.","id":"1274","category":"Estruturas e Bibliotecas","statistics":{"level":"5 / 10","submissions":253,"solved":139,"ratio":"54.94%"}}