{"output":"Para cada caso de teste da entrada seu programa deverá produzir uma linha de saída, contendo ou um inteiro indicando o menor número de lâmpadas necessárias para alcançar uma configuração vencedora caso ela existir. Caso contrário, seu programa deverá imprimir a mensagem ‘No solution’, conforme exemplo abaixo.","input":"A entrada contém vários casos de teste. A primeira linha de um caso de teste contém dois números inteiros N, M indicando respectivamente o número de linhas e o número de colunas da placa (1 ≤ N ≤ 7, 1 ≤ M ≤ 7). A segunda linha contém um B inteiro que indica o número de quadrados do tipo barreira (0 ≤ B ≤ N × M). Cada uma das B linhas seguintes descrevem uma barreira, que contém três inteiros R, C e K, representando, respectivamente, o número da linha (1 ≤ R ≤ N), o número da coluna (1 ≤ C ≤ M) e o número da barreira (-1 ≤ K ≤ 4). K = -1 significa que a barreira é não numerada. O final da entrada é indicado por N = M = 0.","level":8,"name":"Light Up","has_images":true,"description":"Light Up (Iluminar - em português) é um enigma ou jogo definido em uma placa retangular dividida em quadrados menores. Alguns quadrados desta placa são \"vazios\" (quadrados brancos na figura abaixo) e outros quadrados são \"barreiras\" (quadrados escuros na figura abaixo). Um quadrado que indica uma barreira pode ter um número inteiro i associado a ele (0 ≤ i ≤ 4).\n\n\t\n\n\tFigura: (a) Puzzle com 6 linhas, 7 colunas e 7 barreiras; (b) uma solução para o enigma.\n    \n\tNeste puzzle o objetivo é \"iluminar\" todos os quadrados vazios, colocando lâmpadas em alguns dos quadrados (as lâmpadas são representadas como círculos na figura). Cada lâmpada ilumina o quadrado em que está além de todos os quadrados alinhados com ele, horizontalmente ou verticalmente até um quadrado que contenha uma barreira ou até o fim do tabuleiro.\n\tUma configuração vencedora satisfaz as seguintes condições:\n\t• todos os quadrados vazios devem ser acesos;\n\t• a luz não pode ser acesa por outra lâmpada;\n\t• todos os quadrados numerados como barreira devem ter exatamente o número de lâmpadas adjacentes a eles (nos seus quatro lados acima, abaixo, e para o lado);\n\t• quadrados que indicam uma barreira não numerados podem ter qualquer número de lâmpadas adjacentes a eles.\n                \n\tVocê deve escrever um programa para determinar o menor número de lâmpadas que são necessárias para alcançar uma configuração vencedora.","id":"1275","category":"Grafos","statistics":{"level":"8 / 10","submissions":80,"solved":32,"ratio":"40.00%"}}