{"output":"Para cada caso de teste imprima os nomes de todos os estudantes que não cumpriram a presença mínima requerida, separados por\n                    um espaço.  Não deixe espaços sobrando no final da linha.","input":"A entrada possui diversos casos de testes. A primeira linha da entrada contém um inteiro\n                    T, que indica o número de casos de testes que se seguem.\n                    \n                    Cada caso de teste é composto por três linhas:\n                    \n                        A primeira linha de um caso de teste irá conter um inteiro\n                        N (0 ≤ N ≤ 100) que indica o número de estudantes na turma.\n                        A segunda linha conterá N nomes de estudantes com até 50 caracteres cada nome, separados por um único espaço.\n                        Todos os nomes irão conter somente letras maiúsculas e minúsculas\n                        (‘A’-‘Z’,‘a’-‘z’).\n                        A terceira linha conterá N registros de frequência, correspondentes aos respectivos estudantes da\n                        linha anterior. Os registros virão separados por um único espaço, e contêm\n                        apenas os caracteres ‘A’, ‘P’ e ‘M’. Um ‘P’ indica que o estudante estava presente à\n                        aula, ‘A’ indica que ele estava ausente (ele cabulou à aula) e ‘M’ mostra que, apesar de não ir à aula,\n                        ele entregou um atestado médico, então esta aula não deverá ser considerada no cálculo da frequência do estudante.\n                        Registros de frequência conterão ao menos um caracter ‘A’ ou ‘P’.","level":4,"name":"Pouca Frequência","has_images":false,"description":"Os estudantes da tua universidade recentemente adquiriram o desagradável hábito de cabular as aulas. Para enfrentar este\n                    problema o seu Conselho de Professores decidiu somente permitir que estudantes com ao menos 75% de presença prestem os exames. A partir de uma lista de nomes de estudantes e seus respectivos registros de frequência, imprima o nome dos estudantes que não\n                    obtiveram o mínimo de presença às aulas e que consequentemente não poderão prestar os exames.","id":"1277","category":"Strings","statistics":{"level":"4 / 10","submissions":6274,"solved":2144,"ratio":"34.17%"}}