{"output":"Para cada conjunto de entrada, deve ser impresso um único valor com 4 casas decimais indicando a probabilidade de ganhar do jogador I, conforme apresentado no exemplo abaixo.","input":"A primeira linha de entrada irá conter um inteiro S (S ≤ 1000), que indica a quantidade de casos de teste. Cada caso de teste é composto por uma única linha contendo 3 valores, separados por um espaço em branco. O primeiro destes 3 valores é um inteiro N (N ≤ 1000) que indica o número de jogadores. Segue um número de ponto flutuante P que indica a probabilidade de ocorrência de um evento desejado ou bem sucedido em um único lançamento de dado (Se por exemplo, \"bem sucedido\" significa conseguir um número 3, então P é a probabilidade de obter 3 em uma partida. Para um dado normal a probabilidade de se obter 3 é 1/6). O terceiro e último valor de cada caso de teste é um inteiro I (I ≤ N) que é o número de série do jogador cuja probabilidade de vencer deverá ser determinado (varia de 1 até N, inclusive). Você pode assumir que nenhum valor inválido de probabilidade (P) será fornecido como entrada.","level":6,"name":"Qual é a Probabilidade?","has_images":false,"description":"Probabilidade sempre foi uma parte importante de algoritmos. Os algoritmos probabilísticos vem para suprir uma lacuna deixada pelos algoritmos determinísticos, que não conseguem resolver determinados problemas em curto espaço de tempo. Neste problema, não estamos lidando com qualquer algoritmo probabilístico. Vamos apenas tentar determinar a probabilidade de ganhar de um determinado jogador.\n                 \n                    ​Um jogo é jogado através do arremesso de um dado(que não se deve presumir que ele tem seis lados como um dado comum). Se um determinado evento ocorre quando um jogador joga os dados (tal como a obtenção de um 3, ficando lado verde em cima ou seja lá o que for) este é declarado o vencedor. Tal jogador pode ser o jogador N. Assim, o primeiro jogador vai jogar os dados, depois o segundo e, finalmente, o jogador N e, novamente, o primeiro e assim por diante. Quando um jogador obter um determinado resultado ele é declarado vencedor e o jogo termina. Você terá que determinar a probabilidade de ganhar de um (O enésimo) destes jogadores.","id":"1289","category":"Matemática","statistics":{"level":"6 / 10","submissions":782,"solved":324,"ratio":"41.43%"}}