{"output":"Para cada linha de entrada, você deve produzir uma linha de saída, que contém um número de ponto flutuante F. F é a maior distância possível entre a casa de Romeu e casa de Julieta, e tem três dígitos após o ponto decimal.","input":"A entrada contém vários casos de teste e termina com final de arquivo (EOF). Cada caso de teste é composto por uma linha que coném seis valores de ponto-flutuante, x1, y1, x2, e y2 (0 ≤ x1, y1, x2, y2 ≤10000) CMD, ENF. Aqui (x1, y1) é a coordenada de A, (x2, y2) é a coordenada de B, CMD é o ângulo entre as direções dos canhões apontados na direção de M e ENF é o valor similar para o ponto N.","level":6,"name":"Romeu e Julieta!","has_images":true,"description":"Neste problema, vamos discutir os problemas de um Romeu moderno e uma Julieta moderna. Você está convidado a resolver os problemas deles para que eles não tenham que ser um par trágico como o de Shakespeare. Como de costume as famílias de Romeu e Julieta têm relações hostis e por isso eles estão trancados em dois lugares diferentes M e N. Dois canhões são colocados no local A e dois canhões são colocados no local B. Um canhão na localização A é apontado para M e o outro é apontado para N. a mesma coisa se ​​aplica aos dois canhões de localização B. M e N estão sempre no lado oposto de AB.\n\n                \n                    ​Fig: Cenário parcial de Romeu e Julieta\n\n                \n                    Os movimentos dos canhões, que estão visando M, estão interrelacionados, ou seja, o ângulo entre suas direções é constante. Portanto o ângulo CMD ((5 graus) ≤ (ângulo CMD) <(80 graus)) é constante. A mesma regra se aplica aos outros dois canhões. Ou seja, o ângulo ENF ((5 graus) ≤ (ângulo ENF) <(80 graus)) também é constante. Todas essas coisas são mostradas na imagem acima. Mas outra coisa que é importante e que está faltando na figura acima é que os locais N, A, M, são mantidos sempre em uma linha reta. A razão por trás disso é muito estranha. Um robô foi contratado como guarda de Romeu e Julieta. Ele tem dois olhos em lados opostos da sua cabeça e este robô é posicionado no ponto A. Para ser mais preciso, A, B e ângulo de CMD e ângulo ENF são constantes em um cenário e todas as outras posições ou valores são variáveis. Também lembro que o ponto M deve permanecer sempre apontado pelos dois canhões. A mesma coisa se ​​aplica ao ponto N.\n                \n                    O problema é que, nas noites estreladas Romeu canta a música \"Noites Azuis\" de \"Michael Learns to Rock\" em voz alta e ambos os pais não querem que Julieta ouça essa música. Então, eles querem colocar as casas (M e N), tão distantes uma da outra quanto for possível para preservar todas as restrições explicadas antes. Seu trabalho é medir esta máxima distância entre M e N e informá-la a Romeu, para que ele possa decidir se ele deve ou não cantar ou qual o volume de voz que deve usar.","id":"1293","category":"Geometria Computacional","statistics":{"level":"6 / 10","submissions":130,"solved":76,"ratio":"58.46%"}}