{"output":"Para cada caso de teste de saída imprima uma linha com um número racional que representa a profundidade d que deve ser permitido à ACM cavar o pedaço de terra, de modo que eles peguem uma área de minerais a partir da camada do meio no perfil exato A. O resultado deve ser saída como um número racional com exatamente cinco dígitos depois do ponto decimal, arredondado, se necessário.","input":"Cada caso de teste é descrito usando 5 linhas. A primeira linha contém 4 inteiros W, D, A e K, onde W é a largura do pedaço de terra que a ACM deseja minerar (1 ≤ W ≤ 8), D é a profundidade (1 ≤ D ≤ 10), A é a área da camada do meio com o perfil que a ACM deseja(1 ≤ A ≤ W x D), e K permite a definição das interfaces y1(x) e y2(x) conforme explicado acima (0 ≤ K ≤ 8). Cada uma das outras linhas contém K + 1 inteiros entre -108 e 108, inclusive. A segunda linha contem os coeficientes de p1(x) desde P1,0 até P1,K. A terceira linha contém os coeficientes de q1(x) desde Q1,0 até Q1,K. A quarta linha contém os coeficientes de p2(x) desde P2,0 até P2,K. A quinta linha contém os coeficientes de q2(x) desde Q2,0 até Q2,K. Em cada caso de teste, A é estritamente menor que a area total da camada do meio do perfil e existe um único valor d tal que de tal forma que uma profundidade de escavação d origina uma área de minerais a partir da camada do meio em um perfil exato A. Além disso, q1(x) 6= 0, q2(x) 6= 0 e -D < y2(x) < y1(x) < 0, para 0 ≤ x ≤ W.","level":9,"name":"Proteção do Meio Ambiente","has_images":true,"description":"Arsênico & Cyanide Mineração (ACM) é uma empresa que recentemente decidiu começar a desenvolver suas minas nas terras perto de sua cidade natal. Como um membro do comité de regulamentação dos cidadãos para as operações da ACM, sua tarefa é controlar o quanto a empresa pode extrair dessas terras, de modo que você terá que manter os empregos e os benefícios de sem sacrificar o meio ambiente e a saúde da população local.\n\n                \n                    A ACM tem planos para minerar vários pedaços retangulares de terra. Um pedaço de terra tem a largura W, pode ser desenterrado para uma profundidade máxima D, e tem uma superfície plana a qual nós consideramos ser a profundidade 0. Os minerais em um pedaço de terra estão organizados em três camadas, que podem variar na sua profundidade ao longo da largura deste pedaço, mas sempre tem o mesmo perfil ao longo do seu comprimento total. Por isso, a ACM está apenas interessado no perfil ao longo da largura de cada pedaço, e tem realizado trabalhos exploratórios, a fim de determinar com precisão a sua forma.\n\n                \n                    Como resultado, eles descobriram que as duas interfaces entre as três camadas de minerais pode ser representada por duas funções y1(x) e y2(x), em que a primeira descreve o limite entre a camada superior e da camada do meio, e o segundo descreve o limite entre a camada intermédia ea camada inferior. Estas funções são de tal forma que sempre\n\n                -D < y2(x) < y1(x) < 0 for 0 ≤ x ≤ W ,\n\n                \n                    ou seja, os limites das camadas não se tocam. Além disso, cada função está na forma yi(x) = pi(x)/qi(x), onde\n\n                ​\n                \n                \n                    para i = 1, 2 e um determinado inteiro K. A figura abaixo mostra o perfil dos dois pedaços de terra no formato representado pela ACM. O pedaço da esquerda tem largura W = 6 e profundidade D = 9, enquanto que o pedaço da direita tem W = 8 e D = 10. Os limites das camadas de cada pedaço são descritos pelas funções definidas abaixo deles.\n\n                ​\n                \n                \n                    A ACM vai cavar tudo em um pedaço de terra até uma certa profundidade de escavação d, e, em seguida, vender todos os minerais assim obtidos para lucrar com isso. No entanto, os minerais da parte superior e das camadas inferiores são essencialmente sem valor, de modo que o lucro de toda a operação vem exclusivamente a partir desses minerais na camada do meio. Na verdade, o lucro é proporcional a área A da camada do meio no perfil que está a uma profundidade de pelo menos d. Dada a descrição de um pedaço de terra e um inteiro A, você gostaria de saber a profundidade de escavação d que você deve permitir que o ACM escave a fim de que peguem uma área de minerais na camada do meio com o perfil exato A.\n                    \n                    Na figura abaixo você pode ver a resposta dos dois casos de teste para a mesma entrada. Para o pedaço da esquerda, a fim de pegar uma área A = 14, a profundidade de escavação deve ser de pelo menos d = 4.00000, enquanto que para o pedaço da direita de área também igual a 14, requer uma profundidade de escavação d = 5.51389.","id":"1297","category":"Matemática","statistics":{"level":"9 / 10","submissions":272,"solved":170,"ratio":"62.50%"}}