{"output":"Para cada caso de teste imprima uma linha com um número inteiro que representa o número mínimo de interruptores de barreira necessárias para reconfigurar o tanque conforme especificado.","input":"Cada caso de teste consiste de diversas linhas. A primeira linha contém um inteiro N que indica que a lagoa tem 2N linhas 2N + 1 colunas ( 1 ≤ N ≤ 300). Cada uma das próximas 2N - 1 linhas contém uma string de N caracteres descrevendo a orientação das barreiras. Na enésima (i-th) linha, o enésimo (j-th) caractere indicata a orientação da barreira cujo ponto central tem coordenadas (i, 2j - 1) se i for ímpar, ou (i, 2j) caso i for par, para i = 1, 2,..., 2N - 1 e j = 1, 2,..., N. O caracter é a letra maiúscula 'V' se a orientação for vertical ou a letra maiúscula 'H' se ela for horizontal.","level":5,"name":"Corrija o Labirinto","has_images":true,"description":"A fazenda de camarão usa um lago retangular construído como uma grade com linhas 2N e colunas 2N + 1 de células quadradas, para um dado inteiro N. Cada lado da célula tem um metro de comprimento. A lagoa tem exatamente (2N-1) x N barreiras de dois metros de comprimento, usado para isolar temporariamente seções menores dentro da lagoa para criação de diferentes tipos de camarão. As barreiras têm os seus pontos médios fixados precisamente nas coordenadas inteiro (a, b), para todo 0 <a <2N e 0 <b <2N + 1, onde a e b são ímpares, ou pares.\n                \n                    ​​Cada barreira pode ser girada em torno do seu ponto central para alterar a configuração do tanque, no entanto, sendo girada, uma barreira muda entre apenas duas posições possíveis, sempre sendo estas posições paralelas aos lados da lagoa, vertical ou horizontal. A parte esquerda da figura abaixo mostra uma configuração de tanque, com N = 3.\n                    ​\n\n                \n\n                \n                    \n                    No final de cada temporada a lagoa é fechada para manutenção e limpeza. Em seguida, deve ser reconfigurada para que uma máquina especial possa varrer o chão da lagoa. A máquina inicia o seu trabalho na célula superior esquerda, e precisa passar por todas as células exatamente uma vez, terminando na célula inferior esquerda. A parte direita da figura mostra uma reconfiguração tal, onde seis barreiras foram trocados. Para este exemplo, porém, quatro chaves de barreira seriam suficientes.\n                \n                    Você deve escrever um programa que, dada uma configuração de lagoa, determina o número mínimo de interruptores de barreira necessários para reconfigurar a lagoa, conforme especificado acima. Existe sempre, pelo menos, uma maneira possível para reconfigurar o tanque de acordo com a especificação.","id":"1298","category":"Grafos","statistics":{"level":"5 / 10","submissions":166,"solved":97,"ratio":"58.43%"}}