{"output":"Para cada caso de teste imprima uma linha com um inteiro que representa o número do jogador (1 ou 2) que vai ganhar o jogo, se ambos jogarem de maneira perfeita.","input":"Cada caso de teste é descrito utilizando várias linhas. A primeira linha contém dois inteiros R e C que representam respectivamente o número de linhas e o número de colunas do tabuleiro (1 ≤ R, C ≤ 50). A enésima (i-th) das próximas R linhas contém uma string Bi de C caracteres que descreve a enésima (i-th) linha do tabuleiro inicial. O enésimo (j-th) caracter de Bi é ou `.' (ponto) ou a letra maiúscula 'X', representando que o ladrilho na linha i e coluna j é respectivamente branco ou preto. Dentro de cada caso de teste pelo menos um dos ladrilhos ou mosaicos é branco.","level":8,"name":"Jogo de Mosaicos","has_images":true,"description":"Jogo de mosaicos ou de ladrilhos é um jogo para dois jogadores, jogado sobre uma placa rectangular na forma de uma tabela de R linhas e C colunas de  células quadradas chamados mosaicos. No início do jogo, alguns dos quadrados podem ser pintados de preto e o restante permanece branco. Em seguida, o jogador 1 e jogador 2 alternam jogadas e o primeiro que não pode fazer um movimento válido perde o jogo. O primeiro movimento do jogo é feito por um jogador e consiste na escolha de um ladrilho branco  escrevendo o número do 1 nele. Depois disso, cada movimento subsequente i consiste em escrever o número i em um azulejo branco não utilizado que é adjacente horizontalmente ou verticalmente (mas não na diagonal)  ao ladrilho numerado i - 1. Note que o jogador 1 sempre escreve números ímpares e jogador 2 sempre escreve números pares.\n                    \n                    ​A figura a seguir mostra três exemplos possíveis de configurações de uma placa com R = 3 e C = 4, durante um jogo. À esquerda ela mostra a configuração inicial. No centro, mostra um estado intermediário, onde as células em cinza marca os movimentos possíveis para o jogador 2. E à direita mostra a configuração quando o jogo é ganho pelo jogador 2, que escolheu o movimento apropriado. \n\n                \n\n                \n                    Sua tarefa é escrever um programa que, dada a configuração inicial do tabuleiro, determina qual jogador irá ganhar, se ambos jogarem de maneira perfeita.","id":"1299","category":"Paradigmas","statistics":{"level":"8 / 10","submissions":111,"solved":55,"ratio":"49.55%"}}