{"output":"Para cada caso de teste imprima uma linha com uma string que representa o resultado de todos os comandos de produto do caso de teste. O caracte i da string representa o resultado do enésimo (i-th) comando de produto. Se o resultado do comando for positivo, o caractere deve ser '+' (mais), se o resultado for negativo, o caractere deve ser '-' (menos), se o resultado é zero, o caractere deve ser '0' (zero) .","input":"Cada caso de teste é descrito usando várias linhas. A primeira linha contém dois inteiros N e K respectivamente, indicando o número de elementos na seqüência e o número de rodadas do jogo (1 ≤ N, K ≤ 105). A segunda linha contém N inteiros Xi que representam os valores iniciais da sequência (-100 ≤ Xi ≤ 100 para i = 1, 2, ..., N). Cada uma das próximas K linhas descreve um comando e começa com uma letra maiúscula 'C' ou 'P'. Se a letra é 'C', a linha descreve um comando de mudança, e a letra é seguida por dois inteiros I e V,indicando que os XI devem receber o valor V (1 ≤ I ≤ N e -100 ≤ V ≤ 100). Se a letra for 'P', a linha de comando descreve um produto, e a letra é seguida por dois números inteiros I e J, indicando que o produto a partir de XI até XJ, inclusive deve ser calculado (1 ≤ I ≤ J ≤ N). Dentro de cada teste há pelo menos um comando de produto.","level":6,"name":"Produto do Intervalo","has_images":false,"description":"É normal sentir-se preocupado e tenso o dia antes de uma competição de programação. Para relaxar, você saiu para beber com alguns amigos em um pub. Para manter sua mente afiada para o dia seguinte, você decidiu jogar o seguinte jogo. Para começar, seus amigos vão dar-lhe uma seqüência de N inteiros X1, X2, ..., XN. Em seguida, haverá K rodadas; a cada rodada, seus amigos vão emitir um comando, que pode ser:\n\n                \n                    um comando de alteração, quando seus amigos querem mudar um dos valores na seqüência, ou\n                    um comando de produto, quando seus amigos lhe dar dois valores I, J e perguntar-lhe se o produto XI x XI+1 x ... x XJ-1 x XJ é positivo, negativo ou zero.\n                    ​\n                \n\n\n                \n                    Uma vez que você está em um pub, foi decidido que a pena para uma resposta errada é beber um copo de cerveja. Você está preocupado como isso poderia afetá-lo negativamente na competição do dia seguinte, e você não quer verificar se a teoria do pico de Ballmer é correta. Felizmente, seus amigos lhe deram o direito de usar o seu notebook. Uma vez que você confia mais nas suas habilidades de codificação do que na sua matemática, você decidiu escrever um programa que o ajudasse no jogo.","id":"1301","category":"Estruturas e Bibliotecas","statistics":{"level":"6 / 10","submissions":3673,"solved":1207,"ratio":"32.86%"}}