{"output":"Para cada caso de teste imprima Q linhas. Na enésima ( i-th ) linha escreva um inteiro com a resposta para a enésima (i-th) consulta. Se o casal correspondente pode se encontrar através de viagens aéreas, escreva o número mínimo total de vôos que o casal deve tomar para encontrar-se. Se for impossível para o casal encontrar-se por viagens aéreas, escreve o número \"-1\".","input":"Cada caso de teste é descrito usando várias linhas. A primeira linha contém um inteiroN representando o número de cidades ( 2 ≤ N ≤ 105). Cidades são identificadas por diferentes inteiros de 1 até N. A segunda linha contém N inteiros Fi, onde Fi indica que o vôo de saida registrado da cidade i é para a cidade Fi ( 1 ≤ Fi ≤ N, Fi = i for i = 1, 2,..., N). A terceira linha contém um inteiro Q representando o número de consultas ( 1 ≤ Q ≤ 105). Cada uma das próximas Q linhas descreve uma consulta com dois inteiros A e B indicando a cidade inicial do casal( 1 ≤ A, B ≤ N). Em cada caso de teste, se for possível viagar por via aérea da cidade X até a cidade Y, o número máximo de vôos necessários deverá ser 104.","level":7,"name":"Juntando Casais","has_images":false,"description":"Regulamentos de tráfego aéreo na Nlogônia exigem que cada cidade deve registrar exatamente um vôo de saída para outra cidade. Os passageiros podem usar esse vôo somente na direção registrada, ou seja, pode haver um vôo registrado da cidade X para a cidade Y e nenhum vôo registrado da cidade Y para a cidade X. Assim, o número de vôos registados é igual ao número de cidades. Esta regra, como se pode imaginar, torna as viagens aéreas um pouco complicadas, mas a tradição e uma decisão forte da Rainha torna qualquer alteração difícil. Além disso, algumas empresas até tem lucro por causa dos problemas causados ​​pela regra.\n                \n                    A Associação para a Correspondência de Casal (ACM) é a criação de um novo serviço para ajudar os clientes a encontrarem as suas  almas gêmeas: o Programa Internet para conexão de Casais (ICPC). O serviço consiste em calcular o número mínimo total de vôos que um casal precisa tomar para se encontrarem (talvez em uma cidade onde nenhum deles viva). Assumindo que as cidades de partida do casal são  A  e  B , a agência vai tentar encontrar uma cidade  C  tal que  C  é acessível por transporte aéreo de ambos  A  e  B , e a soma do número de voos necessários para ir de  A  para  C  e do número de voos necessárias para ir de  B  para  , C  é minimizado. Note que  C  pode ser igual a  A  ou B ou igual a ambos. Você terá a lista de todos os voos disponíveis e uma lista de consultas consistindo de pares de cidades onde os indivíduos de cada casal vivem. Para cada consulta, você deve calcular o número mínimo total de vôos que são necessárias para que eles se encontram.","id":"1302","category":"Grafos","statistics":{"level":"7 / 10","submissions":452,"solved":174,"ratio":"38.50%"}}