{"output":"Para cada linha de entrada, você de produzir uma linha de saída. Esta linha contém o número de série de saída, seguido por um inteiro D que indica o número mínimo de sufixos necessários para nomear as ruas. Se não é possível nomear todas as ruas, você deve imprimir “impossible” no lugar (sem as aspas).","input":"O arquivo de entrada pode conter até 10002 linhas de entrada. Cada linha contém dois inteiros R e N (R < 10001, 0 < N). Aqui R é o número total de ruas a serem nomeadas e N indica o número de inteiros alocados para a nomeação. A entrada termina com \"0 0\" que não deve ser processado.","level":3,"name":"Numerando Estradas","has_images":true,"description":"No meu país, as ruas não têm nomes, cada uma delas tem apenas um número como nome. Estes números devem ser únicos, mas nem sempre este é o caso. O governo local aloca alguns inteiros para citar as estradas e, em muitos casos, o número de inteiros alocados é menor do que o número total de estradas. Nesse caso, para que os nomes das estradas sejam único, alguns sufixos de caracteres únicos são utilizados. Assim, as estradas são nomeadas como 1, 2, 3, 1A, 2B, 3C etc. É claro que o número de sufixos também é sempre limitado a 26 (A, B, …, Z). Por exemplo, se existem 4 estradas e dois inteiros diferentes são alocados para nomear, então algumas declarações de nomes possíveis podem ser:\n\n                \n                    \n\n                        \n                            \n                                \n                                    1, 2, 1A, 2B\n                                \n                            \n                            \n                                \n                                    1, 2, 1A, 2C\n                                \n                            \n                            \n                                \n                                    3, 4, 3A, 4A\n                                \n                            \n                            \n                                \n                                    1, 2, 1B, 1C\n                                \n                            \n                        \n                    \n                \n                \n                    Dado o número de estradas (R) e os números de inteiros alocados para a nomeação (N), o seu trabalho é determinar o número mínimo de sufixos diferentes necessários (de todas as nomeações possíveis) para nomear as ruas, assumindo que não existam duas ruas com o mesmo nome.","id":"1306","category":"Matemática","statistics":{"level":"3 / 10","submissions":2611,"solved":1276,"ratio":"48.87%"}}