{"output":"Para cada jogo na entrada, seu programa deve imprimir uma linha na saída, descrevendo a menor área total dentro dos invólucros. A área deve ser impresa como um número real, com duas casas decimais de precisão, e o último dígito deve ser arrredondado. A entrada não conterá casos de teste onde as diferenças de arredondamento serão significantes.","input":"Seu programa deve resolver diversas instâncias do jogo. Cada descrição do jogo inicia com uma linha contendo dois inteiros B e N, indicando, respectivamente, o número de elásticos e o número de pregos ( 2 ≤ B ≤ 50 e 2B + 1 ≤ N ≤ 101 ). As seguintes N linhas descrevem a posição dos pregos, cada linha contendo dois inteiros X e Y ( -10000 ≤ X, Y, ≤ 10000 ). A origem é o primeiro prego na entrada. O final da entrada é indicado por B = N = 0.\n\n                \n                    Em todas as instâncias da entrada:\n\n                \n                    Não há dois pregos no mesmo ponto;\n                    Não há três pregos na mesma linha;\n                    O prego de origem não pertence ao fecho convexo de todos os pregos (isto é, se você usa um elástico para envolver todos os pregos, ele não toca o prego de origem);","level":9,"name":"Não tão Convexo","has_images":true,"description":"Pregos e Elásticos. Este é um nome sugestivo de um jogo que é disputado por um grupo de crianças (todas elas, filhas de professores de geometria). As crianças determinam um número de pregos em um plano de madeira, colocados aleatoriamente. Então, elas escolhem um dos pregos para ser a origem, e um número B de elásticos. O desafio é usar todos B elásticos para envolver os pregos, de modo que: (i) cada elástico envolve um subconjunto de pregos; (ii) todos os pregos estão dentro de um invólucro; (iii) invólucros não sobrepõe uns aos outros, exceto o prego de origem, que é tocado por todos os elásticos; (iv) os elásticos devem formar invólucros que são polígonos convexos, com no mínimo três cantos; e (v) a área total dentro de um invólucro é a maior de todas as formas possíveis de envolver os pregos. Uma instância do jogo é mostrada na Figura 1.\n\n                \n\n                Figura 1: Um jogo com 19 pregos e 2 elásticos.","id":"1315","category":"Geometria Computacional","statistics":{"level":"9 / 10","submissions":164,"solved":58,"ratio":"35.37%"}}