{"output":"Para cada caso de teste o programa deverá produzir uma linha de saída. Se for possível distribuir os chocolates como foi relatado na declaração do problema, imprima o número de caixas a ser preenchido com chocolate Mindt, seguido de espaço, seguido pela lista do número de caixas, em ordem ascendente. Cada número de caixa na lista deve ser seguido de espaço. Se for impossível distribuir os chocolates, imprima \"Impossible to distribute\". Se existem mais que uma solução, imprima qualquer uma. ","input":"O arquivo de entrada contém vários casos de teste. Cada caso consiste em três linhas. A primeira linha contém dois inteiros M e L que indicam respectivamente o número de chocolates Mindt e Lilka que Pedro comprou, sendo (0 ≤ M, L ≤ 1000). A próxima linha contém um inteiro N representando o número de caixinhas que Pedro tem, sendo (N ≤ M + L). A terceira linha contém N inteiros indicando a capacidade Ci (Ci ≥ 0), onde Ci é o número de chocolates necessário para encher a caixa i. O final da entrada é indicado por M = L = 0.","level":8,"name":"Compra Livre de Impostos","has_images":false,"description":"Pedro viajou para a Europa para participar da Olimpíada Internacional de Informática e está voltando para casa. Já que todos os seus amigos pediram para que ele trouxesse alguns presentes, ele comprou dois grandes pacotes de chocolate (um do Mindt e um do Lilka). Cada um desses pacotes contém em certo número de pequenos chocolates. Comprar os dois grandes pacotes foi bem menos caro que comprar as caixas individuais dos mesmos. Em casa, Pedro tinha algumas caixas que guardou de outras viagens. Pedro pretende distribuir os chocolates que recém comprou nessas caixas, para dá-las a seus amigos.\n                \n                    Assim que Pedro começou a encher as caixas, ele percebeu um grande problema: já que ele tem dois tipos de chocolates, se ele misturar chocolates de diferentes tipos nas caixas, o amigo que receber a caixa perceberá o truque de Pedro para economizar dinheiro, e ficará magoado com ele.\n                \n                    Você deve ajudar o pobre Pedro a distribuir os chocolates nas caixas de maneira a que cada caixa esteja cheia e com apenas um tipo de chocolate. Um certo número de pedaços podem acabar sobrando (Pedro ficará com eles se for o caso).","id":"1316","category":"Matemática","statistics":{"level":"8 / 10","submissions":209,"solved":70,"ratio":"33.49%"}}