{"output":"Para cada caso de teste na entrada seu programa deve produzir uma linha na saída, contendo os nomes das quatro regiões vizinhas da região informada, na seguinte ordem de direção: cima, baixo, esquerda, direita. Para os vizinhos que não estão mapeados, você deve escrever na saída <none> ao invés do nome. Deixe um espaço em branco entre dois nomes consecutivos.\n\n                \n                    A saída deve ser escrita na saída padrão.","input":"A entrada contém diversos casos de teste. A primeira linha contém um inteiro N indicando o número de casos de teste. Cada uma das N linhas representam um caso de teste, contendo o nome da região composta por C caracteres ( 2 ≤ C ≤ 5000 ), sendo que o primeiro sempre será o caractere 'm', e os seguintes serão ou 'p', 'q', 'r' ou 's'.\n\n                \n                    A entrada deve ser lida da entrada padrão.","level":4,"name":"Mapas Bolha","has_images":true,"description":"A Bubble Inc. está desenvolvendo uma nova tecnologia para a navegação em um mapa em diferentes níveis de zoom. Sua nova tecnologia assume que a região a ser mapeada é uma superfície retangular plana, e que divide sua superfície em sub-regiões retangulares, as quais representam níveis de zoom mais profundos. A tecnologia da Bubble Inc. representa um mapa usando uma estrutura conhecida como quad-tree. Em uma quad-tree, uma região retangular chamada x pode ser dividida pela metade, tanto horizontal como verticalmente, resultando em 4 sub-regiões retangulares de tamanhos iguais. Estas sub-regiões são chamadas de regiões filhas de x, e são nomeadas de xp para o canto superior esquerdo, xq para o superior direito, xr para o inferior direito e xs para o inferior esquerdo, onde xc representa a concatenação da string x e o caracter c = 'p', 'q', 'r' e 's'. Por exemplo, se a região base a ser mapeada é chamada de m, então as regiões filhas de m são, à partir do canto superior esquerdo e em sentido horário: mp, mq, mr e ms, como ilustrado abaixo.\n\n                \n\n                \n                    Qualquer região pode ser subdividida. Por exemplo, a região chamada ms pode ser subdividida em sub-regiões msp, msq, msr e mss, como ilustrado abaixo.\n\n                \n\n                \n                    Como outro exemplo, a figura abaixo mostra o resultado da subdivisão das sub-regiões filhas da região chamada msr.\n\n                \n\n                \n                    Sub-regiões com nomes de mesmo comprimento tem o mesmo nível de zoom, uma vez que eles representam regiões de mesmo tamanho. Sub-regiões no mesmo nível de zoom e que compartilham um lado comum são considerados vizinhos.\n\n                \n                    Qualquer coisa que esteja fora da região base m não está mapeada e, para todo nível de zoom, todas as sub-regiões de m são mapeadas.\n\n                \n                    A tecnologia de mapa da Bubble Inc. fornece um meio para o usuário navegar a partir de uma sub-região dada até as sub-regiões vizinhas, nas quatro direções: cima, baixo, esquerda e direita. Sua missão é ajudar a Bubble Inc. na procura pelas sub-regiões vizinhas de uma sub-região dada. Isto é, dado o nome de uma sub-região retangular, você deve determinar os nomes de suas quatro sub-regiões vizinhas.","id":"1325","category":"Paradigmas","statistics":{"level":"4 / 10","submissions":172,"solved":95,"ratio":"55.23%"}}