{"output":"Para cada caso de teste da entrada, seu programa deve produzir uma linha, contendo a string 'PRODUCT requires N containers', onde o PRODUCT é a substância final e N é o número de recipientes necessários para produzi-lo.","input":"A entrada consiste de vários casos de teste. Cada caso de teste começa com uma linha contento um inteiro R, indicando o número de reações para serem consideradas(1 <= R <= 5000). A seguir R linhas são da forma:\n                \n                    S1 + S2 → S3\n                \n                    Descreve uma reação que consome S1 e S2 e produz S3 como resultado. Os nomes de todas as substâncias são cadeias-alfanumericas de tamanho no máximo 5. Um caso de teste com R = 0 indica o final da entrada.","level":7,"name":"Química","has_images":false,"description":"Internacional Chemical Products Company (ICPC) é uma empresa conhecida mundialmente pelos seus bons produtos e acessíveis, o que inclui shampoos, produtos de limpeza, matadores de insetos, e alguns tipos de vacinas. Os engenheiros da ICPC sempre estão procurando meios de reduzir o custo de fabricação de seus produtos, sem perder a qualidade.\n                \n                    Um dos engenheiros, Sr. Poucher, tem uma nova ideia de reduzir o custo, que visa reduzir o número de recipientes necessários para manter as substâncias durante a sequência de reações químicas para se obter uma última substância. Essas substâncias finais são obtidas através de uma sequência de reações na forma de X + Y → Z, onde X e Y são substâncias iniciais ou intermediarias (que já foram geradas em reações anteriores). Essas reações são feitas dentro de um recipiente de reações, que quando vazio pode ser limpo e usado novamente. O processo de gerar a substância final pode ser descrevido por uma sequência de duas simples operações:\n                \n                    Colocar uma substância disponível em um recipiente de reação vazio C;\n                    Realizar a reação de X + Y → Z ou colocando X no recipiente de reação contendo Y, ou colocando Y no recipiente de reação contendo X. A ordem não afeta o resultado final da reação.\n                \n                \n                    O que Sr. Poucher percebeu é que escolhendo a sequência de reação correta, ICPC poderia cortar o número de reações necessárias na companhia drasticamente . Por exemplo, considerando a seguinte sequência de reações químicas usadas para obter a substância final P:\n                \n                    1) A + B -> T1\n                    2) C + D -> T2\n                    3) E + F -> T3\n                    4) T2 + T3 -> T4\n                    5) T4 + T1 -> P\n                \n                    Nesse exemplo, A, B, C, D, E e F são as substância iniciais (somente aparecem no lado esquerdo das reações), T1, T2, T3 e T4 são substâncias intermediarias (aparecem no lado esquerdo pelo menos uma vez, e exatamente uma na direita de alguma outra reação) e P é a substância final (só aparece na direita de uma única reação, que vai ser a última listada). Se a sequência de reações é realizada como foi dito então três recipientes são necessários em ordem para produzir a substância final P:\n                \n                    Recipientes\n                    Operações C1 C2 C3\n                \n                    colocar A em C1: A - -\n                    adicionar B para C1: T1 - -\n                    colocar C em C2: T1 C -\n                    adicionar D para C2: T1 T2 -\n                    colocar E em C3: T1 T2 E\n                    adicionar F para C3: T1 T2 T3\n                    colocar T2 em C3: T1 - T4\n                    colocar T4 em C1: P - -\n                \n                    Nota-se, contudo, que se as reações são realizadas na sequência 2, 3, 4, 1, 5, dois recipientes são suficientes:\n                \n                    Recipientes\n                    Operações C1 C2\n                \n                    colocar C em C1: C\n                    adicionar D para C1: T2\n                    colocar E em C2: T2 E\n                    adicionar F para C2: T2 T3\n                    colocar T2 em C2: - T4\n                    colocar A em C1: A T4\n                    adicionar B para C1: T1 T4\n                    colocar T1 em C2: - P\n                \n                    Você foi contratado pela ICPC, e sua tarefa é criar um programa de computador que determine o número minimo de recipientes necessárias para executar a sequência de reações necessárias para obter a substância final.\n                \n                    Você deve assumir que:\n                \n                    A reação de produção da substância final é a última listada, e a reação que produz uma substância intermediária sempre vai preceder as reações onde essa substância intermediária é usada.\n                    Uma sequência de reações que produzem a última substância é sempre possível.\n                    ICPC tem um suprimento ilimitado de substâncias iniciais.\n                    No início do processo de produção, cada substância inicial está em um recipiente de armazenamento, usado para guardar todo estoque de substâncias da ICPC. Tais recipientes não podem ser utilizados como recipiente de reação para armazenar produtos intermediários da reação.\n                    Todos os recipientes de reação são grandes o suficiente para manter todas as substâncias resultantes.\n                    A quantidade de substâncias geradas por uma única reação é suficiente para ser usada como entrada para uma única outra reação. Por exemplo, se um produto intermediário Z é necessário como entrada para duas diferentes reações, este produto deve ser produzido duas vezes.\n                    Cada reação usa exatamente duas substâncias diferentes e gera também uma substância distinta, isto é, toda reação tem a forma X + Y → Z, onde X, Y e Z são distintos.","id":"1326","category":"Estruturas e Bibliotecas","statistics":{"level":"7 / 10","submissions":79,"solved":23,"ratio":"29.11%"}}