{"output":"Para cada caso de teste seu programa deve imprimir uma linha, contendo um inteiro representando o valor a ser deduzido do cartão GoEasy do viajante.","input":"A entrada contém vários casos de teste. A primeira linha de um caso de teste contém dois inteiros Z e S, que indicam, respectivamente, o número de zonas (1 ≤ Z ≤ 30) e o número de estações de trem/ônibus na cidade (1 ≤ S ≤ 100). Cada estação tem um único número de identificação variando de 1 a S, e cada estação pertence exatamente a uma zona. Cada uma das seguintes Z linhas descreve as centrais pertencentes a uma zona. A descrição de uma zona começa com um K inteiro que indica o número de estações (1 ≤ K ≤ S) na zona, seguido de K inteiros representando as estações na zona. Depois disso vem uma linha com dois números inteiros T e B, representando, respectivamente, o número de itinerários de trem (1 ≤ T ≤ 50) e o número de itinerários de ônibus (1 ≤ B ≤ 50). Em seguida, vem T linhas descrevendo itinerários de trem, seguido por B linhas descrevendo itinerários de ônibus. A descrição de cada itinerário é composto de uma linha contendo L um inteiro que indica o número de estações (2 ≤ L ≤ S) no itinerário, seguido por L inteiros especificando a seqüência de estações no itinerário. Finalmente, vem uma linha com dois inteiros X e Y (1 ≤ X ≤ S, 1 ≤ Y ≤ S e X ≠ Y), especificando que o cliente viajou da estação X para a estaçãoY. O final da entrada é indicado por Z = S = 0.","level":7,"name":"Vá com Calma","has_images":true,"description":"O prefeito de uma cidade pretende introduzir um novo sistema de transporte para simplificar a vida de seus habitantes. Isso será feito através da utilização de um cartão de débito, que o prefeito nomeou \"GoEasy\". Há dois meios de transporte na cidade: trens e ônibus. O sistema de trem é \"baseado em zonas\", enquanto o sistema de ônibus é \"baseado em jornadas\". A tarifa para a viagem é calculada como segue:\n\n                \n                    Primeiramente há uma taxa de duas unidades monetárias para entrar no sistema de transporte, independentemente do meio inicial de transporte.\n                    Quando viajar de trem um cliente paga quatro unidades monetárias para cada mudança de zona.\n                    Ao viajar de ônibus a cliente paga uma unidade monetária a cada vez que ele/ela embarca num ônibus.\n                \n\n                \n                    Um mapa do sistema de transporte irá proporcionar informações sobre as estações pertencentes a cada zona, e a seqüência de estações para cada itinerário de ônibus e trem. Ônibus e trens se movem em ambas as direções em cada itinerário, e nenhum trem ou ônibus passa pela mesma estação duas vezes durante uma única viagem através de um itinerário. É sempre possível ir de qualquer estação a qualquer outra estação usando trens e/ou ônibus. As regras para as tarifas de computação são rígidas: se durante uma viagem de trem um cliente entra em uma determinada zona duas vezes, ele/ela é cobrado(a) duas vezes, da mesma forma, se durante uma viagem de ônibus o cliente utiliza duas vezes o ônibus para o mesmo itinerário, ele/ela é cobrado(a) duas vezes.\n\n                ​\n\n                \n                    No mapa do transporte acima um cliente pode viajar da estação 2 para a estação 4 pagando apenas duas unidades monetárias, usando a linha T1, uma vez que elas estão na mesma zona. Mas se o cliente precisa ir da estação 2 à 5, então o melhor é tomar o ônibus B3 para a estação 10 e, em seguida, tomar o ônibus B2 para a estação 5, pagando um total de quatro unidades monetárias. Ao invés de rastrear toda a viagem de cada passageiro, a idéia do prefeito é que máquinas sejam colocadas em todas as estações, e os viajantes devem passar seu cartão pessoal GoEasy apenas no começo e término de toda a viagem. Uma vez que todas as máquinas são interligadas em rede, com base na saída e entrada do sistema de estações, pode-se calcular o custo mínimo possível para a viagem, e qual o valor será cobrado do cartão de débito do viajante. Tudo o que falta é um sistema de computador para fazer os cálculos para a tarifa a ser deduzida. Assim, dado o mapa do sistema de transporte na cidade, você deve escrever um programa para calcular a tarifa mínima que o cliente deve pagar para viajar entre duas paradas/estações dadas.","id":"1328","category":"Grafos","statistics":{"level":"7 / 10","submissions":86,"solved":46,"ratio":"53.49%"}}