{"output":"Para cado caso de teste imprima um linha com um inteiro representando o número de diferentes bons empacotamentos de doces, de acordo com as regras dadas acima.","input":"Cada caso de teste é descrito usando duas linhas. A primeira linha contém um inteiro F indicando o número de sabores (2 ≤ F ≤ 105). A segunda linha contém F inteiros Ci , indicando o número de doces de cada sabor (1 ≤ Ci ≤ 109 para cada 1 ≤ i ≤ F).\n\n                \n                    O último caso de teste é seguido por uma linha contendo um zero.","level":6,"name":"Os Doces de Candy","has_images":false,"description":"Candy possui um estoque de doces de F diferentes sabores. Ela irá fazer vários pacotes de doces para então vendê-los. Cada pacote deverá ser ou um pacote contendo doces de um único sabor, ou um pacote sortido, contendo doces de cada sabor. Ela decidiu que um bom empacotamento deve honrar as seguintes condições:\n\n                \n                    Cada doce deve ser colocado em exatamente um pacote.\n                    Cada pacote, independente de seu tipo, deve conter pelo menos dois doces.\n                    Cada pacote, independente de seu tipo, deve conter o mesmo número de doces.\n                    Dentro de cada pacote sortido, o número de doces de cada sabor deve ser o mesmo.\n                    Deve haver ao menos um pacote sortido.\n                    Deve haver ao menos um pacote de cada sabor.\n                \n\n                \n                    Candy estava pensando sobre quantos tipos de bons empacotamentos de doces ela poderia fazer. Dois bons empacotamentos de doces são considerados diferentes se e somente se eles diferem no número de pacotes sortidos, ou no número de doces por pacote. Como Candy irá vender seus doces durante a cerimônia de encerramento desta competição, você foi encorajado a responder sua questão tão rápido quanto possível.","id":"1333","category":"Ad-Hoc","statistics":{"level":"6 / 10","submissions":53,"solved":31,"ratio":"58.49%"}}