{"output":"Para cada caso de teste imprima uma única linha. Se existe um set ou um par que derrota a mão dada, escreva a menor mão que o faz. A mão vencedora deve ser escrita especificando as categorias de suas cartas, em ordem não-descrescente. Se nenhum set ou par derrota a mão dada, escreva o caractere '*' (asterisco).","input":"Cada caso de teste é descrito usando uma única linha. A linha contém três inteiros A, B e C representando as categorias das cartas entregues na mão (1 ≤ A, B, C ≤ 13).\n\n                \n                    O último caso de teste é seguido por uma linha contendo três zeros.","level":4,"name":"Poker do Rei","has_images":false,"description":"Poker é um dos jogos de cartas mais jogados, e o Poker do Rei é uma das suas variações. O jogo é jogado com um baralho normal de 52 cartas. Cada carta tem um dos quatro naipes e uma das 13 categorias. Entretanto, no Poker do Rei os naipes das cartas não são relevantes, enquanto as categorias são Ás (categoria 1), 2, 3, 4, 5, 6, 7, 8, 9, 10, Valete (categoria 11), Rainha (categoria 12) e Rei (categoria 13). O nome do jogo vem do fato de que no Poker do Rei, o Rei é a carta com a categoria mais alta. Mas esta não é a única diferença entre o Poker regular e o Poker do Rei. Aos jogadores do Poker do Rei são distribuídos uma mão de apenas três cartas. Existem três tipos de mãos:\n\n                \n                    Um set, feito de três cartas da mesma categoria.\n                    Um par, que contém duas cartas da mesma categoria, com a outra carta sem correspondente.\n                    Um não-par, onde não tem-se duas cartas da mesma categoria.\n                \n\n                \n                    As mão são classificadas usando as seguintes regras:\n\n                \n                    Qualquer set derrota qualquer par e não-par.\n                    Qualquer par derrota qualquer não-par.\n                    Um set formado com cartas de categoria maior derrota qualquer set formado com cartas de categoria menor.\n                    Se as cartas emparelhadas de dois pares têm categorias diferentes, então o par com as cartas emparelhadas de maior categoria derrota o par com as cartas emparelhadas de menor categoria.\n                    Se as cartas emparelhadas de dois pares têm a mesma categoria, então a cartas não emparelhadas de ambos os pares são comparadas; o par com carta não emparelhada de maior categoria derrota o par com carta não emparelhada de menor categoria, a menos que ambas as cartas não emparelhadas sejam da mesma categoria, caso no qual temos um empate.\n                \n\n                \n                    Uma nova empresa de software quer oferecer jogos de Poker do Rei no seu site de jogos, e precisa de um software que, dada uma mão de Poker do Rei, determine o set ou o par com menor categoria que derrota a mão dada. Você pode codificá-lo?","id":"1337","category":"Ad-Hoc","statistics":{"level":"4 / 10","submissions":850,"solved":468,"ratio":"55.06%"}}