{"output":"Para cada caso de teste seu programa deverá imprimir uma linha. Se seu avô estiver correto, imprima “Yes grandpa!”, caso contrário imprima “No, you are wrong!”.","input":"A entrada contém diversos casos de teste. A primeira linha da entrada é um inteiro que indica o número de testes. Cada descrição do teste contém dez linhas de entrada. As primeiras nove linhas do teste irão descrever a configuração inicial, no formato mostrado na Figura 3a. A próxima linha irá conter uma lista de rotações, terminando com o valor 0.","level":6,"name":"O Cubo Mágico do Avô","has_images":true,"description":"O famoso brinquedo/passatempo, chamado Cubo Mágico, consiste em um cubo como mostrado na Figura 1a, onde letras representam cores (e.g. B para azul, R para vermelho). O objetivo do jogo é rotacionar as faces do cubo de modo que no final cada face do cubo contenha uma cor diferente, como mostrado na Figura 1b. Note que,\n\n                \n\n                  (a) Embaralhado                               (b) Posição vencedora\n\n                Figura 1: Cubo Mágico\n\n                \n                    quando uma face é rotacionada, as configurações das cores em todas as faces adjacentes trocam. Figura 2a ilustra a rotação de uma das faces. Dada uma configuração embaralhada, chegar até a posição final pode ser bem desafiador, como você já deve saber.\n\n                \n\n                Figura 2: Exemplo de rotação\n\n                \n                    Mas seu avô tem muitos anos de experiência, e diz que, dada qualquer configuração do Cubo Mágico, ele consegue apresentar uma sequência de rotações que levam a uma configuração vencedora.\n\n                \n                    Para que todas as faces do cubo estejam visíveis, nós iremos representar o cubo como mostrado na Figura 3a. As seis cores são Amarelo, Vermelho, Azul, Verde, Branco e Magenta, representadas pelas respectivas letras, Y, R, B, G, W e M.\n\n                \n                    Você receberá uma configuração inicial e uma lista de rotações. Uma rotação será representada por um valor inteiro, indicando a face que será rotacionada e a direção da rotação (um valor positivo significa rotação no sentido horário, um valor negativo significa rotação no sentido anti-horário). As faces do cubo são numeradas como mostrado na Figura 3b. Você deverá escrever um programa que checa se a lista de rotações irá levar a uma configuração vencedora.\n\n                \n\n                        (a) Cores                                                    (b) Identificadores de face para rotação\n\n                Figura 3: Representação do cubo","id":"1339","category":"Ad-Hoc","statistics":{"level":"6 / 10","submissions":153,"solved":69,"ratio":"45.10%"}}