{"output":"Para cada instancia do problema da entrada, seu programa deve imprimir uma única linha, contendo a resposta para o problema. Se houver uma sequencia de movimentos para o cavalo que capture todos os peões (e sem que o cavalo seja capturado por um peão), o programa deve imprimir o comprimento da menor sequencia de movimentos possível. Caso contrário, seu programa deve imprimir a palavra 'impossivel'.","input":"A entrada contém várias instâncias do problema, uma por linha. Cada exemplo começa com um inteiro P que representa o número de peões (0 ≤ P ≤ 8), seguido por P inteiros (1 ≤ A1, A2, ..., Ap ≤ 64) que descrevem a posição inicial de cada peão seguido de um inteiro H (1 ≤ H ≤ 64) que representa a posição inicial do cavalo. O fim da entrada é indicado quando P = 0.","level":6,"name":"Runner Pawns","has_images":true,"description":"O jogo \"Runner Pawns\" é uma variante do clássico Xadrez que é jogado por apenas uma pessoa. O tabuleiro usado nesse jogo é semelhante ao tabuleiro do Xadrez, dividido em 8x8 quadrados. Como no Xadrez, cada quadrado pode conter apenas uma peça por vez. As peças do jogo são uma série de peões (os \"Runner Pawns\"), e um único cavalo, que é a única peça que o jogador comanda. O objetivo é capturar todos os peões antes de chegarem a ultima linha e se tornarem reis.\n\n                \n\n                \n                    Possíveis movimentos do cavalo\n\n                \n                    Os movimentos do cavalo são ditos em forma de 'L', uma vez que o cavalo sempre anda dois quadrados em uma direção e mais um quadrado perpendicular a essa direção. A figura acima ilustra os movimentos do cavalo, onde o caractere 'H' indica a posição atual do cavalo e o caractere '•' indica um possível movimento do cavalo. Nota-se que a representação usando quadrados pretos e brancos do tabuleiro de Xadrez não é distinguida.\n\n                \n                             01 02 03 04 05 06 07 08\n                             09 10 11 12 13 14 15 16\n                             17 18 19 20 21 22 23 24\n                             25 26 27 28 29 30 31 32                   Da posição 22, o cavalo pode se mover para as posições 05,\n                             33 34 35 36 37 38 39 40                   07, 12, 16, 28, 32, 37 ou 39. Da posição 57, o cavalo pode se\n                             41 42 43 44 45 46 47 48                   mover para as posições 42 ou 51.\n                             49 50 51 52 53 54 55 56\n                             57 58 59 60 61 62 63 64\n\n                \n                    O tabuleiro com as células numeradas\n\n                \n                    Os movimentos dos peões são um pouco diferentes do Xadrez, uma vez que o peão só pode se mover um quadrado para frente e todos os outros peões se movem ao mesmo tempo. Eles nunca se movem em diagonal. As casas do tabuleiro são numeradas de 1 a 64, como mostrado acima. Os peões se movem na direção vertical de cima para baixo, de modo que os quadrados numerados 57-64 são os objetivos dos peões.\n\n                \n                    Cada rodada do jogo é composta por um movimento do cavalo seguido por um movimento simultâneo de todos os peões ainda não capturados.\n\n                \n                    A fim de capturar um peão, o jogador deve mover o cavalo para o quadrado onde está o peão. O peão capturado deixa o tabuleiro e somente os peões restantes avançam para a próxima rodada. Para vencer o jogo, o jogador deve capturar todos os peões. Se um peão conseguir chegar a última linha, torna-se um rei. Com isso o cavalo tem apenas mais um movimento para captura-lo. Se isso não acontecer, o rei se move e isso significa que o jogo acaba e o jogador perde. Além disso, se o cavalo se mover para um quadrado que vai ser ocupado por um peão, no próximo movimento dos peões o cavalo é capturado pelo peão e o jogador perde.\n\n                \n                    Sua tarefa é escrever um programa que analise um tabuleiro de \"Runner Pawns\" e responda se existe uma sequencia de movimentos para o cavalo vencer. Se for possível, o programa deve determinar o número mínimo de movimentos necessários para o cavalo capturar todos os peões.","id":"1343","category":"Ad-Hoc","statistics":{"level":"6 / 10","submissions":126,"solved":64,"ratio":"50.79%"}}