{"output":"Para cada campo minado de sua entrada seu programa deverá escrever uma linha com dois inteiros A e B, onde A ≤ B, descrevendo o tamanho da posição mais segura.","input":"Seu programa deverá processar dados de diversos casos de teste. A primeira linha de um campo minado contém quatro inteiros X1, Y1, X2 e Y2 os quais são os limites do campo. (X1, Y1) são as coordenadas do canto inferior esquerdo do campo, (X2, Y2) são as coordenadas do canto superior direito do campo (-20000 ≤ X1 < X2 ≤ 20000 e -20000 ≤ Y1 < Y2 ≤ 20000). A segunda linha contém um único inteiro N indicando o número de minas detectadas no campo (1 ≤ N ≤ 300). As seguintes N linhas contém dois inteiros X e Y cada, descrevendo a posição da uma mina (X1 ≤ X ≤ X2 e Y1 ≤ Y ≤ Y2). Duas minas não compartilham a mesma posição. O final da entrada é indicado quando X1 = Y1 = X2 = Y2 = 0.","level":9,"name":"Região Segura","has_images":false,"description":"Você foi contratado pela Minas Nunca Mais, uma organização não-governamental que tem como objetivo o banimento do uso de minas terrestres. Além de trabalhar no aspecto político, tal como convencer governantes a entrar na Campanha Internacional de Banimento das Minas Terrestres, MNM também trabalha desarmando minas deixadas por guerras passadas.\n\n                \n                    Hoje em dia, minas são detectadas por satélites ou aviões de vigilância. Mas para desarmar uma mina você precisa chegar próximo a ela. Na maioria dos casos, a única maneira de se aproximar de um campo minado é de helicóptero. Para limpar o campo, você precisa encontrar a região mais segura dentro do campo para que o helicóptero possa pousar nela. Esta região é um retângulo com lados paralelos aos eixos das coordenadas, sem nenhuma mina dentro e sendo o menor lado o maior possível. Mais precisamente, seja A e B o comprimento dos lados de todos os possíveis retângulos com não contém nenhuma mina e A <= B; a região mais segura é um retângulo com o maior valor de A e o maior valor de B. Isto é, entre todos os retângulos que não contém nenhuma mina e nos quais o menor lado é o A (maior possível), a região mais segura é o retângulo que contém o maior B.\n\n                \n                    Dado o limite do retângulo de um campo minado e as posições de todas as minas dentro deste, você deverá escrever um programa para encontrar o tamanho da região mais segura.","id":"1345","category":"Geometria Computacional","statistics":{"level":"9 / 10","submissions":72,"solved":26,"ratio":"36.11%"}}