{"output":"Para cada caso de teste da entrada, seu programa deverá imprimir uma única linha, contendo um número inteiro representando a distância que você precisa para andar para sair da mina. Claro, você não deve considerar as distâncias que você se teletransportou. A distância deve ser arredondado para o número inteiro mais próximo.","input":"A entrada é constituída por vários casos de teste. A primeira linha de um caso de teste contém três inteiros N, M e L, que indicam, respectivamente, o número de vezes que os teletransportes podem ser usados, o número de paredes da mina e o número de cabines do teletransporte (0 ≤ N, M, L ≤ 50). Cada uma das linhas seguintes contém M quatro inteiros X1, Y1, X2 e Y2, que representam as coordenadas dos pontos de extremidade de uma parede. Você pode ignorar a espessura das paredes e assumir que eles não se cruzam entre si (-20.000 ≤ X1 < X2 ≤ 20.000 e -20000 ≤ Y1 ≤ Y2 20.000). As próximas L linhas contêm a localização dos estandes de teletransporte, dada por dois inteiros Xp e Yp. A última linha de cada caso de teste contém quatro inteiros Xb, Yb, Xe e Ye onde (Xb, Yb) são as coordenadas da sua localização e (Xe, Ye) são as coordenadas para sair da mina. O fim da entrada é indicado por M = N = L = 0.","level":10,"name":"Mina Kriptonita","has_images":true,"description":"No ano de 2222, um terrível desastre aconteceu na mina de kryptonita em Marte: um marsquake sacudiu parte do planeta. Diferentemente de terremotos na Terra, marsquakes não são incomuns em Marte. Este, no entanto, gerou uma mina que começou a afundar-se lentamente para o solo. A mina tem uma forma externa retangular, e seu interior é como um labirinto, com elevações, paredes retas e, mais o importante, teletransportes. Teletransporte, como você sabe, pode transportar pessoas instantaneamente de um lugar para outro. O teletransporte da mina são dos modelos antigos, usando a tecnologia antiga, e só pode teleportar pessoas se houver uma clara visão a partir de uma outra cabine de teletransporte (isto é, se não existem obstáculos ou paredes entre as cabines). Você pode ver o mapa da mina na figura abaixo.\n\n                ​​\n\n                \n                    Você está preso sozinho dentro da mina. Felizmente, você tem um mapa de toda a minha, conhece a sua posição atual, a posição das paredes, os locais de saída e todas as cabinas de teletransporte. Infelizmente, o marsquake afetou o sistema de energia, e você sabe que o teletransporte só pode ser usado por um período e número limitado de vezes.\n\n                \n                    Você quer sair andando o mínimo possível, já que torceu o tornozelo durante o marsquake. Você deve encontrar o caminho do seu local atual para a saída que exige a mínima quantidade de caminhada.","id":"1347","category":"Matemática","statistics":{"level":"10 / 10","submissions":69,"solved":26,"ratio":"37.68%"}}