{"output":"Para cada caso de teste seu programa deve imprimir uma linha, contendo ou a palavra 'yes' (se é possível satisfazer a todos os clientes que votaram) ou a palavra 'no' (se não é possível).","input":"Seu programa deverá processar diversos casos de teste. A primeira linha de um caso de teste contém dois inteiros C e P, representando respectivamente o número de clientes e o número de produtos no teste (1 ≤ C ≤ 1000 e 1 ≤ P ≤ 10000). Cada uma das próximas C linhas descreve a preferência de um cliente, representada por quatro inteiros X, Y, S e T (0 ≤ X, Y, S, T ≤ P). X e Y são os produtos que o cliente quer que o supermercado continue vendendo, S e T são os produtos que o cliente quer que o supermercado pare de vender. Um valor 0 (zero) para qualquer uma das variáveis X, Y, S e T significa que o cliente não está fazendo uso daquele voto. Uma linha com C = P = 0 indica o fim da entrada.","level":7,"name":"X-Mart","has_images":false,"description":"A bem conhecida rede de supermercados X-Mart decidiu cortar custos, reduzindo o número de diferentes produtos disponíveis nas prateleiras de suas lojas. O departamento de marketing ficou preocupado se esta decisão afetaria as vendas, e decidiu explorar a redução dos produtos para promover a relação com clientes.\n\n                \n                    Para tal, a rede de supermercados X-Mart organizou uma votação na Internet, na qual os clientes poderiam escolher quais produtos eles gostariam que permanecessem nas prateleiras, e quais produtos eles gostariam que fossem retirados destas. A lista dos produtos disponíveis atualmente foi publicada na Internet.\n\n                \n                    Para simplificar o sistema de votação, foi permitido a cada consumidor escolher no máximo dois produtos para votar a favor (significando que o supermercado deveria continuar a vender estes) e no máximo dois produtos para votar contra (significando que o supermercado deveria parar de vender estes).\n\n                \n                    Sendo que o departamento de marketing possui todos os votos em sua base de dados, este quer saber se é possível escolher uma nova lista de produtos que satisfaça TODOS os clientes que votaram. O departamento de marketing considera que um cliente estará satisfeito se pelo menos um dos produtos que ele/ela votou a favor continua sendo vendido, e se pelo menos um dos produtos que ele/ela votou contra foi removido das prateleiras dos supermercados. Você pode considerar que um cliente não vota a favor e contra um mesmo produto.","id":"1348","category":"Grafos","statistics":{"level":"7 / 10","submissions":240,"solved":116,"ratio":"48.33%"}}