{"output":"Para cada sessão de compra da entrada, seu programa deve produzir uma linha de saída,  contendo o menor custo que Sr. Jones pode conseguir. Se não é possível comprar todos os itens da sessão, imprima “Impossible”. O custo deve ser impresso como um número real com precisão de duas casas decimais, e o último dígito decimal deve ser arredondado. A entrada não vai conter casos de teste onde diferenças de arredondamento são significantes.","input":"Seu programa deverá processar dados para diversos casos de teste (sessões de compra). A primeira linha na descrição de uma sessão de compra contém dois inteiros M e N; M indica o número de itens na lista da Sra. Jones (1 ≤ M ≤ 100) e N representa o número total de produtos disponíveis no supermercado (1 ≤ N ≤ 100,000). \n\t\t\t\t\n\t\t\t\tA próxima linha contém M inteiros Xi, representando a lista de produtos da lista da Sra. Jones (1 < Xi ≤ 100000, 1 ≤ i ≤ M). Seguem N linhas, representando os produtos do supermercado na ordem em que eles aparecem no caminho do Sr. Jones. Cada uma destas linhas contém um inteiro K e um número real P, que representam, respectivamente, um identificador de produto e seu preço (1 ≤ K ≤ 100,000). O fim da entrada é indicado por M = N = 0.","level":8,"name":"Supermercado","has_images":true,"description":"Sr. Jones é um marido exemplar. Todo sábado de manhã a Sra. Jones lhe dá uma lista de itens a serem comprados no supermercado e ele compra exatamente o que lhe foi pedido, sempre escolhendo as marcas com os menores preços. Mas Sr. Jones odeia ir ao mercado nos sábados, visto que seus corredores estão lotados de carregadores. Ele deseja mudar o jeito com que ele faz compras. Ao invés de ir para lá e para cá para comprar os produtos na lista de sua esposa, ele vai tentar comprar os itens passando apenas uma vez por cada corredor, pegando os produtos na ordem exata dada na lista. Então ele pediu a você para escrever um programa que o ajude com seu novo estilo de fazer compras.\n\n                Dada as informações sobre os produtos disponíveis no supermercado junto com seus preços na ordem em que aparecem na lista de Sr. Jones e a lista de produtos dada pela sua mulher, seu programa deve determinar o menor preço que ele pagaria.\n\n                Sr. Jones compra os produtos na ordem em que eles aparecem em sua lista e ele nunca volta atrás enquanto anda pelos corredores. Portanto, se ele compra o i-ésimo produto no seu caminho para o j-ésimo item da lista, o próximo produto a ser comprado é o (j+1)-ésimo item da lista – e deve ser comprado dos produtos que vem depois de i em seu caminho. A figura abaixo mostra um exemplo onde produtos são identificados por inteiros. Note que diferentes marcas do mesmo produto poder aparecer separadamente. No exemplo Sr. Jones deve comprar os produtos 1, 1, 2, 20 (note que o produto 1 aparece duas vezes na lista). Para o exemplo, o custo mínimo que Sr. Jones pode conseguir, seguindo suas limitações, é 21.30. Note também que com esse novo estilo de fazer comprar pode ser impossível para Sr. Jones comprar todos os itens da sua lista; neste caso, seu programa deve alertar Sr. Jones.\n\n                \n\n                (a) Lista da Sra. Jones   (b) Lista de produtos com seus respectivos preços e ordem em que aparecem na direção de Sr. Jones pelos corredores.","id":"1351","category":"Ad-Hoc","statistics":{"level":"8 / 10","submissions":777,"solved":214,"ratio":"27.54%"}}