{"output":"Para cada caso de teste na entrada, seu programa deve produzir uma lista ordenada de cortes que devem ser feitos para separar o grande painel nos painéis menores desejados. Cada corte deve aparecer em uma linha diferente. Um corte é descrito em quatro inteiros X1, Y1, X2, Y2, onde (X1, Y1) e (X2, Y2) especificam as marcações do corte, sendo X1 < X2 e Y1 = Y2 para um corte horizontal, e X1 = X2 e Y1 < Y2 para um corte vertical. Como mais de um corte é possível, seu programa deve imprimir a lista em uma ordem particular. Se em algum ponto mais que um corte for possível, imprima primeiramente o corte com o X1 menor; se mais de um corte ainda for possível, imprima primeiro aquele com o Y1 menor. Imprima uma linha em branco após cada lista do caso de teste.","input":"A entrada contém vários casos de teste. A primeira linha do teste contém um inteiro N indicando o número de janelas e quadros de foto, sendo (2 ≤ N ≤ 2000). Cada uma das próximas N linhas contém quatro inteiros X1, Y1, X2, Y2, onde (X1, Y1) e (X2, Y2) representam as coordenadas esquerda-inferior e direita-superior marcadas por tio Jeff no grande painel de vidro (-5000 ≤ X1, Y1, X2, Y2 ≤ 5000; X1 < X2 e Y1 < Y2). Você deve assumir o seguinte caso de teste:\n\n                \n                    Os retângulos marcados não se sobrepõem (mas pode haver interseções nos pontos as bordas) e dividem o grande painel de vidro em regiões retângulares, de modo a não haver desperdídio. Isso significa que as coordenadas esqueda-inferior e direita-superior do grande painel podem ser inferidas com as coordenadas dos triângulos marcados.\n\n                    É possível partir o o grande painel de vidro em retângulos menores atravéz de uma sequência de cortes de extremidade à extremidade.\n                \n\n                \n                    O fim da entrada é indicado por N = 0.","level":10,"name":"Cortando Extremidades","has_images":true,"description":"Tio Jeff é dono de uma loja de vidros, que vende painéis de vidros para janelas e quadros de foto. Como você provavelmente sabe, um painel de vidro pode ser cortado apenas de extremidade à extremidade em linha reta. A figura abaixo mostra como o painel de vidro pode ser cortado em três painéis menores.\n\n                \n                        ​\n\n\t\t\t\t\n                    (a) painel de vidro original              (b) primeiro corte                 (c) segundo corte                 \n                \n                    Tio Jeff normalmente opera da seguinte forma. Ele primeiro coleta vários pedidos de pequenos painéis retangulares, para janelas ou quadros de foto. Ele então marca a posição de cada painel retangular em um grande painel retangular, de forma a que nenhum deles se sobreponha. Finalmente ele realiza uma sequência de cortes verticais e horizontais, sempre de extremidade à extremidade do painel, para produzir painéis para todos os clientes.\n\n                \n                    Já que a última fase (a de cortar o grande painel em pedaços) é a parte mais chata que alguém possa jamais imaginar, tio Jeff está pedindo sua ajuda. Ele quer um programa no qual dado um grande painel retangular e as coordenadas esquerdo-inferior e direito-superior de cada retângulo marcado, determine a ordem no qual cada corte de extremidade à extremidade deve ser feito. Essa lista de cortes será dada a máquina que fará os entediantes cortes para ele!","id":"1358","category":"Geometria Computacional","statistics":{"level":"10 / 10","submissions":74,"solved":31,"ratio":"41.89%"}}