{"output":"Para cada caso de entrada, seu programa deve produzir uma linha da saída, contendo o mínimo de calorias consumidas por Sr. Sapo para ir de sua casa até a de Srta. Toad. Se for impossível que ele chegue até a casa dela, seu programa deve imprimir \"impossible\" (impossível).","input":"A entrada possui vários casos de teste. A primeira linha de um caso de teste contém dois inteiros, C e R, indicando o número de colunas e o mímero de linhas do pântano (1 ≤ C, R ≤ 1000). A segunda linha de um caso de teste contém quatro inteiros Cf, Rf, Ct e Rt, onde (Cf, Rf) indica o local da casa do Sr. Sapo e (Ct, Rt) indica o local da casa de Srta. Toad (1 ≤ Cf,Ct ≤ C; 1 ≤ Rf,Rt ≤ R). A terceira linha de um caso de teste contem um inteiro W (0 ≤ W ≤ 1000) indicando o número de lugares molhados no pântano. Cada uma das W linhas seguintes contêm quatro inteiros C1, R1, C2 e R2 (1 ≤ C1 ≤ C2 ≤ C; 1 ≤ R1 ≤ R2 ≤ R), descrevendo um espaço retangular molhado compreendendo os qudrados que possuem coordenadas (x,y) tais que C1 ≤ x ≤ C2 e R1 ≤ y ≤ R2. O final da entrada é indicado por C = R = 0.","level":7,"name":"Sapo Preguiçoso","has_images":true,"description":"O Sr. Sapo mora num pântano com formato de grade retangular, composto por quadrados de mesmo tamanho, tais que alguns são secos e outros molhados. Sr. Sapo mora num quadrado seco e só pode pular de um quadrado seco para outro quando vai passear pelo pântano.\n\n                Ele quer visitar sua namorada, Srta. Toad, que também mora num quadrado seco no mesmo pântano. Mas Sr. Sapo é preguiçoso, e quer gastar o mínimo de energia pulando até a casa dela. Ele sabe a quantidade de energia que ele gasta em qualquer um de seus pulos. Para cada pulo único, Sr. Sapo sempre usa a figura a seguir para determinar quais são os possíveis quadrados para os quais ele pode pular da posição em que ele se encontra (o quadrado marcado com F), e a energia correspondente gasta nos pulos, em calorias. Qualquer outro quadrado não é alcançável por Sr. Sapo dessa posição com um único pulo.\n\n                \n\n                Seu trabalho é determinar qual é a mínima quantidade de energia que o Sr. Sapo tem que gastar para ir da sua casa à casa da Srta. Toad.","id":"1384","category":"Grafos","statistics":{"level":"7 / 10","submissions":327,"solved":146,"ratio":"44.65%"}}