{"output":"Para cada caso de teste da entrada seu programa deve produzir uma única linha de saída, indicando para quais bases a equação dada é válida.\n\n                Se a expressão for verdadeira para infinitas bases, imprima \"B+\", onde B é a primeira base para a qual a equação é válida.\n\n                Se a expressão for válida apenas para um conjunto finito de bases, imprima elas em ordem crescente, separadas por espaço.\n\n                Se a expressão não for verdadeira em nenhuma base, imprima o caractere '*'.","input":"Cada linha da entrada contém um caso de teste; cada caso de teste é uma equação da forma \"EXPR=EXPR\", onde ambos \"EXPR\" são expressões aritméticas com no máximo 17 caracteres.\n\n                Todas expressões são válidas e contém apenas os caracteres '+', '*' e os dígitos entre '0' e '9'. Nenhuma expressão contém sinais de mais no começo da equação e nenhum número tem zeros à esquerda.\n\n                O final da entrada é indicado por uma linha contendo apenas \"=\".","level":9,"name":"Bases","has_images":false,"description":"O que você consegue se multiplicar 6 por 9? A resposta, é claro, é 42, mas somente se você fizer os cálculos na base 13.\n\n                Dado um inteiro B ≥ 2, o sistema de numeração na base B é a maneira de escrever inteiros usando somente dígitos entre 0 e B - 1, inclusive. Em um número escrito na base B, o dígito mais à direita tem seu valor multiplicado por 1, o segundo mais à direita tem seu valor multiplicado por B, o terceiro mais à direita tem seu valor multiplicado por B2, e assim por diante.\n\n                Algumas equações são verdadeiras ou falsas dependendo da base em que são consideradas. A equação 2 + 2 = 4, por exemplo, é verdadeira para qualquer B ≥ 5 - ela não vale para a base 4, por exemplo, visto que não existe dígito '4' na base 4. Por outro lado, uma equação como 2 + 2 = 5 nunca é verdadeira.\n\n                Escreva um programa que, dada uma equação, determine em quais bases ela é verdadeira.","id":"1390","category":"Matemática","statistics":{"level":"9 / 10","submissions":146,"solved":35,"ratio":"23.97%"}}