{"output":"Para cada caso de teste ser programa deve imprimir uma única linha contendo um inteiro, representando o quanto você deve pagar.","input":"A entrada contém vários casos de teste. Cada teste é composto de uma única linha, contendo dois inteiros A e B, separados por um único espaço, representando os números mostrados a você pela companhia (1 ≤ A, B ≤ 109). Você deve assumir que haja sempre uma única solução, ou seja, existe exatamente um par de números de consumo que produzem tais números.\n\n                O último caso de teste é seguido de uma linha contendo dois zeros separados por um único espaço.","level":5,"name":"Conta de Luz","has_images":true,"description":"O ano é 2100. A eletricidade se tornou muito cara. Recentemente, sua companhia elétrica elevou as taxas de energia mais uma vez. A tabela abaixo mostra as novas taxas (o consumo é sempre um inteiro positivo):\n\n                \n\n                Isso significa que, calculando a quantidade a pagar, os primeiros 100 LWh (Crazy-Watt-hora) tem o preço de 2 Americus cada; os próximos 9900 LWs (entre 101 e 10000) tem um preço de 3 Americus cada e assim por diante.\n\n                Por exemplo, se você consome 10123 LWs você terá que pagar 2×100+3×9900+5×123 = 30515 Americus.\n\n                Os matemáticos do mal da companhia armaram um jeito de ganhar ainda mais dinheiro. Ao invés de informarem quanta energia você consumiu e quanto deve pagar, eles mostram os números relativos a você e um vizinho aleatório:\n\n                A: o total a pagar se as contas fossem somadas; e\n                    B: o valor absoluto entre as contas.\n\n                Se você não consegue descobrir quanto você tem que pagar, você deve pagar mais 100 Americus pelo \"serviço\". Você é bastante econômico, portanto não tem como ter consumido mais que seus vizinhos. Então, sendo esperto, você sabe que tem como computar quanto você tem que pagar. Por exemplo, suponha que a companhia informou-o os seguintes números: A = 1100 e B = 300. Então o seu consumo e do seu vizinho tem que ser 150 LWh e 250 LWh respectivamente.\n\t\t\t\tO consumo total é 400 LWh então A é 2×100+3×300 = 1100. Você deve pagar 2×100+3×50 = 350 Americus, enquanto seu vizinho deve pagar 2×100+3×150 = 650 Americus, então B é |350 - 650| = 300.\n\n                Decidido a não pagar o custo adicional, você resolveu escrever um programa de computador para encontrar quanto você deve pagar.","id":"1392","category":"Matemática","statistics":{"level":"5 / 10","submissions":505,"solved":178,"ratio":"35.25%"}}