{"output":"Para cada caso de teste na entrada, seu programa deve imprimir uma única linha, contendo um único caractere, 'Y' se seu time pode ser campeão ou 'N' caso contrário.","input":"A entrada contém vários casos de teste, cada caso consiste um uma ou mais linhas. A primeira linha contém três inteiros, N, M e G, separados por um espaço cada, representando respectivamente o número de times diputando o campeonato (2 ≤ N ≤ 40), o número correspondente (1 ≤ M ≤ 4) e o número de jogos já concluídos (1 ≤ G). Seu time é identificado pelo número 0, os outros times são identificados pelos inteiros 1, 2,..., N - 1.\n\n                Cada uma das próximas G linhas, descreve os jogos já disputados. A linha contém um inteiro I, um caractere C e um inteiro J, separados por um espaço cada. inteiros I e J são os times que jogaram tal jogo (I ≠ J e 0 ≤ I, J ≤ N - 1). O caractere C será '<' se o time I perder para o time J, ou '=' se terminar empatado.\n\n                O último caso de teste é seguido por uma linha contendo três zeros separados por um espaço cada.","level":9,"name":"Hooligan","has_images":false,"description":"Futebol é o esporte mais popular da América Latina (e do mundo). \"Hooligan\" é uma palavra usada para descrever um fã agressivo de futebol.\n\n                Em Linearonia, está sendo realizado um campeonato de futebol. Lá o rank funciona assim: para cada jogo o campeão ganha dois pontos e o perdedor não ganha nenhum; em caso de empate cada time recebe um ponto. O campeão é o time com o maior número de pontos. Cada par de times diferentes disputam uma partida um contra o outro um número igual de vezes, chamado de número correspondente.\n\n                Você tem seu time favorito, seu time dos sonhos, e você pondera se é possível o seu time ser o campeão. Você sabe o número de times, o número correspondente e o resultado de alguns jogos que já foram jogados. Escreva um programa que informe se ao fim do campeonato seu time poderá ser o único campeão, extritamente com mais pontos que qualquer outro time.","id":"1394","category":"Grafos","statistics":{"level":"9 / 10","submissions":654,"solved":220,"ratio":"33.64%"}}