{"output":"Para cada linha, imprima o número real que está sendo contado, quando a m-ésima pessoa bate palmas pela k-ésima vez. Se isso nunca pode acontecer, imprima '-1'.","input":"Haverá, no máximo, 100 casos de teste na entrada. Cada teste contém três inteiros n, m e k (2 ≤ n ≤ 100, 1 ≤ m ≤ n, 1 ≤ k ≤ 100) em uma única linha. O último caso de teste é seguido por uma linha com n = m = k = 0, e que não deverá ser processada.","level":4,"name":"Jogo - Contando","has_images":false,"description":"Existem n pessoas que estão em uma linha, em um famoso jogo chamado \"contando\". Quando o jogo começa, a pessoa mais à esquerda diz \"1\" em voz alta, em seguida, a segunda pessoa (as pessoas estão numerados de 1 a n, da esquerda para a direita) diz \"2\" em voz alta. Isto é seguido pela terceira pessoa dizendo \"3\", e assim por diante. Quanda o e-nésima pessoa (ou seja, a pessoa mais a direita) diz \"n\" em voz alta, a próxima vez vai para a sua pessoa imediatamente à esquerda (ou seja, a (n - 1)-nésima pessoa), que deve dizer \"n + 1\" em voz alta, então a (n - 2)-ésima pessoa deve dizer \"n + 2 \" em voz alta. Depois que a pessoa mais à esquerda falou de novo, a contagem vai para a direita novamente. Há um senão (caso contrário, o jogo seria muito chato!): Se uma pessoa dizer um número que é múltiplo de 7, ou sua representação decimal contém o dígito 7, ele deve bater palmas em vez disso! A tabela a seguir nos mostra o processo de contagem para n = 4 ('X' representa uma salva de palmas). Quando a 3ª pessoa bate palmas pela 4 vez, ele está realmente contando 35.\n\t\t\t\t\n                \n                    \n                        \n                            \n                                Person\n                                1\n                                2\n                                3\n                                4\n                                3\n                                2\n                                1\n                                2\n                                3\n                            \n                            \n                                Action\n                                1\n                                2\n                                3\n                                4\n                                5\n                                6\n                                X\n                                8\n                                9\n                            \n                            \n                                Person\n                                4\n                                3\n                                2\n                                1\n                                2\n                                3\n                                4\n                                3\n                                2\n                            \n                            \n                                Action\n                                10\n                                11\n                                12\n                                13\n                                X\n                                15\n                                16\n                                X\n                                18\n                            \n                            \n                                Person\n                                1\n                                2\n                                3\n                                4\n                                3\n                                2\n                                1\n                                2\n                                3\n                            \n                            \n                                Action\n                                19\n                                20\n                                X\n                                22\n                                23\n                                24\n                                25\n                                26\n                                X\n                            \n                            \n                                Person\n                                4\n                                3\n                                2\n                                1\n                                2\n                                3\n                                4\n                                3\n                                2\n                            \n                            \n                                Action\n                                X\n                                29\n                                30\n                                31\n                                32\n                                33\n                                34\n                                X\n                                36\n                            \n                        \n                    \n                \n\n                Dado n, m e k, a sua tarefa é descobrir, quando a m-ésima pessoa bate palmas pela k-ésima vez, e qual é o número real que está sendo contado.","id":"1400","category":"Matemática","statistics":{"level":"4 / 10","submissions":1018,"solved":473,"ratio":"46.46%"}}