{"output":"Para cada caso de teste da entrada seu programa \n                    deve imprimir uma linha, contendo um valor real representando o tamanho \n                    da placa de madeira que Indiana Jones deve carregar. O tamanho deve ser \n                    impresso como um número real com 2 casas decimais, e o último valor \n                    decimal deve ser arredondado. A entrada não conterá casos de teste onde \n                    as diferenças de arredondamento são significativas.","input":"Seu programa deve processar vários casos de teste. Cada caso de teste começa com um inteiro N indicando o número de porções de paredes restantes na cidade (2 ≤ N ≤ 1000). Cada uma das N\n                    linhas seguintes descrevem uma porção de parede. A primeira porção de \n                    parede é a porção em que Indiana Jones se localiza inicialmente. A \n                    segunda porção é aquela em que a pessoa presa se localiza. Cada \n                    descrição de porção de parede consiste de três inteiros X, Y e L (-10000 ≤ X, Y, L ≤ 10000), onde X e Y\n                    definem ou o ponto mais próximo do Sul (para porções verticais) ou o \n                    ponto mais próximo do Oeste (para porções horizontais). O valor de L determina o tamanho e a direção da porção: se L ≥ 0, a porção é horizontal, de comprimento L; se L < 0, a seção é vertical, com comprimento |L|. O final da entrada é indicado por N = 0.","level":8,"name":"Será Que Indiana Jones Chega Lá?","has_images":true,"description":"Indiana Jones está numa cidade deserta, \n                    aniquilada durante uma guerra. Os telhados de todas as casas foram \n                    destruídos e apenas alguns pedaços de parede ainda estão de pé. O solo \n                    tem tantas minas que a única maneira segura de se locomover pela cidade é\n                    andando sobre as poucas paredes restantes. A missão de nosso herói é \n                    salvar uma pessoa que está presa na cidade. Para se locomover entre duas\n                    paredes não conectadas Indiana Jones pensou em levar consigo uma placa \n                    de madeira, que ele poderia colocar entre as duas paredes e assim passar\n                    sobre a placa de uma para a outra.\n                \n\n                \n\t\t\t\t\n\t\t\t\tFig. 1: Mapa da cidade com a rota usada por Indiana Jones\n\t\t\t\t\n\n                \n                    As posições iniciais de Indiana Jones e da pessoa presa estão em \n                    algum ponto das paredes. Além disso, as paredes têm apenas a direção \n                    Norte-Sul (vertical) ou Oeste-Leste (horizontal).\n                \n\n                \n                    Você receberá um mapa com as ruínas da cidade. Sua missão é \n                    determinar o menor tamanho da placa de madeira que Indiana Jones precisa\n                    carregar para chegar à pessoa.","id":"1402","category":"Grafos","statistics":{"level":"8 / 10","submissions":167,"solved":68,"ratio":"40.72%"}}