{"output":"Para cada caso de teste imprima uma linha com um caractere representando o resultado do jogo: \"M\" caso o vencedor seja Mark, \"L\" caso o vencedor seja Leti, ou \"T\" caso haja um empate (tie).","input":"Cada caso de testo é descrito por três linhas. A primeira linha contém um inteiro R indicando o número de rodadas do jogo (1 ≤ R ≤ 10). A segunda linha contém R inteiros Mi indicando os monstros liberados por Mark a cada rodada (1 ≤ Mi ≤ 10, para 1 ≤ i ≤ R). A terceira linha contém R inteiros Li indicando os monstros liberados por Leti a cada rodada (1 ≤ Li ≤ 10, para 1 ≤ i ≤ R).\n\n                O último caso de teste é composto por uma linha contendo zero.","level":4,"name":"Bakugan","has_images":false,"description":"Mark e Leti adoram brincar com suas bolas \n                    Bakugan. Essas bolas são pequenas esferas de plástico com um pequeno \n                    brinquedo-monstro dentro. Quando jogada ao chão, a bola Bakugan se abre,\n                    fazendo um som incrível e liberando um monstro Bakugan assustador. Mark\n                    e Leti adoram brincar com seus monstros, mas abrir as bolas Bakugan \n                    também é bem divertido.\n                \n\n                \n                    Cada um deles recebeu uma bolsa com bolas Bakugan e eles inventaram \n                    um jogo para abrir as bolas. Existem 10 monstros diferentes, e para o \n                    jogo Mark e Leti associaram cada monstro a um inteiro diferente de 1 a \n                    10, de acordo com o nível de feiura do monstro. O jogo é composto de R \n                    rodadas. A cada rodada:\n                \n\n                \n                    Os dois jogadores jogam suas bolas ao chão simultaneamente;\n                    Cada jogador acumula um número de pontos coincidente com o número associado ao monstro liberado por sua bola;\n                    O primeiro (e apenas o primeiro) jogador que liberar o mesmo \n                        monstro em três rodadas consecutivas ganha 30 pontos adicionais; se essa\n                        condição acontecer na mesma rodada para ambos os jogadores então \n                        ninguém ganha pontos extras.\n                \n\n                O vencedor do jogo é o jogador que acumular mais pontos. Por favor ajude Mark e Leti anunciar o vencedor do jogo!","id":"1419","category":"Ad-Hoc","statistics":{"level":"4 / 10","submissions":2285,"solved":1012,"ratio":"44.29%"}}