{"output":"Para cada cado de teste, imprima uma única linha contendo 'Let me try!'(Me deixe tentar) se for possível chegar a Pedra M, caso contrário, imprima um linha contendo 'Don't make fun of me!'(Não ria de mim!).","input":"A entrada contém mais de 2000 casos de teste. Cada caso de teste contém um única linha. Ela contém dois positivos inteiros N(2 ≤ N ≤ 106), e M(1 ≤ M ≤ N), M indica o número da pedra em que o presente está. O caso de teste no qual N = 0, M = 0 terminará a entrada e não deve ser contado como caso de teste.","level":6,"name":"Presente?!","has_images":false,"description":"Existe um belo riacho em uma bela vila. N Pedras estão alinhadas em linha reta do número 1 até N, da margem esquerda à margem direita, como mostrado abaixo.\n\n                [Flanco esquerdo] - [Pedra 1] - [Pedra 2] - [Pedra 2] - [Pedra 3] - [Pedra 4] - [Pedra N] - [Flanco Direito]\n\n                A distância entre duas Pedras adjacentes é exatamente 1 metro, enquanto a distância entre a margem esquerda e a Pedra 1 e a distância entre a Pedra N e a margem direita também são 1 metro.\n\n                \n                    O sapo Frank está prestes a atravessar o riacho, seu vizinho, o sapo Funny veio a ele e disse:\n                    'Olá Frank, feliz dia das Crianças! Eu tenho um presente para você. Vê? Um pequeno pacote na Pedra 5.'\n                    'Oh, que legal! Obrigado! Eu vou pegar.'\n                    'Espere! Este presente é apenas para sapos inteligentes. Você não pode pegar pulando direto.'\n                    'Oh? Então o que devo fazer?'\n                    'Pular mais vezes. Seu primeiro pulo deve ser da margem esquerda para a Pedra 1, então, pule quantas vezes quiser - não importa se for pra frente ou para traz - mas seu pulo i deve cobrir 2 × i - 1 metros. E mais, uma vez que alcance a margem direita ou esquerda, o jogo termina, sem mais pulos!'\n                    'Hummmm, nada fácil... deixa eu pensar!' Respondeu sapo Frank, 'Devo tentar?'","id":"1425","category":"Estruturas e Bibliotecas","statistics":{"level":"6 / 10","submissions":2491,"solved":493,"ratio":"19.79%"}}