{"output":"Para cada caso de teste, a saída deve ser formada por 9 linhas descrevendo os números de todos os tijolos da parede. Assim, a i-ésima linha deve conter os números correspondentes aos i tijolos da i-ésima linha da parede, da esquerda para a direita, separados por um espaço.","input":"A primeira linha da entrada contém um inteiro N, indicando o número de casos de teste. Esta linha é seguida pelos casos de teste. Cada caso é descrito por 5 linhas. Essas linhas correspondem às linhas ímpares da parede, de cima para baixo, como descrito acima. Cada linha contém os números nos tijolos já rotulados da linha correspondente na parede, da esquerda para a direita, separados por um espaço em branco.\n\n                Você pode assumir que todo caso de teste é correto, isto é, existe uma solução para o problema descrito.","level":2,"name":"Coloque Tijolos na Parede","has_images":true,"description":"Não, não é \"mais um tijolo na parede\", é apenas um problema sobre somar números.\n\n                Suponha que você tem uma parede com o formato de um triângulo, como a mostrada abaixo. A parede tem 9 linhas, e a i-ésima linha tem exatamente i tijolos, considerando que a linha mais acima é a 1ª e que a mais abaixo é a 9ª. Alguns tijolos são rotulados com um número, enquanto os demais estão em branco. Os tijolos rotulados aparecem apenas em linhas ímpares, e ocupam posições ímpares dentro das suas linhas.\n\n                ​\n\n                O problema que você deve resolver consiste em rotular os tijolos em branco com números, de tal forma que a seguinte regra seja satisfeita: O número de um tijolo é igual à soma dos números dos dois tijolos abaixo dele. Obviamente, esta regra não é aplicada à 9ª linha. Todos os números devem ser inteiros.\n\n                Nota: O exemplo de entrada contém dois casos de teste. O primeiro dele corresponde à parede mostrada acima.","id":"1426","category":"Ad-Hoc","statistics":{"level":"2 / 10","submissions":2511,"solved":1491,"ratio":"59.38%"}}