{"output":"Para cada rota de cada caso de teste, você deve produzir uma ou duas linhas de saída. Se existe uma rota entre as localizações solicitadas, você deve produzir duas linhas: uma contendo o custo mínimo da viagem e outra contendo a rota utilizada. As linhas devem ser impressas no seguinte formato (sem aspas):\n\n                \"Mr <empregado> to go from <localização de origem> to <localização de destino>, you will receive <custo mínimo> euros\"\n                    \"Path:<localização de origem> <localizações separadas por espaços> <localização de destino>\"\n\n                Se não há uma rota possível entre as localizações de origem e destino, você deve produzir uma linha, no seguinte formato (sem aspas):\n\n                \"Sorry Mr <empregado> you can not go from <localização de origem> to <localização de destino>\"\n\n                Se houver dois caminhos minimos possiveis entre A e B e os dois tem vertices intermediarios, a preferencia é do caminho que aparece antes na entrada, por exemplo:\n                \n                    Se as cidades da entrada forem: A B C D E F, o caminho \"A C D B\" tem mais prioridade que o caminho \"A E B\" (pois E aparece depois que D) e o caminho \"A D E B\" tem mais prioridade sobre \"A C F B\" (pois F aparece depois que E). A analise é feita olhando-se a ordem de entrada dos vértices intermediários.","input":"A entrada começa com uma linha contendo um inteiro C (1 ≤ C ≤ 99), indicando o número de casos de testes. Cada caso de teste é descrito a seguir.\n\n                A primeira linha de um caso de teste contém um inteiro P (1 ≤ P ≤ 99), indicando o número de localizações existentes. A segunda linha contém os nomes das localizações, separados por um TAB. Cada nome tem no máximo 20 caracteres.  As próximas P linhas contém os custos para ir de uma localização diretamente para outra, também separados por TAB. A primeira destas linhas contém os custos para ir diretamente da primeira localização para todas as outras; a segunda linha contém os custos para ir da segunda localização para todas as outras; e assim por diante. Um custo é dado por um inteiro W (-1 ≤ W ≤ 300), onde W = -1 indica que a viagem direta entre as localizações é muito cara e não pode ser realizada, e W = 0 indica o custo para ir diretamente de uma localização a ela mesma.  Depois das P linhas, há uma linha contendo um inteiro R (1 ≤ R ≤ 99), indicando o número de rotas a serem consideradas. As próximas R linhas contém cada uma o nome de um funcionário e o nome das localizações de origem e destino de sua entrega. Os nomes das localizações diferenciam maiúsculas e minúsculas (case sensitive), e o nome do funcionário tem no máximo 30 caracteres.","level":9,"name":"O Problema da Scrooge Co.","has_images":false,"description":"A empresa de entregas Scrooge Co. quer estabelecer um sistema para pagar a menor quantia necessária de dinheiro a seus empregados durante suas entregas. A empresa sabe qual é a quantia mínima de dinheiro necessária para ir diretamente de uma localização até outra.\n\n                A empresa pediu para você escrever um programa que compute a menor quantia de dinheiro que um empregado deve receber para poder ir de uma localização até outra, e a rota que ele deve usar.","id":"1427","category":"Grafos","statistics":{"level":"9 / 10","submissions":539,"solved":114,"ratio":"21.15%"}}