{"output":"Para cada instância do problema você deve imprimir uma única linha, contendo o número mínimo de grupos que satisfazem os 3 requerimentos acima.\n\n                A saída deve ser escrita pela saída padrão.","input":"Seu programa deve processar vários casos de teste. A primeira linha de um caso de teste contém um inteiro K e um racional R. K representa o número de idades diferentes do clube (1 ≤ K ≤ 120), e R representa o fator divisor especificado pelo diretor do clube (1.0 ≤ R ≤ 2.0). As próximas K linhas descrevem os membros do grupo, cada linha contém 2 inteiros N e M, indicando que existem N membros que tem M anos no clube (1 ≤ N ≤ 10000 e 1 ≤ M ≤ 120). O fim da entrada é indicado por uma linha com K = 0 e R = 0.0.\n\n                Os valores de entrada serão tais que um erro eventual na representação binária interna de R não afetará o resultado.\n\n                A entrada deve ser lida da entrada padrão.","level":10,"name":"O Clube da Divisão","has_images":false,"description":"O clube ACM (All Can Meet) foi criado com o propósito de atrair pessoas de todas as idades, com a ideia de que todas as pessoas poderiam sentar e compartilhar experiências de vida, para o benefício de todos. Mas como aconteceu, o clube tornou-se um sucesso tão grande que tornou-se praticamente impossível reunir todos os membros no mesmo local ao mesmo tempo. O clube decidiu então dividir seus membros em \"seções\" menores. Em função de manter uma boa divisão, o diretor so clube decidiu impor os seguintes requerimentos:\n\n                A. todos os membros da mesma idade devem estar na mesma seção,\n                B. todos os membros devem fazer parte de exatamente uma seção,\n                C. em cada seção, o número máximo de pessoas com a mesma idade não podem ser mais que R vezes o número mínimo de pessoas da mesma idade, onde R é um número racional entre 1.0 e 2.0. O número R é chamado de o fator divisor do clube.\n\n                A última condição garante que não há um grupo menor de jovens que talvez sintam-se inconfortáveis na seção. Por exemplo, denotados por [N,M] um grupo com N menbros que tem M anos. Então a seção {[10,50],[6,45],[70,12],[43,23]} o número máximo de pessoas com a mesma idade é 70, o número mínimo de pessoas com a mesma idade é 6. Se R = 2.0, então dizemos que esta seção não satisfaz os requerimentos (C) desde que 70/6 ≤ 2.0. No entanto podemos dividir esta seção em duas menores seções, nominando {[10,50],[6,45]} e {[70,12],[43,23]}, no qual satisfazem os requerimentos.\n\n                Dado o fator divisor R e uma lista de membros do clube, você deve escrever um programa para achar o número de seções que satisfazem os três requerimentos acima.","id":"1433","category":"Matemática","statistics":{"level":"10 / 10","submissions":1256,"solved":70,"ratio":"5.57%"}}