{"output":"A cada conjunto de relação, imprima o número total de participantes na festa, incluindo o anfitrião. O total da festa, uma por linha. Na entrada  0 não escreva nada.","input":"Para  cada festa, haverá um número de relação entre os convidados. Este é um valor N escrito antes das relações que seguem em pares do tipo (x, y) = (y, x).  Onde x é o nome de um amigo e y o seu convidado. Os valores de x e y são numerados  de 1 a 1000, e o anfitrião é sempre o número 1.\n\n                A leitura de 0 na entrada indica fim de festa! O formato dessas entradas seguem os padrões abaixo.","level":6,"name":"Quem Vai à Festa?","has_images":false,"description":"A garoa fina que caiu na última semana levou o professor Claudius Virux ficar saudoso de seus tempos de Campina Grande – Pb,  como estudante  na UFCG.  Lá,  o inverno é um período marcado por uma chuvinha igual a de Joinville, com noites frias.\n\n                Na universidade, as festinhas  dos estudantes,  que ocorriam em quase todas as sextas-feiras e sábados,  eram um programa e tanto. O mais interessante é que se encontravam as figuras mais inusitadas, poetas, cantores, professores, e outros artistas, além, é claro, dos estudantes.  Sempre havia  algum  motivo para  organizar  uma  festa,  quando  não,  a ideia era celebrar  a semana dura da universidade que se passou.\n\n                O mais curioso era a sistemática de como o anfitrião fazia o convite. O dono(a)  da casa (em seus tempos  se chamava  de república) convidada os seus amigos imediatos, estes por sua vez convidavam outros,  e  assim, sucessivamente. Chegado o dia da festa, o anfitrião queria conhecer os seus novos amigos, a fim de verificar como tal corrente de convite tinha se propagada.\n\n                Para  controlar quantos e como os convidados vieram à festa, o anfitrião solicitou a cada um que chegasse, escrevesse seu nome, e quem o convidou.\n\n                Sua tarefa é contar quantos convidados estão presentes em cada  festa, dada apenas a relação imediata entre convidado e um amigo.","id":"1445","category":"Ad-Hoc","statistics":{"level":"6 / 10","submissions":599,"solved":305,"ratio":"50.92%"}}