{"output":"Você deverá imprimir um cabeçalho indicando o número da instância que está tratando (Instancia h) e nas linhas seguintes o par cor e área total visível desta cor. Estas linhas devem ser ordenadas pelas áreas, de forma decrescente. Resolva os empates de forma crescente na cor. Apenas para simplificar a apresentação, mostre os valores das áreas arredondados em duas casas decimais. Imprima uma linha em branco após cada instância.","input":"São dadas várias instâncias. Cada instância é composta por três figuras. Essas figuras são dadas uma por linha, com o formato\n\n                ni ci xi1 yi1 xi2 yi2 ... xij yij ... xin yin​\n\n                para i = 1, 2, 3, onde 0 ≤ ni ≤ 200 é o número de pontos na borda da figura i, ci é a cor da figura i e os pares (xij , yij) representam os pontos da borda de i no sentido anti–horário, dados por inteiros. A entrada termina quando n1 = 0 (note que essa instância não deve ser processada).","level":10,"name":"Diagrama de Venn?","has_images":false,"description":"Mickayil estava na escola estudando teoria de conjuntos. As escolas em Praga são bastante rigorosas. A professora ensinou para os alunos como desenhar diagramas de Venn para três conjuntos, e pediu aos alunos que trabalhassem com os diagramas. Para impressionar a professora com diagramas bem desenhados, Mickayil decidiu que iria fazer diagramas coloridos. Para atingir esse objetivo, ele recortou três figuras convexas usando finos papéis coloridos. Mickayil percebeu que, sobrepondo as figuras, as intersecções podiam gerar novas cores.\n\n                Assim, temos três figuras convexas sobre uma superfície plana, cada figura com uma cor. Quando figuras estão sobrepostas, a cor que vemos é uma mistura das cores das figuras. Podemos representar as cores por inteiros entre 0 e 15. A mistura de cores é feita através da soma dos valores das correspondentes cores módulo 16. Queremos saber o que enxergamos ao olhar para o diagrama de Venn do Mickayil, isto é, quais cores e em que quantidade elas aparecem. Vamos medir isso através da área visível de cada cor.","id":"1446","category":"Geometria Computacional","statistics":{"level":"10 / 10","submissions":143,"solved":21,"ratio":"14.69%"}}