{"output":"Para cada valor da entrada, seu programa deve imprimir um identificador Instancia h, em que h é um número inteiro, sequencial e crescente a partir de 1. Na linha seguinte, separados por um espaço em branco, os cinco números que comprovam a condição de quadripartido, quando n for quadripartido. Siga a ordem: m p1 p2 p3 p4.\n\n                Se n não for quadripartido, seu programa deve imprimir a mensagem n nao e quadripartido. No primeiro caso, é possível que exista mais de uma sequencia que atenda às condições estabelecidas. Se isto ocorrer, seu programa deverá escolher a que apresentar o maior valor possível para m.\n\n                Uma linha em branco deve separar a saída de cada instância.","input":"Cada linha da entrada contém um inteiro n (0 ≤ n ≤ 500000) que seu programa deverá analisar e classificar em quadripartido ou não. O valor n = 0 corresponde ao final do arquivo de entrada e não deve ser processado.","level":8,"name":"Números Mágicos?","has_images":false,"description":"\"Os números sempre desempenharam um papel de acentuado relevo não só nos altos campos da Fé e da Verdade, como no humílimos terreiros da Superstição e do Erro.\" (Prof. Marão)\n\n                Malba Tahan, em seu clássico \"O Homem Que Calculava\", conta uma fábula de superstição envolvendo os números quadripartidos. Mal sabia ele que séculos antes, na antiga civilização Tcheca, a superstição envolvendo os números quadripartidos já se fazia presente. Na antiguidade, uma importante comunidade que vivia nos arredores de Neratovice, utilizava as propriedades dos números quadripartidos para prever o futuro, batizar as crianças e até mesmo para escolher os seus líderes.\n\n                Um número inteiro n é quadripartido se existe alguma divisão desse número em quatro parcelas inteiras (p1 + p2 + p3 + p4 = n) e um operador mágico (m) de modo que a primeira parcela somada ao operador mágico, a segunda diminuída dele, a terceira multiplicada por ele e a quarta dividida por ele deem o mesmo resultado (p1 + m = p2 − m = p3 * m = p4 / m).\n\n                Assim, 128 é quadripartido, porque podemos dividir 128 em 4 parcelas (31, 33, 32 e 32) de modo que existe um operador mágico (no caso, 1) que faz com que p1 + m, p2 − m, p3 * m e p4 / m sejam iguais. De fato: 31 + 1 = 33 − 1 = 32 * 1 = 32 / 1 = 32.\n\n                Um grupo de pesquisadores de Praga está reconstruindo o passado de Neratovice, e pediu a sua ajuda. Eles querem que você faça um programa que identifique quando um número é ou não quadripartido e qual é o seu operador mágico associado.","id":"1488","category":"Matemática","statistics":{"level":"8 / 10","submissions":335,"solved":150,"ratio":"44.78%"}}