{"output":"Para cada caso de teste, imprima uma linha com um inteiro representando o número máximo de torres que podem ser colocados nos quadrados sem que possam se atacar.","input":"A entrada contém vários casos de teste e termina com EOF. A primeira linha de um caso de teste contém um inteiro N (1 ≤ N ≤ 100) representando o número de linhas e colunas do tabuleiro. Cada uma das próximas N linhas contém uma seqüência de N caracteres. Na enésima linha desta string, o enésimo caractere reresenta o quadrado na coluna i, j do tabuleiro. O caractere será o \".\" (Ponto) ou a letra maiúscula \"X\", indicando, respectivamente, um quadrado vazio ou um quadrado contendo um peão.","level":9,"name":"Torres que Atacam","has_images":false,"description":"Problemas inspirados no Xadrez são uma fonte comum de exercícios nas aulas de algoritmos. Começando com o conhecido problema das 8 rainhas, várias generalizações e variações foram feitas. Uma deles é o problema N-torres, que consiste na colocação de N torres em um tabuleiro N x N de tal modo que elas não se ataquem.\n\nProfessor Anand apresentou o problema N-torres aos seus alunos. Uma vez que as torres só atacam umas às outras quando elas compartilham uma linha ou coluna, eles logo descobriram que o problema pode ser facilmente resolvido colocando as torres ao longo da diagonal principal da placa. Então, o professor decidiu complicar o problema adicionando alguns peões no tabuleiro. Em um tabuleiro com peões, duas torres se atacam se e somente se elas compartilham uma linha ou coluna e não há nenhum peão colocado entre elas. Além disso, os peões ocupam algumas posições, o que dá uma restrição adicional às posições nas quais as torres podem ser colocadas.\n\nDado o tamanho do tabuleiro e a localização dos peões, diga ao Professor Anand o número máximo de torres que podem ser colocadas em quadrados vazios tais que dois deles não possam se atacar.","id":"1490","category":"Grafos","statistics":{"level":"9 / 10","submissions":1661,"solved":612,"ratio":"36.85%"}}