{"output":"Para cada caso de teste, imprima S linhas, cada uma delas contendo um inteiro. Na enésima linha escreva o número de outros garotos que o enésimo garoto pode enxergar.","input":"A entrada contém vários casos de teste e termina com EOF. Cada caso de teste consiste de várias linhas. A primeira linha contém 3 inteiros S, K e W, representando respectivamente o número de crianças procurando, o número total de crianças e o número de paredes do playground (1 ≤ S ≤ 10; 1 ≤ K, W ≤ 104 e S ≤ K). Cada uma das próximas K linhas descreve uma criança com dois inteiros X e Y(−106 ≤ X, Y ≤ 106 ), indicando que a localização da criança no plano XY é o ponto (X, Y); o primeiro S destas linhas descreve crianças procurando. Cada uma das próximas W linhas descreve uma parede com quatro inteiros X1, Y1, X2 e Y2 (−106 ≤ X1, Y1, X2, Y2 ≤ 106), indicando que os dois pontos finais da parede no plano XY são (X1, Y1) e (X2, Y2). Você pode assumir que os segmentos de paredes não se interseccionam e que nenhum dos 3 pontos dados na entrada são colineares.","level":9,"name":"Esconde-Esconde","has_images":false,"description":"Em um playground (parque infantil), um grupo de crianças está brincando de Esconde-Esconde. Como o nome sugere, o jogo é sobre crianças se escondendo e procurando outras crianças. Cada criança, ou é uma criança que se esconde ou uma criança que procura. As crianças que se escondem apenas tentam não ser encontradas, enquanto as que procuram tentam encontrá-las.\nComo você pode notar, tanto as crianças que se escondem quanto as que procuram tentam não ser encontradas, e para fazer isso, elas usam algumas paredes que existem no parque. Cada parede é representada por um segmento de linha e cada criança é representada por um ponto no plano XY. Duas crianças se enxergam se e somente se o segmento de linha entre eles não fizer intersecção com nenhum segmento de parede.\nSua tarefa é calcular quantas outras crianças cada criança que procura consegue ver. Para simplificar o problema, você pode assumir que as paredes não se cruzam, mesmo nas suas pontas (extremidades). Além disso, não há três pontos\ncolineares dentro do conjunto formado por crianças e pontos de extremidade das paredes, o que implica que as crianças não estão dentro das paredes, e que não há duas crianças no mesmo local.","id":"1497","category":"Geometria Computacional","statistics":{"level":"9 / 10","submissions":230,"solved":78,"ratio":"33.91%"}}