{"output":"Para cada caso de teste imprima uma única linha contendo a menor diferença absoluta possível entre as somas inicial e final dos postes.","input":"Cada caso de teste contém uma linha com dois inteiros W e N (1 ≤ W ≤ 1000, 1 ≤ N ≤ 15). Em seguida há N linhas, cada uma contendo três inteiros Xi, Yi e Pi, descrevendo a posição e a energia inicial de cada poste (0 ≤ Xi ≤ W, 0 ≤ Yi ≤ 1000, 0 ≤ Pi ≤ 200). As paredes dos corredores estão nas posições x = 0 e x = W. O último caso de teste é seguido de uma linha contendo dois zeros.","level":10,"name":"Travessia","has_images":true,"description":"Twilight e seus amigos estão tentado impedir Discord de criar caos. Enquanto passavam por um corredor muito comprido em direção a Canterlot, eles se depararam com um labirinto de lasers mortais que bloquearam seu caminho!\n\nO corredor tem largura W. O labirinto de lasers consiste de N postes energizados com uma energia não-negativa Pi. Cada poste é capaz de criar um quadrado de lasers mortais centrado no poste com comprimento igual ao dobro do quadrado de sua energia e um par de lados paralelos às paredes do corredor. Note que quadrados podem se sobrepor, e que pode haver mais de um poste numa mesma posição.\n\nTwilight planeja usar sua magia para alterar as energias dos postes para alguns valores inteiros não-negativos de forma que seja possível atravessar o corredor e continuar sua jornada sem serem descobertos. Desligar todos os postes pode causar suspeitas, portanto Twilight decidiu modificar as energias dos postes de forma que a travessia seja possível e que a diferença absoluta da energia total do sistema antes e depois da travessia seja a mínima possível.\n\n\n\nAlterar as energias enquanto seus amigos atravessam pode ser perigoso, por isso Twilight decide que fará todas as alterações de antemão, e não fará nenhuma outra mudança durante ou depois da travessia, já que não podem perder tempo.\n\nAjude Twilight a terminar sua jornada encontrando o menor valor possível para a diferença absoluta da soma das energias da configuração inicial e final do labirinto.","id":"1502","category":"Grafos","statistics":{"level":"10 / 10","submissions":60,"solved":31,"ratio":"51.67%"}}