{"output":"Imprima T linhas, uma para cada caso de teste. Se Rabito tem uma estratégia que irá garantir a sua vitório imprima \"Yes\", caso contrário imprima \"No\".","input":"A primeira linha contém um único inteiro T (T <= 100) que representa a quantidade de casos de teste descritas a seguir. Um caso de teste inicia com uma linha contendo dois inteiros N, M (1 <= N <= 100, 1 <= M <= 2000) que denotam o número de vértices e arestas do grafo, em seguida há M linhas, cada uma com três inteiros u, v, w (1 <= u, v <= N) (0 < w <= 1000000) que representam os vértices da n-ésima aresta e seus pesos. Segue uma linha com dois inteiros K (0 < K <= 1000) e P (0 < P) denotando o número de ossos inicialmente colocados no grafo e o parâmetro P descrito na expecificação do problema. Finalmente uma única linha contendo K inteiros descreventos as posições iniciais dos K ossos.","level":10,"name":"Rabito e Bones","has_images":false,"description":"Rabito e Rayito estão jogando um jogo legal. Eles começam com um grafo conexo bidirecional com pesos (todos os pesos são positivos) e um conjunto de K ossos colocados em alguns dos vértices.\n\n                    Eles começam se revezando com Rabito jogando por primeiro. O jogo consiste em deslocar os ossos através do grafo até o vértice 1. Em sua vez, um dos jogadores pega um subconjunto de pelo menos 1 e no máximo P dos ossos (que não atingiram o vértice 1) e move estes ossos através de uma ou mais das arestas do grafo (os movimentos dos ossos são independentes uns do outros) sujeito a esta condição: ele pode usar uma aresta específica para um osso se, eventualmente, o osso atingir o vértice 1 usando o mínimo possível de tempo (leva A unidades de tempo para mover um osso através de uma aresta de peso A) e se a aresta faz com que este osso, eventualmente, atinja o vértice 1 com a maior quantidade de arestas.\n\n                    Há um osso enorme esperando o vencedor do jogo, assim que sua tarefa é decidir qual dos dois cães vai triunfar neste jogo e ter uma boa refeição (assumindo que ambos os cães jogam com uma estratégia ideal). O perdedor do jogo é, obviamente, o cão que não se pode fazer um movimento.","id":"1506","category":"Grafos","statistics":{"level":"10 / 10","submissions":99,"solved":19,"ratio":"19.19%"}}