{"output":"Para cada caso de teste, deve-se imprimir C linhas, sendo que cada uma representa a distância do menor caminho entre as duas antenas. Os valores devem ser INTEIROS, ou seja, a parte real deve ser truncada (não arredondada), e sempre com uma quebra de linha. Caso não seja identificada uma rota entre as antenas, deve ser impresso o valor -1.","input":"A entrada é composta de vários casos de testes. Sendo que, a primeira linha contém um inteiro não negativo, N (2 ≤ N ≤ 100), que indica o número de antenas disponíveis para interconexão na rede. Seguem-se N linhas, cada uma contendo três números inteiros X (0 ≤ X ≤ 1000), Y (0 ≤ Y ≤ 1000) e R (1 ≤ R ≤ 1000), que descrevem a posição da antena, coordenadas X e Y, e o seu raio de alcance R (separados por espaço em branco). A linha seguinte contém outro inteiro não negativo, C (1 ≤ C ≤ 100), que descreve a quantidade de cálculos à serem realizados nessa rede. As C linhas seguintes contém 2 inteiros cada, A1 (1 ≤ A1 ≤ N) e A2 (1 ≤ A2 ≤ N), que descrevem o índice das antenas a serem utilizadas e também separadas por espaço em branco.\n\nO fim das entradas é sinalizado por um número 0.","level":7,"name":"Empresa de Telecom","has_images":false,"description":"Cesário é um analista da Algar Telecom, e está trabalhando em um projeto de análise da rede de telefonia móvel. Ele terá que desenvolver um sistema que analise o alcance de cada uma das antenas dessa rede, e que defina os custos operacionais para o envio de dados de de dispositivo para outro, baseando-se na distancia entre as antenas. O objetivo minimizar esses custos, encontrando a melhor rota disponível. Os cálculos também visam descobrir se é possível estabelecer um caminho entre dois dispositivos, de forma a detectar graves problemas na rede.\n\n\nMesmo com todos os dados disponíveis para processamento, Cesário tem enfrentado problemas na implementação devido a alta complexidade desse algoritmo, por isso você foi contratado para ajudá-lo. O seu objetivo é analisar todas as antenas da rede da Algar Telecom, observando as suas coordenadas e raios de alcance; verificar quais as antenas possíveis de serem acessadas (dentro do raio de alcance); e calcular o menor caminho entre duas antenas determinadas.","id":"1539","category":"Grafos","statistics":{"level":"7 / 10","submissions":1734,"solved":567,"ratio":"32.70%"}}