{"output":"Para cada caso de teste imprima uma linha, contendo um inteiro, representando a soma máxima que é possível alcançar se os padrões forem escolhidos de forma ótima.","input":"Haverá diversos casos de teste. Cada caso de teste inicia com dois inteiros, N e M (1 ≤ N, M ≤ 100), indicando o número de linhas e de colunas do quadro, respectivamente.\n\nA seguir haverá N linhas, contendo M inteiros cada, representando os valores do quadro. Seja v o valor de qualquer posição do quadro, 1 ≤ v ≤ 100.\n\nA seguir haverá um inteiro K (1 ≤ K ≤ 100), indicando o número de padrões. Em seguida haverá K linhas, cada uma com M caracteres, representando cada um dos padrões, conforme a simbologia descrita no enunciado.\n\nO último caso de teste é indicado quando N = M = 0, o qual não deverá ser processado.","level":8,"name":"Quadro Premiado","has_images":true,"description":"Você está em um programa de televisão, e tem uma ótima chance de ganhar muito dinheiro. Trata-se de um jogo com algumas regras peculiares, e o montante de dinheiro resultante dependerá apenas da sua esperteza, podendo-se até sair perdendo caso se jogue mal.\n\nO jogo funciona da seguinte maneira: há um quadro, com N linhas e M colunas, e em cada posição deste quadro há um inteiro positivo, representando uma quantia em dinheiro. Em cada uma dessas posições você tem a opção de colocar um dos seguintes sinais:\n\n\n\t'+' - Significa que o valor daquela posição deve ser somado à seu prêmio.\n\t'-' - Significa que o valor daquela posição deve ser subtraído do seu prêmio.\n\t'.' - Significa que tal posição deve ser ignorada.\n\n\nA vida seria muito simples se você pudesse colocar '+' em todas as posições, portanto há duas regras adicionais ao jogo: para cada linha do quadro, você deve preencher as posições com um dos padrões de sinais montados pelos organizadores do jogo; e para cada coluna do quadro, não é permitido que duas posições adjacentes verticalmente tenham o mesmo sinal (se aplica aos sinais '+' e '-'). É possível usar o mesmo padrão mais de uma vez, desde que não desrespeitando a segunda regra acima.\n\nVeja um exemplo na imagem abaixo, onde os padrões são: “++”, “--”, “.+” e “+.”.\n\n\n\nConsidere que há sempre ao menos uma maneira de se completar o quadro.\n\nComo o jogo é novo, eles deixaram que você usasse seu computador para te ajudar na decisão, sem saber que você era um programador. Escreva um algoritmo que lhe diga qual a soma máxima que é possível alcançar no jogo.","id":"1543","category":"Paradigmas","statistics":{"level":"8 / 10","submissions":557,"solved":192,"ratio":"34.47%"}}