{"output":"Para cada consulta deverá imprimir duas linhas. A primeira linha contém o valor de P(i, j) com cinco dígitos após o ponto decimal e a segunda linha contém um número o qual é o número de chamadas recursivas necessários se a função acima mencionada foi utilizada para determinar o valor de P(i, j). Se o valor de P(i, j) é indefinido deverá imprimir -1 como o seu valor com formatação similar. Uma linha em branco deve ser impresso entre as saídas dos dois conjuntos consecutivos.","input":"A entrada contém vários conjuntos de entrada. A primeira linha contém um número de ponto flutuante P(0 < P < 1), e um inteiro N(0 ≤ N <1001), onde P é a probabilide de Abahoni ganhar e N é o número de consultas a seguir. Cada uma das N linhas seguintes contém dois inteiros i(0 ≤ i ≤ 1000) e j (0 ≤ j ≤ 1000). A entrada é terminada por um conjunto, que tem o valor de N como 0. Esta entrada não deve ser processada.","level":10,"name":"O Torneio Surreal","has_images":false,"description":"Neste problema particular, o Torneiro Surreal é um torneio, que participam apenas duas equipes. Vamos nomear estas duas equipes de Abahoni e Mohamedan. Eles jogam entre eles não mais de 2N - 1 jogos, o vencedor é a primeira equipe a conseguir N vitórias. Você pode assumir que não há jogos combinados, o resultado de cada jogo é independente e para qualquer jogo há uma constante P que é a probabilidade da equipe Abahoni ganhar e, portanto, há uma constante probabilidade Q(Q = 1 - P) que a probabilidade da equipe Mohamedan ganhar.\n\nP(i, j) é a probabilidade da equipe Abahoni ganhar a série, uma vez que eles ainda precisam i vitórias para conseguir isso, enquanto equipe Mohamedan ainda precisa J vitórias se quiserem vencer. A P(i, j) pode ser calculado com uma função tal como:\n\nFunção P(i, j){\n   se i = 0, então, retorne 1\n   senão se j = 0, então, retorne 0\n   senão retorne pP(i - 1, j) + qP(i, j - 1)\n}\n\nVocê vai ter que escrever um programa que dá a probabilidade de ganhar para qualquer P, i e j e também dá o número de chamadas recursivas necessárias da função acima para obter a probabilidade P(i, j).","id":"1572","category":"Matemática","statistics":{"level":"10 / 10","submissions":301,"solved":41,"ratio":"13.62%"}}