{"output":"Para cada caso de teste, a saída deve seguir a descrição abaixo. A saída de dois casos de teste consecutivos deverá ser separada por uma linha em branco.\nA saída consiste de uma linha dizendo \"Yes\", caso a rota que Giovanni está dizendo aos aldeões é uma rota segura, e \"No\" caso contrário. Lembre-se que a rota não é segura somente se os aldeões puderem encontrar Leporello no mesmo lugar ao mesmo tempo; a rota é segura mesmo se os aldeões encontrarem Leporello no destino (porque a missão dele foi realizada).","input":"A entrada inicia com um simples inteiro positivo em apenas uma linha, indicando o número de casos de teste que seguem, cada um deles como descrito abaixo. Esta linha é seguida por uma linha em branco, e também haverá uma linha em branco entre duas entradas consecutivas.\n\nÉ dado a você a atual posição de Don Giovanni (que também é a posição de Masetto e dos aldeões), e a posição atual de Leporello, em duas linhas separadas. Cada linha tem dois números: o número da rua e o número da avenida. Você pode assumir que as ruas são grids quadrados regulares, com linhas sendo ruas numeradas a partir de um, iniciando no norte, e as colunas sendo avenidas numeradas a partir de um, iniciando no oeste. Portanto, a distância entre ruas e avenidas adjacentes é sempre a mesma.\n\nO resto da entrada possui dois conjuntos de rotas, com o primeiro conjunto sendo de Leporello e o segundo conjunto sendo a rota que Giovanni irá contar para os outros. Cada conjunto inicia com um número indicando a quantidade de paradas na rota, seguido pela lista de paradas. Cada parada é especificada como uma localização, onde Leporello pode mudar a direção. Entre paradas há sempre uma linha reta na direção paralela tanto para ruas quanto para avenidas, que Leporello e os aldeões irão viajar.\n\nLeporello viaja na mesma velocidade que os aldeões. Você pode assumir que o número máximo da rua/avenida é 1000000, e não haverá mais do que 100 paradas.","level":10,"name":"Perseguindo Don Giovanni","has_images":false,"description":"No Ato II, Masetto está liderando um grupo de aldeões para perseguir Don Giovanni. Giovanni, que acaba de trocar suas roupas com Leporello e está disfarçado como ele, é questionado por Masetto sobre aonde \"seu mestre\" foi. Para evitar problemas, \"Leporello\" (disfarçado por Giovanni) quer enganar os aldeões para que eles não consigam encontrar \"Don Giovanni\" (disfarçado por Leporello). Giovanni sabe a rota que Leporello está tomando, e ele tem uma rota segura (uma rota que os aldeões não encontrariam Leporello) em mente. Ele quer ter certeza de que a rota que ele tomou é de fato segura.","id":"1575","category":"Ad-Hoc","statistics":{"level":"10 / 10","submissions":91,"solved":12,"ratio":"13.19%"}}