{"output":"A saída deve consistir de um vetor que descreve a linha do horizonte, como mostrado no exemplo acima. No vetor da linha do horizonte (v1, v2, v3, . . . , vn−2, vn−1, vn), o vi tal que i é um número par representa a linha horizontal (altura). O vi tal que i é um número ímpar representa  a linha vertical (coordenada x). O vetor deve representar o \"caminho\" tomado, por exemplo, por um inseto iniciando na menor coordenada x e viajando horizontalmente e verticalmente sobre todas as linhas que definem a linha do horizonte (skyline). Assim, a última entrada de todos os vetores da linha do horizonte será um 0 (zero).","input":"A entrada é uma sequência de triplas de edifícios. Todas as coordenadas dos edifícios são inteiros menores que 10000 e haverá ao menos um e não mais do que 5000 edifícios no arquivo de entrada. Cada tripla de edifícios está em uma linha por si só no arquivo de entrada. Todos os inteiros em uma tripla são separados por um ou mais espaços. As triplas serão ordenadas por Li, a coordenada x à esquerda do edifício, de modo que o edifício com a menor coordenada x à esquerda é o primeiro no arquivo de entrada.","level":9,"name":"O Problema da Linha do Horizonte","has_images":true,"description":"Com o advento das estações de trabalho de alta velocidade gráfica, CAD (desenho assistido por computador ou DAC) e outras áreas (CAM, design VLSI) têm feito uso cada fez mais eficaz dos computadores. Um dos problemas com imagens de desenho é a eliminação de linhas ocultas - linhas obscurecidas por outras partes do desenho.\n\t\t\t\t\tVocê deverá desenvolver um programa para ajudar um arquiteto no desenho da linha do horizonte de uma cidade, dado a localização dos edifícios da cidade. Para tornar o problema tratável, todos os edifícios possuem formas retangulares e eles compartilham uma base comum (a cidade em que eles são construídos é muito plana). A cidade também é vista como bidimensional. Um edifício é especificado por uma tripla ordenada (Li, Hi, Ri), onde Li e Ri são coordenadas esquerda e direita, repectivamente, do edifício i e Hi é a altura do edifício. No diagrama abaixo os edifícios são mostrados à esquerda com triplas\n\n(1,11,5),(2,6,7),(3,13,9),(12,7,16),(14,3,25),(19,18,22),(23,13,29),(24,4,28)\n\na linha do horizonte, exibida à direita, é representada pela sequência:\n\n(1,11,3,13,9,0,12,7,16,3,19,18,22,3,23,13,29,0)","id":"1576","category":"Ad-Hoc","statistics":{"level":"9 / 10","submissions":305,"solved":82,"ratio":"26.89%"}}