{"output":"Imprima para cada caso de teste o número de padrões de desbloqueio possíveis com exatos K segmentos considerando-se um grid N × N. Como esse número pode ser muito grande, imprima o resto que ele deixa por 109 + 7.","input":"A entrada é composta por vários casos de teste, cada um numa linha e por sua vez constituído apenas de dois números inteiros: N e K (2 ≤ N ≤ 5, 0 ≤ K ≤ 1015).","level":8,"name":"Espertofone","has_images":true,"description":"A UFFS (União Federal dos Fabricantes de Selulares[sic]), uma empresa 100% brasileira, do grupo MEC (Mercado da Espanção[sic] Comercial), acaba de lançar o Espertofone, para competir com os smartphones importados. Os Espertofones rodam um sistema operacional próprio, batizado de Androido. Quando um usuário liga um Espertofone com Androido, aparece uma tela de desbloqueio com um grid de N × N botões. O usuário deve, então, sem desencostar seu dedo da tela, deslizá-lo pelos botões de modo a desenhar seu padrão de desbloqueio gravado anteriormente e, dessarte, liberar o aparelho para uso. O sistema sempre mantém na tela um segmento de reta com um extremo no último botão tomado e outro sob o dedo do usuário, e considera que o usuário toma um botão B se e somente esse segmento intercepta o centro de B. Diferentemente do que ocorre com o sistema da concorrência, no Androido o usuário pode repetir botões, desde que isso seja possível. A Figura ilustra um padrão de desbloqueio com K = 8 segmentos num grid 4 × 4, enumerando os segmentos. Perceba que, num grid 4 × 4, não é possível que o botão (3, 3) suceda o botão (1, 1) num padrão de desbloqueio, pois obrigatoriamente o segmento passaria pelo centro do botão (2, 2). Obviamente, nunca é possível também que um botão suceda a si próprio. Neste problema, considere que o dedo do usuário é tão fino quanto necessário para conectar botões que podem teoricamente suceder um ao outro.\n\n                    \n\n\nA UFFS quer agora provar que seu sistema é melhor que o da concorrência, calculando o número de padrões de desbloqueio possíveis com K segmentos.","id":"1584","category":"Grafos","statistics":{"level":"8 / 10","submissions":321,"solved":115,"ratio":"35.83%"}}