{"output":"Imprima na ordem de classificação os times da entrada, um time em cada linha. Não é necessário imprimir nada entre os casos de teste!","input":"Na primeira linha teremos um inteiro T (T ≤ 100), indicando o número de casos de teste.\n                     Na primeira linha de cada caso teremos dois números, N (2 ≤ N ≤ 20* ou 2 ≤ N ≤ 100**) e M (1 ≤ M ≤ 100* ou 1 ≤ M ≤ 1000**), indicando quantos times estão no campeonato e quantos jogos já aconteceram. Nas próximas N linhas teremos os nomes dos times, que são únicos, contendo apenas letras minúsculas do alfabeto. Nas próximas M linhas há a informação dos jogos na seguinte forma: X timeA Y timeB, indicando que o timeA jogou contra o timeB e o primeiro marcou X gols e o segundo Y gols. As strings terão tamanho entre 1 e 20 e o número de gols de um time em cada partida será entre 0 e 100.Um time nunca joga contra ele mesmo, porém ele pode jogar inúmeras vezes contra qualquer outro time. \n                    * ocorrerá em aproximadamente 90% dos casos de teste;\n                    ** ocorrerá no restante dos casos.","level":5,"name":"Ajude a Federação","has_images":false,"description":"A federação de futebol te contratou para elaborar a classificação dos times do campeonato. Você vai receber uma lista com alguns jogos ocorridos e deve ordenar os times. Uma vitória garante 3 pontos ao time, um empate 1 ponto e uma derrota 0 pontos.\n                    Leia atentamente a seguir o regulamento sobre como a classificação deve ser feita: Primeiramente o time com mais pontos deve ficar em primeiro. Caso haja empate, o time com mais vitórias fica na frente. Caso ainda tenha empate, o time com mais gols fica na frente. Por último se nenhum dos critérios acima possa desempatar os times, o que aparecer primeiro na entrada fica na frente.\n                    Dado os times e os jogos que já aconteceram, ordene e imprima o nome dos times na ordem de classificação.","id":"1588","category":"Ad-Hoc","statistics":{"level":"5 / 10","submissions":2081,"solved":745,"ratio":"35.80%"}}