{"output":"Para cada instância imprima uma linha com os jogadores ordenados de acordo com a classificação de Yusuf II. Caso exista mais de uma classificação possível, qualquer uma será aceita. Caso não exista classificação de acordo com o esquema de Yusuf II, imprima  a palavra inclassificavel.","input":"A entrada é composta por diversas instâncias e termina com final de arquivo (EOF).\n\n                    A primeira linha de cada instância contém um inteiro N (2 ≤ N ≤ 1.000) correspondendo ao número de jogadores do torneio. Os jogadores são numerados de 1 a N . Para cada i = 1, . . . , N , a (i + 1)-ésima linha contém um inteiro di ≥ 0 seguido pela identificação dos di jogadores vencidos pelo jogador i.","level":10,"name":"Torneio de Yusuf II","has_images":false,"description":"Marrakech é uma das cidadelas do mundo árabe. A cidade foi fortificada nos anos 1122-1123 por Ali ibn Yusuf, filho de um dos primeiros dirigentes da cidade. Um dos grandes chefes da cidade foi o Califa Abu Yaqub Yusuf ‘al-Mustansir’ também conhecido como Yusuf II. O califa viveu apenas 21 anos (1203-1224) e reinou desde os seus 10 anos. Conhecido como um amante das artes e esportes, foi um grande incentivador da construção de palácios e museus. Idealizou uma grande competição de xadrez, uma de suas paixões, disputada por toda a corte. \n                    O esquema imaginado por Yusuf II para determinar a classificação do campeonato de xadrez era muito interessante. Todos os N competidores jogavam contra todos. Um jogador K é chamado de ملك (malik) se para todo jogador J diferente de K, ou K vence J ou K vence algum jogador J' que vence J. A classificação do campeonato é uma ordenação dos jogadores J1 , J2 , . . . , JN tal que cada jogador Ji , 1 ≤ i < N , vence Ji+1 e é ملك se considerarmos os jogadores que aparecem depois dele na ordenação, isto é, ignorando os anteriores.\n                    Sua tarefa será, dados os resultados dos jogos de um torneio de xadrez em Marrakech, determinar se é possível obter uma classificação de Yusuf II para aquele campeonato.","id":"1596","category":"Paradigmas","statistics":{"level":"10 / 10","submissions":67,"solved":1,"ratio":"1.49%"}}