{"output":"Para cada instância, imprima em uma única linha o valor mínimo de um circuito do tapete, onde esse valor é a razão entre a quantidade de fio dividida pelo número de nós no circuito. O valor deve ser impresso com 3 casas decimais. Imprima -1, caso não exista circuito no tapete.","input":"A entrada é composta por diversas instâncias e termina com final de arquivo (EOF).\n\n                    A primeira linha de cada instância contém dois inteiros, N (3 ≤ N ≤ 1.000) e M (N ≤ M ≤ N × N − 1), correspondendo aos números de nós e ligações, respectivamente. Os nós são numerados de 1 a N. Seguem M linhas, cada uma com três inteiros u, v e c (0 ≤ c ≤ 1.000) descrevendo uma ligação do nó u para o nó v usando c cm de fio.","level":10,"name":"O Verdadeiro Valor dos Tapetes","has_images":false,"description":"Os tapetes árabes são muito conhecidos. Sua qualidade é reconhecida em todo o mundo, e as características de um bom tapete são apreciadas por todos. Avaliar os tapetes é uma tarefa muito difícil, e os especialistas analisam suas características minuciosamente para estabelecer um preço adequado. Os tapetes são formados por pontos, onde os fios são amarrados. Apesar de ser muito difícil para uma pessoa comum, os especialistas são capazes de dizer a direção em que o fio foi amarrado entre dois pontos. Estes fios formam circuitos nos nós e padrões complicados têm centenas ou mesmo milhares de circuitos e são muito intrincados. Circuitos grandes (em que a quantidade de fio dividida pelo número de nós é muito grande) desvalorizam o tapete, pois o torna menos resistente. Circuitos pequenos são valorizados, e o avaliador sempre busca encontrar o menor circuito existente no tapete, pois este é um indicador do valor do tapete. Sua tarefa neste exercício é ler os dados de um tapete com N nós e M fios (ligações entre estes nós em que a direção em que foi feita é determinada) e determinar o valor do menor circuito do tapete, ou seja, o circuito em que a razão entre a quantidade de fio dividida pelo número de nós é mínimo.","id":"1598","category":"Paradigmas","statistics":{"level":"10 / 10","submissions":65,"solved":17,"ratio":"26.15%"}}