{"output":"Para cada instância imprima uma única linha. Caso seja possível empurrar o bloco para a sua posição final essa linha deverá consistir de 2 inteiros, que são o número mínimo de portas que precisam ser abertas para realizar tal ação e o número mínimo de movimentos que são necessários com esse número de caixas abertas. Imprima ‘-1’ caso não seja possível empurrar o bloco para a sua posição final.","input":"A entrada é composta por diversas instâncias e termina com final de arquivo (EOF).\n\n                    Cada instância inicia com uma linha contendo 2 inteiros separados por um espaço, N e M (1 ≤ N, M ≤ 25).\n\n                    Seguem-se N linhas, cada uma com M caracteres pertencentes ao conjunto {∗, ., j, b, x, #}, onde:\n\n                    \n                        ‘*’ representa uma parede;\n                        ‘.’ representa uma posição vazia;\n                        ‘j’ representa a posição inicial do gato (Cada instância contêm exatamente um caractere ‘j’);\n                        ‘b’ representa a posição inicial do bloco (Cada instancia contêm exatamente um caractere ‘b’);\n                        ‘x’ representa a posição final desejada para o bloco (Cada instância contêm exatamente um caractere ‘x’);\n                        ‘#’ representa uma porta (Cada instância contêm no máximo 5 caracteres ‘#’);","level":9,"name":"O Gato do Zelador do Armazém","has_images":false,"description":"Sokoban é um jogo muito conhecido. O que poucas pessoas sabem é que o jogo foi inventado pelos bérberes, povos árabes que habitavam o norte da África, mais especificamente onde hoje existe o Marrocos. Para estes povos os gatos são considerados um animal que traz mau agouro, principalmente por conta de seu comportamento egoísta (como atesta o provérbio destacado acima).\n\n                    Nessa versão original do sokoban o personagem é um gato que fica empurrando os blocos de terra ao seu redor. Há um tabuleiro que consiste de N linhas e M colunas. Você controla o gato que pode se movimentar em qualquer uma das 4 casas adjacentes, desde que essa esteja livre, ou pode empurrar um bloco em qualquer uma dessas 4 direções.\n\n                    Como na versão mais conhecida, seu objetivo é empurrar o bloco até uma posição final especificada. Note que você pode apenas empurrar o bloco e nunca puxar.\n\n                    A versão bérbere do jogo tem uma particularidade. Há algumas casas especiais que são portas. Sempre que o gato ocupa uma posição com porta pela primeira vez, a porta é aberta. O bloco não pode ser empurrado para a posição de uma porta se ela estiver fechada. Após aberta, uma porta se comporta como uma posição livre.\n\n                    Você quer empurrar o bloco para a posição final abrindo o menor número de portas possível.\n\n                    Considere toda posição fora do tabuleiro como uma parede.","id":"1600","category":"Paradigmas","statistics":{"level":"9 / 10","submissions":170,"solved":70,"ratio":"41.18%"}}