{"output":"Para cada instância, imprima na primeira linha Y se é possível formar um comitê de pares de conselheiros ou N, caso contrário. Caso seja possível formar um comitê, imprima uma lista de pares de conselheiros, um par por linha. Um par de conselheiros consiste de dois inteiros xi e yi, separados por um espaço, de forma que xi < yi. Além disso, a lista de pares de conselheiros deve estar ordenada de forma crescente por xi. Caso exista mais de uma forma de montar um comitê, imprima a lexicograficamente menor. Note que, quando o representante 1 tem voto sozinho, ele não pertence a nenhum par.","input":"A entrada é composta por diversas instâncias e termina com final de arquivo (EOF).\r\n\r\n                    A primeira linha de cada instância contém um inteiro par N (1 ≤ N <105). As próximas N − 1 linhas contêm 2 inteiros cada uma. A i-ésima linha, dessas N − 1 linhas, contém os representantes x e y (1 ≤ x, y ≤ N) de um trecho de rua sem esquinas.","level":7,"name":"Pair-voting no Conselho de Gueliz","has_images":false,"description":"O bairro de Gueliz em Marrakech é hoje conhecido por ser a parte moderna da cidade, com diversas opções turísticas, restaurantes e bares. Poucos conhecem a formação do bairro, ainda no século XVI. Originalmente o bairro, também conhecido como “Cidade Nova” foi se formando fora da fortaleza (Medina, cidade antiga). O primeiro novo morador ganhou uma autorização oficial da prefeitura para construir sua casa, e ficou responsável por dar novas autorizações. Quando uma rua foi aberta, um habitante do fim da rua (até a primeira esquina formada) foi designado representante da rua juntamente com o primeiro morador. E assim ocorreu para todas as ruas da cidade: os moradores das esquinas eram representantes das ruas que se encontravam naquela esquina, de forma que cada trecho de rua sem esquinas tem exatamente dois representantes. Há em Gueliz uma lenda que impede a formação de quarteirões (conjunto de casas cercadas por ruas). Os antigos contam que uma vez formaram um quarteirão no bairro, e quando uma pessoa má morreu seu espírito ficou ali preso para sempre, assombrando as pessoas que ali moravam. Desde então nunca mais se formaram quarteirões no bairro.\r\n\r\n                    O conselho do bairro de Gueliz é formado pelo primeiro morador e os representantes de cada rua. Estes representantes formam comitês para analisar as diversas questões. Nos comitês os conselheiros são agrupados em pares, e todos os conselheiros devem participar de exatamente um par. Cada par tem um único voto e a moção é aprovada quando atinge maioria dos votos. Cada par deve ser formado por conselheiros representantes de ruas que se encontram em alguma esquina (ou pelo primeiro morador e o representante de sua rua). Claramente, quando o número de conselheiros é ímpar não é possível encontrar uma composição dos comitês de que participem todos os conselheiros. Quando isso ocorria, o primeiro morador tinha um voto sozinho, e os demais deveriam ser divididos em pares.\r\n\r\n                    Entretanto, com o passar do tempo houve ocasiões em que não foi possível montar um comitê, o que sempre foi motivo de desconfiança entre os moradores de Gueliz. Sua tarefa neste exercício é dado N o número de representantes de rua (o representante 1 é o primeiro morador) decidir se é possível formar um comitê de pares de conselheiros conforme descrito acima.","id":"1604","category":"Paradigmas","statistics":{"level":"7 / 10","submissions":87,"solved":46,"ratio":"52.87%"}}