{"output":"Para cada instância imprima uma linha contendo um número com 2 casas decimais, que é o número esperado de lotes que o comprador precisa comprar para completar sua cáfila.","input":"A entrada é composta por diversas instâncias e termina com final de arquivo (EOF).\n\n                    Cada instância consiste de 3 linhas, cada uma contendo 2 inteiros. Na primeira linha temos N1 e N2 (1 ≤ Ni ≤ 50). A segunda linha consiste de M1 e M2 (0 ≤ Mi ≤ Ni), enquanto que a terceira linha temos W1 e W2 (1 ≤ W2 ≤ W1 ≤ 100), que dão as probabilidades de cada categoria através da realção:","level":2,"name":"Montando Sua Própria Cáfila","has_images":true,"description":"Camelos foram domesticados e são utilizados pelos povos beduínos há vários milênios. Há dois tipos principais, os camelos bactrianos, com 2 corcovas, que são mais raros, e os dromedários, mais comuns, com apenas uma corcova. Para simplificar, os camelos bactrianos são chamados apenas de camelos.\n\n                    Tanto camelos quanto dromedários têm diferentes características interessantes: alguns são líderes natos, outros têm mais força, outros suportam caminhadas mais longas, etc. No entanto, cada animal possui apenas uma dessas características. Uma caravana precisa de animais com várias dessas características. No comércio desses animais são consideradas N1 características diferentes para dromedários e N2 características diferentes para camelos.\n\n                    Os beduínos comercializam esses animais sempre em cáfilas formadas por grupos de três. Essa é uma tradição bérbere que remonta ao século IX, quando os comerciantes de camelos e dromedários só podiam vender seus animais dessa forma. Os compradores não podem escolher os animais. Os lotes de 3 animais são preparados pelo vendedor e o comprador pode apenas dizer o número do lote que deseja comprar, sem mais informações a respeito. Os comerciantes são conhecidos por sua extrema honestidade, e cada lote é formado de forma aleatória. Para cada animal do lote, o comerciante sorteia com probabilidade p1 se será um dromedário e com probabilidade p2 = 1 − p1 se será um camelo, p1 ≥ p2 . Escolhido o tipo i de animal, é escolhida uma característica dentre as Ni, com igual probabilidade, e um animal com essa característica é incluído no lote.\n\n                    Todos os sorteios do comerciante são independentes, podendo um lote conter dois dromedários fortes e um camelo líder, por exemplo, ou mesmo três camelos bons de caminhada. Entretanto, para atestar sua honestidade, sempre que o comerciante produz um lote que tem apenas dromedários ele faz um novo sorteio.\n\n                    Dentre as N1 características para dromedários, há M1 que são desejáveis para o comprador. E dentre as N2 características para camelos, há M2 que são desejáveis para o comprador. Qual o número esperado de lotes que um comprador deve adquirir para montar uma cáfila que tenha dromedários e camelos com todas as M1 e M2 características desejadas?","id":"1605","category":"Paradigmas","statistics":{"level":"2 / 10","submissions":27,"solved":18,"ratio":"66.67%"}}