{"output":"Para cada instância, imprima uma única linha com a permutação que originou a sequência da entrada, com um espaço separando inteiros consecutivos. Caso exista mais de uma permutação possível, qualquer uma delas será aceita.","input":"A entrada é composta por diversas instâncias e termina com final de arquivo (EOF).\n\n                    A primeira linha de cada instância contém os inteiros K (2 ≤ K ≤ 10 5) e N (1 ≤ N ≤ K) indicando, respectivamente, o tamanho da sequência escrita por Ali Babá e o maior inteiro da permutação original. A linha seguinte contém os K inteiros da sequência, separados por um espaço.","level":3,"name":"As Dicas de Ali Babá","has_images":false,"description":"As Mil e Uma Noites são uma coleção de histórias árabes que remontam ao século IX. Algumas traduções para o ocidente foram feitas a partir do século XVII, e algumas destas histórias, como \"Simbad, o Marujo\", \"Aladim e a Lâmpada Mágica\" e \"Ali Babá e os Quarenta Ladrões\" são hoje conhecidas por crianças de todo o mundo. Na história de Ali Babá os tesouros são guardados em uma gruta que se abre quando a expressão \"Abre-te Sésamo\" é usada. Na verdade, o tesouro estava escondido dentro de um cofre na parede da gruta, que se abria quando uma permutação dos inteiros de 1 a N era recitada. Nem todos os 40 ladrões tinham boa memória, assim Ali Babá era obrigado a manter nas paredes da gruta, dicas de como reconstruir a permutação, caso algum dos ladrões a esquecesse. Ele anotava uma sequência de inteiros a1, a2, ... , ak gerada a partir da permutação que abria o cofre após possíveis aplicações das seguintes operações: duplicação (i, j) e espelhamento (i, j), para i ≤ j. A operação duplicação (i, j) cria uma cópia da subsequência ai, ai+1, ... , aj e a insere entre aj e aj+1. A operação espelhamento (i, j) insere uma cópia invertida da subsequência de ai até aj (aj, aj-1, ... , ai) entre aj e aj+1.\n\n                    Por exemplo, dada a sequência (a1, a2, a3, a4, a5, a6), a aplicação da operação espelhamento (3,5) gera a sequência (a1, a2, a3, a4, a5, a'5, a'4, a'3, a6).\n\n                    Sua tarefa é reconstruir a permutação original.","id":"1606","category":"Paradigmas","statistics":{"level":"3 / 10","submissions":460,"solved":278,"ratio":"60.43%"}}