{"output":"Para cada caso de teste, a saída deverá ser uma linha contendo um único inteiro – o número de minutos que o caminhão precisará para ir de DeTI até DeOT e voltar. (Considere que o tempo que o caminhão fique em DeOT seja desprezível). Se não houver solução, escreva “Pernoite.”.","input":"A entrada conterá vários casos de testes. Cada caso de teste iniciará com um inteiro N (2 ≤ N ≤ 100) indicando o número de cidades. DeTI é a cidade de número 1, e a DeOT é a cidade N. A próxima linha conterá um inteiro M representando o número de estradas/rodovias. As próximas M linhas descreverão as M estradas/rodovias. Cada linha conterá 3 inteiros, ou seja, as duas cidades conectados por uma estrada/rodovia e o tempo necessário para percorrer a distância entre elas (em minutos). Nenhuma estrada/rodovia levará mais do que 1000m ou menos que 1m. Cada estrada/rodovia se conectará a duas diferentes cidades. Nenhum par de cidades será diretamente conectado por mais do que uma estrada/rodovia. O último caso de teste será seguido por uma linha contendo o número 0.","level":7,"name":"Caminho Seguro","has_images":false,"description":"Você, um Tenente especializado em computação, foi designado para ajudar o Coronel Rambo que por ser italiano, prefere ser chamado de Ramboni. Ramboni é o bravo comandante das tropas aliadas, que luta para manter a ordem na região das Algarias.\n\n                    Para executar as missões, as tropas precisam se alimentar bem e com regularidade. Para isso, diariamente um caminhão sai do quartel, na cidade DeTI e viaja alguns quilômetros passando por várias cidades até chegar ao destino, na cidade DeOT, onde tem comida farta. Entretanto, nos últimos dias, começaram a ocorrer ataques ao caminhão para roubar o carregamento.\n\n                    Diante deste cenário crítico, o Coronel Ramboni elaborou um plano. O caminhão deveria ir por um caminho e voltar por outro caminho totalmente diferente do caminho de ida. Sendo que o caminhão não pode passar pela mesma rodovia/estrada duas vezes. Caso não seja possível essa possibilidade, o caminhão deve ficar no destino para voltar apenas no outro dia. O incansável Coronel Ramboni pediu uma coisinha a mais: temos que ser rápidos, pois a tropa não pode ficar com fome.","id":"1617","category":"Grafos","statistics":{"level":"7 / 10","submissions":191,"solved":76,"ratio":"39.79%"}}