{"output":"Para cada caso de teste, imprima uma linha contendo um inteiro, indicando o número de palavras distintas que esta nova língua terá. E imprimirá “descartado” caso o número de palavras ultrapasse o valor de T.","input":"Haverá diversos casos de teste. Cada caso de teste inicia com dois números inteiros N e Q (1 < N ≤ 100000, 1 ≤ Q < N), indicando o tamanho do alfabeto e o número de caracteres do alfabeto que será considerado na repetição que pode ocorrer em qualquer parte da palavra, respectivamente. A segunda linha é composta por um inteiro T( 1 ≤ 105000) indicando o número máximo de palavras permitido por idioma.\n\n                    O último caso de teste é indicado quando N = Q = 0, o qual não deverá ser processado.","level":8,"name":"Linguagem","has_images":false,"description":"Germanio um guerreiro intergaláctico e conquistador de planetas tem uma dificuldade para falar quando ele fica nervoso, ele fica um pouco gago. Então, palavras como QUERO, ele fala QQUERO, VAMOS, ele fala VVAMOS e assim por diante.\n\n                    Aborrecido com esta situação, Germanio decidiu que toda nova conquista de um novo planeta ele iria inventar uma nova língua. Dado um alfabeto, onde não ocorre repetição de caracteres, por exemplo, QABCDEFG, todas as palavras da nova língua começariam com a letra Q duas vezes. Neste caso, a palavra QQABCDEFG seria válida.\n                    \n                    Você analisou o caso, e ainda fez a sugestão para que os caracteres a serem repetidos possam ocorrer em qualquer parte da nova palavra desde que sejam na mesma ordem e sempre juntos. No exemplo dado, ABCDEFGQQ seria válido também.\n                    \n                    O amado guerreiro Germanio gostou de sua ideia e pediu para você calcular quantas palavras estes novos idiomas terão. Mas, se o idioma tiver um número muito grande de palavras ele quer descartar este idioma.","id":"1623","category":"Matemática","statistics":{"level":"8 / 10","submissions":1046,"solved":222,"ratio":"21.22%"}}