{"output":"Em cada linha deverá ser impresso o tamanho da menor esteira para produzir todos os conjuntos de robocopiadores, com precisão de 10 casas decimais.","input":"A entrada é composta por vários casos de testes.\n\n                    A primeira linha é composta de um inteiro N (1 ≤ N ≤ 10000) que representa o número de casos de testes.\n\n                    Cada caso de teste é composto por um número inteiro C (1 ≤ C ≤ 100) indicando o número de conjuntos de robocopiadores fabricados. Cada conjunto é composto por um número inteiro c (1 ≤ c ≤ 10000) representando o número de robocopiadores do conjunto, seguido de c linhas de números inteiros, indicando a coordenada -100000 ≤ (x, y) ≤ 100000 de cada robocopiador do conjunto.","level":10,"name":"Robocopia","has_images":true,"description":"Robocopiadores são pequeninos drones que uma vez ativados copiam o movimento de rotação uns dos outros. Quando um drone é ativado junto com outros, eles trabalham em conjunto, como se fossem um só.\n\n                    Recentemente Daniel comprou uma fábrica de robocopiadores. Um braço mecânico coloca cada ropocobiador aleatoriamente em uma área, formando assim um conjunto de robocopiadores. Cada conjunto pode ser de composto por números diferentes de robocopiadores. E para testá-los, eles são ativados. Os robocopiadores ativados devem passar por uma esteira para posteriormente serem desativados e armazenados. Vários conjuntos de rodocopiadores podem passar pela mesma esteira. A largura da esteira deve ser sempre a menor possível, mas que comporte todos os conjuntos.\n\n                    Como Daniel é um empresário inexperiente, não fez um planejamento adequado e então teve de contratar funcionários adicionais para verificar manualmente qual o tamanho da esteira que ele tem de configurar para suportar os diferentes conjuntos de robocopiadores. E claro, este processo é muito custoso e demorado.\n\n                    Para diminuir os gastos e aumentar a eficiência, Daniel contratou você para calcular, de maneira automática, qual a menor largura da esteira para que todos os conjuntos de robocopiadores possam ser armazenados corretamente.\n\n\n\n                    \n                    Figure 1.\n                    \n\n                    \n                                               \n                    \n                    Figure 2.\n                    \n\n                    \n\n\n                    Na Figura 1, por exemplo, a máquina ativou 3 robocopiadores (A,B e C) e a menor distância é a = 2, entre BC. Quando a máquina fizer o outro conjunto de robocopiadores (A,B,C e D) da Figura 2, a menor distância é AB ou DC, b = 3, e neste caso, o conjunto tem de ser rotacionado 90 graus para passar na esteira, que tem tamanho 3. Logo, se estes conjuntos fossem passar pela esteira, esta teria que ter uma largura mínima de 3.","id":"1625","category":"Matemática","statistics":{"level":"10 / 10","submissions":180,"solved":2,"ratio":"1.11%"}}