{"output":"Para cada inteiro N lido, imprima uma linha contendo dois valores: a soma dos divisores de N! distintos de N! e o próprio N!. Como ambos os valores podem ser muito grandes, imprima apenas o resto que deixam por 109 + 7.","input":"Cada linha da entrada é constituída de um único inteiro N (2 ≤ N ≤ 105). A entrada termina em fim de arquivo (EOF).","level":10,"name":"Maratona All FACE","has_images":false,"description":"As universidades da região brasileira conhecida como Fronteira Sul participam da Maratona de Programação há muitos anos, revezando a sede da Etapa Regional especialmente entre as cidades de Erechim, no Rio Grande do Sul, e Chapecó, em Santa Catarina. Desde o ano passado, nossa sede tem sido a 2ª maior do país. Neste ano de 2014, participaram 34 times de 12 escolas na UNOCHAPECÓ, em Chapecó. As instituições envolvidas na organização do evento — em especial a UNOCHAPECÓ, a UNOESC, a URI e a recém-criada UFFS — acreditam que as competições de Programação são um dos principais meios para fortalecer a cultura de Programação, promovendo independência e inovação científica e tecnológica e maior relevância da Região no cenário nacional.\n\n                    Após a cerimônia de premiação da Etapa Regional deste ano, estudantes e professores das instituições supracitadas foram a um rodízio de pizza com dois objetivos: 1. matar a fome; 2. conversar sobre a organização da Maratona de Programação da Feira de Conhecimento, Cultura e Educação (FACE) de Chapecó, que aconteceria dali duas semanas. Durante a discussão, contudo, um dos professores propôs: “Por que não realizamos uma Maratona aqui mesmo, não de Programação, mas de pizza? Quem comer menos pizza paga uma rodada de cerveja para todos!”. Todos concordaram, e assim aconteceu a 1ª Maratona All FACE. O perdedor, contudo, quis a princípio se esquivar de pagar a cerveja. “Só pago se alguém for capaz de me dizer um número perfeito que seja também um fatorial”, disse ele. “6”, respondeu um outro estudante mais que depressa.\n\n                    Será que existe algum outro número perfeito que também seja fatorial? É claro que não, mas o perdedor, indignado por pagar cerveja para todos, resolveu fazer um programa para se convencer. Lembrando: um inteiro positivo M é dito perfeito se é igual à soma de todos os seus divisores distintos de M (por exemplo, 6 = 1 + 2 + 3 e 28 = 1 + 2 + 4 + 7 + 14), e dito um fatorial se existe um natural N tal que N! = M.","id":"1626","category":"Matemática","statistics":{"level":"10 / 10","submissions":444,"solved":79,"ratio":"17.79%"}}