{"output":"Para cada caso de teste, imprima uma linha contendo um único inteiro representando o número máximo de movimentos que o jogador deve fazer para xecar o rei usando uma só peça e se livrar de virar a dose de tequila. Se o número não for finito, imprima “INF” (sem as aspas).","input":"A entrada é composta por vários casos de teste, sendo cada caso de teste composto por 3 linhas. Na primeira linha figura um único inteiro positivo N, o qual representa o número de peças brancas que o dealer pôs no tabuleiro. A segunda linha descreve as N peças brancas, seguindo a Notação Algébrica¹ do Xadrez. A terceira linha, por fim, indica a posição do rei preto. A entrada é finalizada quando N = 0.","level":10,"name":"ChessGuess","has_images":true,"description":"Um novo jogo virou a maior sensação na Nlogônia. Batizado de ChessGuess, este jogo baseado no xadrez é definido pelas seguintes regras, as quais compõem o Manifesto do ChessGuess:\n\n                    \n                    \tO ChessGuess pode ser jogado por qualquer número de jogadores maior que 1, sendo um deles escolhido pelo grupo para ser o dealer.\n                    \tEm cada rodada, o dealer prepara um tabuleiro de xadrez com qualquer número positivo de peças brancas e um único rei preto, desde que nenhum rei branco seja colocado no tabuleiro. O número de peças de cada tipo não é limitado como no xadrez tradicional, ou seja, podem ser colocados, por exemplo, 63 peões brancos e 1 rei preto sem problemas.\n                    \tApós preparar o tabuleiro duma rodada, o dealer escolhe um dos demais jogadores, de modo que cada jogador, à exceção do próprio dealer, seja escolhido exatamente uma vez.\n                    \tO jogador escolhido deve, então, escolher uma única peça branca e movê-la tantas vezes quantas achar necessário para pôr o rei preto em xeque. Os movimentos das peças obedecem aos movimentos do xadrez tradicional, com a única exceção de que ao peão não é permitido andar duas casas para frente em seu primeiro movimento.\n                    \tSe o jogador for capaz de adivinhar uma escolha ótima, que põe o rei em xeque com o número mínimo de movimentos usando uma só peça, o dealer deve virar uma dose de tequila. Do contrário, quem vira a dose de tequila é o jogador. No exemplo da Figura, 1 é o número máximo de movimentos que o jogador deve fazer para xecar o rei usando uma só peça e se livrar de virar a dose de tequila.\n                    \n\n                    \n\n                    Um problema, porém, está comprometendo o sucesso do novo jogo. Conforme avança a brincadeira, as pessoas vão ficando bastante bêbadas, especialmente o dealer, que já não consegue mais decidir se a escolha feita pelo jogador é ótima ou não. Portanto, a Federação e Associação do ChessGuess Ecológico (FACE) precisa de um programa que, dada a configuração inicial do tabuleiro montada pelo dealer, calcula o número máximo de movimentos que o jogador deve fazer para embebedar o dealer ainda mais.","id":"1628","category":"Grafos","statistics":{"level":"10 / 10","submissions":104,"solved":18,"ratio":"17.31%"}}