{"output":"Para cada caso teste imprima uma linha como o tamanho mínimo de uma codifição da determinada sequência da entrada.","input":"A entrada contém vários casos teste. Cada casos teste inicia com uma linha contendo um inteiro  n, (1 ≤ n ≤ 128). A próxima linha contém os  c1, ..., cn (0 ≤ ci ≤ 10000). A entrada termina com  n = 0.","level":2,"name":"Codificação Gamma de Elias","has_images":false,"description":"O código gamma de Elias é um código simples que pode ser usado para codificar uma sequência de inteiros positivos. Iremos utilizar um código modificado que também é capaz de codificar zeros.Para codificar um inteiro n, faça o seguinte:\n\n\n\tSeja k o numero de bits de n\n\tEscreva k-1 zeros seguido por 1\n\tEscreva n em binário\n\n\nExemplos\n\n\n\n    \n        \n            Número\n            Binário\n            Número de bits\n            Prefixo\n            Código\n        \n    \n    \n        \n            0\n            0\n            1\n            1\n            10\n        \n        \n            1\n            1\n            1\n            1\n            11\n        \n        \n            2\n            10\n            2\n            01\n            0110\n        \n        \n            3\n            11\n            2\n            01\n            0111\n        \n        \n            4\n            100\n            3\n            001\n            001100\n        \n        \n            5\n            101\n            3\n            001\n            001101\n        \n        \n            6\n            110\n            3\n            001\n            001110\n        \n        \n            7\n            111\n            3\n            001\n            001111\n        \n        \n            8\n            1000\n            4\n            0001\n            00011000\n        \n    \n\n\n\nUma sequência de inteiros é codificada escrevendo os códigos dos inteiros individuais da sequência na mesma ordem em que os inteiros aparecem na sequência. O prefixo de k bits a mais, antes da representação binária de cada inteiro, é necessário para poder decodificar os inteiros codificados. Então, quando estiver lendo a codificação de uma sequência de inteiros, se lermos k-1 zeros seguido por um, isso significa que existem k bits seguintes, que são a representação binária do próximo inteiro codificado.\n\nSe quisermos diminuir o tamanho da codificação da sequência de inteiros, pode haver ainda algum espaço para melhorias vamos considerar as duas otimizações seguintes:\n\n\n    Se houver um prefixo que indica os k bits seguintes, mas se não tiver um inteiro na sequência com k bits, podemos usar este prefixo para indicar que seguem k+1 bits. Se já houver um prefixo que indica que seguem k+1 bits, esse prefixo não será mais necessário e poderá ser usado para indicar que seguem k+2 bits, e assim por diante.\n\n    Podemos adiciona um zero a esquerda da representação binária de todos os inteiros na sequência com k bits, que então torna-se inteiros com k+1 bits, e então a primeira otimização pode ser usada. A otimização parece especialmente útil se houver alguns inteiros com k bits, mas muitos inteiros com mais de k bits.\n\n\nQuando estivermos diminuindo o tamanho da codificação da sequência de inteiros, nós apenas devemos ter cuidado sobre quantos inteiros na sequência tem um certo número de bits. Seja ci o número de inteiro na sequência com i bits.\n\nVejamos o seguinte exemplo c1 = 2, c2 = 4, c3 = 0, c4 = 1 (que, por exemplo, poderia corresponder a sequência 2, 1, 3, 8, 0, 2, 3). Com o original código gamma de elias, a codificação da sequência deveria ter tamanho 2 × (1 + 1) + 4 × (2 + 2) + 0 × (3 + 3) + 1 × (4 + 4) = 28. Usando a otimização 1 podemos salvar 1 bit usando o prefixo 001 para o inteiro com 4 bits. Então, poderíamos usar a otimização 2 e adicionar zeros a esquerda do inteiro com 1 bit, fazendo-os usar 2 bits. Então, usamos a otimização 1 e o prefixo 1 para inteiros com 2 bits, prefixo 01 para inteiros com 4 bits, e teremos o novo tamanho de 6 × (1 + 2) + 1 × (2 + 4) = 24.\n\nAmbas otimizações podem ser usadas várias vezes. O objetivo é combinar essas duas otimizações da melhor maneira possível, o que significa que queremos encontrar uma codificação de uma determinada sequência de inteiros que tem um tamanho minímo entre todas as codificações usando a Codificação Gamma de Elias com qualquer combinação dessas duas otimizações.","id":"1637","category":"Paradigmas","statistics":{"level":"2 / 10","submissions":38,"solved":26,"ratio":"68.42%"}}