{"output":"Para cada caso de teste imprima uma linha contendo os custos resultantes de uma escolha ideal do tamanho da porção de alimentos. Imprimir cada valor como uma fração reduzida. Se o resultado for um número inteiro, não imprima o denominador 1. Veja o exemplo de saída para mais detalhes.","input":"O arquivo de entrada contém vários casos de teste. Cada caso de teste começa com uma linha contendo um inteiro N, (1 ≤ N ≤ 1000), que corresponde o número de alunos que comem na cantina. A próxima linha contém o valor de A e B (1 ≤ A, B ​​≤ 10). A terceira linha de cada caso de teste consiste de N inteiros Y1 , ..., Yn (1 ≤ Yi ≤ 100), onde Yi é a quantidade de comida estudante I consome. A entrada é terminada por N=0.\r\n\n\t\t\t\t\tOBS:  Na primeira entrada, o tamanho ideal porção de alimentos é de 4,5. Note que o tamanho da porção de alimento, de 3 renderia um custo menor de 16, o quinto estudante, no entanto, teria que buscar comida 4 vezes.","level":9,"name":"Tamanho da Porção de Comida","has_images":false,"description":"A cantina da universidade não quer nenhum estudante deixe a cantina com fome. Portanto, enquanto um aluno estiver com fome, ele pode obter uma outra porção de comida de graça. A cantina usa um tamanho fixo de porção de alimentos, porque levaria muito tempo para pergunta a um estudante a quantidade de comida que ele quer. Pode acontecer que um aluno não terminar a sua última porção de comida e o restante seja jogado fora.\r\n\r\nPara minimizar os custos, o gerente da cantina quer determinar um tamanho fixo de porção de alimentos S de tal forma que a quantidade de comida que é desperdiçada seja pequena, mas também o número de vezes que os alunos têm de buscar outra porção da comida não seja muito grande. Note que esses dois objetivos podem ser conflitantes:\r\n\r\n\r\n\tAo escolher um tamanho muito pequeno da porção de alimentos, não se desperdiçar comida, mas ao mesmo tempo o número de vezes que os alunos voltam para buscar mais comida é grande.\r\n\tAo escolher um tamanho muito grande da porção de alimentos, pode-se assegurar que cada aluno tem de buscar apenas uma porção, mas, ao mesmo tempo, pode acontecer que uma grande quantidade de comida seja desperdiçada.\r\n\r\n\r\nO gerente da cantina coletou dados sobre quanto cada aluno consome. O problema a ser resolvido pode agora ser formulado matematicamente como se segue: Seja X a quantidade de alimentos que é desperdiçado, e Y o número de vezes que os estudantes vão buscar alimentos. Então, o objetivo é o de minimizar A × X + B x Y, em que A, B ​​são pesos que representam a importância relativa dos dois objetivos em conflito. Note-se que X e Y dependem do tamanho da porção de alimento S e as quantidades de alimentos cada aluno consome. Nós impomos a restrição adicional de que nenhum estudante deveria ter que passar mais de 3 vezes para buscar alimentos.","id":"1638","category":"Ad-Hoc","statistics":{"level":"9 / 10","submissions":127,"solved":28,"ratio":"22.05%"}}