{"output":"Para cada caso de teste imprima uma linha contendo o menor preço por área que se pode conseguir comprando qualquer uma das pizzas no máximo uma vez. Faça um arredondamento desse número na quarta casa decimal, note que você pode combinar um número de cupons de descontos arbitrários: Por uma pizza de custo 10, e dois cupons de desconto de 50 e 20, para esta mesma pizza, você só teria de pagar 10 * 0.8 * 0.5 = 4 (unidades monetárias).","input":"O arquivo de entrada contém diversos casos testes. Cada caso de teste começa com um número m, o número de pizzas Alfredo oferece. A entrada é terminada pelo m = 0.Caso contrário, 1 ≤ m ≤ 15. Logo, segue m linhas descrevendo as pizzas. Cada uma destas seguintes linhas descreve pizza i (1 ≤ i ≤ m) e começa com os três números inteiros pi, ai e ni especificando respectivamente o preço da pizza, sua área e número de cupons de desconto conseguidos ao compra-la, 1 ≤  pi ≤ 10000, 1 ≤ ai ≤ 10000 e 0 ≤ ni < m. Haverá em seguida ni pares de números inteiros xij e yij, que especificam o índice xij (1 ≤ xij ≤ m, xij ≠ i) da pizza que se obtém cupom de desconto e yij (1 ≤ yij ≤ 50) o desconto em termos de porcentagem obtidos ao comprar a pizza xij. Você pode assumir que para cada i o valor de xij é um par distinto.","level":9,"name":"Ajude Bob","has_images":false,"description":"Bob ama Pizzas, mas sempre está sem dinheiro. Certo dia ele lê nos jornais que sua pizzaria favorita, Alfredo's Pizza Restaurant, está realizando uma competição: para a primeira pessoa que lhes disser o menor preço por área, que se pode conseguir ao comprar qualquer uma das pizzas no máximo uma vez, receberá a doação de uma pizza grande.  \"Essa tarefa é fácil!\", pensou Bob, \"Para cada pizza somente presciso calcular a razão de cada preço e o menor quociente será a resposta.\".\n\n                    Infelizmente, o problema é um pouco mais complicado:  Alberto desponibiliza cupons de desconto com a venda de algumas pizzas, para obter outra pizza mais barato, e pior, esses cupons podem ser combinados. As pizzas precisão ser compradas uma após a outra, e não é possivel usar um cupom para ter um desconto retrospectivamente para uma pizza a qual já foi comprada. Você pode ajudar Bob a ser o primeiro a resolver esta tarefa, e ganhar a pizza de graça?","id":"1648","category":"Paradigmas","statistics":{"level":"9 / 10","submissions":160,"solved":52,"ratio":"32.50%"}}