{"output":"Para cada instância, calcule a probabilidade do caminho mais seguro da interseção 1 (o Hotel Palace) até a interseção n (o Honorável Centro Richard J. Daley em Chicago). Você pode supor que exista ao menos um caminho entre as interseções 1 e n.\n\n                    Imprima a probabilidade como uma porcentagem com exatamente 6 dígitos depois da vírgula. O valor precentual será considerado correto se difeir no máximo 10-6 da saída do juíz. Use o formato mostrado abaixo e imprima uma linha por instância.","input":"A entrada é composta de diversas instâncias.\n\n                    A primeira linha de cada instância contém dois inteiros n e m (2 ≤ n ≤ 100 , 1 ≤ m ≤ n*(n-1)/2). n é o número de interseções, m é o número de ruas a ser considerado.\n\n                    As próximas m linhas contém a descrição das ruas. Cada rua é descrita por uma linha contendo 3 inteiros a, b e p (1 ≤ a, b ≤ n , a ≠ b, 1 ≤ p ≤ 100): a e b são dois pontos finais de uma rua e p é a probabilidade dos irmãos Blues conseguirem usar essa rua sem serem pegos. Cada rua pode ser usada nas duas direções. Você pode supor que há no máximo uma rua entre dois pontos finais.\n\n                    A última instância é seguida por um zero.\n                    Obs.: O caminho mais seguro a ser seguido no exemplo de entrada é 1 -> 4 -> 3 -> 5","level":5,"name":"106 Milhas Para Chicago","has_images":false,"description":"No filme \"Os Irmãos Cara de Pau\", o orfanato onde Elwood e Jake foram criados pode ser vendido para o Conselho de Educação se eles não pagarem 5000 dólares em impostos no Gabinete do Assessor do Condado de Cook em Chicago. Depois de dar um show no salão de baile do Hotel Palace para ganhar esses 5000 dólares eles têm de achar um caminho para Chicago. No entanto isso não é fácil e parece que eles estão perseguidos pela polícia, uma banda country e um grupo de nazistas. Mais que isso, eles estão a 106 milhas de Chicago, está escuro e eles estão usando óculos escuros.\n\n                    Como eles estão em uma missão Divina você deve ajudá-los a achar o caminho mais seguro para Chicago. Neste problema o caminho mais seguro é considerado a rota que maximiza a probabilidade deles não serem pegos.","id":"1655","category":"Grafos","statistics":{"level":"5 / 10","submissions":1406,"solved":591,"ratio":"42.03%"}}