{"output":"Para cada palavra a ser corrigida, imprima uma linha com a palavra a ser corrigida seguida de uma das possibilidades abaixo:\n\n                    \n                    \tis correct, (está correta em inglês) se a palavra está no dicionário.\n                    \tis a misspelling of X, (é um erro de soletração de em inglês) onde X significa a palavra similar do dicionário, uma vez que a palavra a ser corrigida não está no dicionário. Como neste caso poderão existir várias possibilidades, escolha a palavra do dicionário que aparece primeiro no conjunto de entrada.\n                    \tis unknown, (é desconhecida em inglês) se os casos 1 e 2 não se aplicam.","input":"A primeira linha do conjunto de entrada contém um número N representando o número de palavras no dicionário (N ≤ 10000). As próximas N linhas contêm as palavras do dicionário. A linha seguinte contém um número inteiro Q (Q ≤ 1000) representando o número de palavras a serem corrigidas. Você pode assumir que cada palavra do conjunto de entrada consiste de 1 a 25 letras minúsculas (de ‘a’ a ‘z’).","level":9,"name":"Corretor Automático de Erros de Soletração","has_images":false,"description":"Certos editores de texto oferecem um mecanismo de correção para palavras que aparentam estar escritas incorretamente.\n\n                    Neste problema, você deve implementar um simples Corretor Automático de Erros de Soletração (Automatic Correction of Misspellings - ACM). ACM corrige os seguintes erros de soletração:\n\n                    \n                    \tUma letra faltando (por exemplo, paso ao invés de passo) ou letras escritas a mais (por exemplo, peasso ao invés de passo).\n                    \tUma letra errada (por exemplo, passu ao invés de passo).\n                    \tOrdem de duas letras adjacentes errada (por exemplo, pasos ao invés de passo).\n                    \n\n                    ACM é baseado em um dicionário de palavras. Quando um texto contem uma palavra que não está no dicionário, ACM tentará substitui-la por uma palavra similar do dicionário. Duas palavras são similares se nós podemos transformar uma palavra em outra seguindo exatamente um dos passos listados acima. Uma palavra desconhecida não é alterada se não existem palavras similares no dicionário.","id":"1657","category":"Ad-Hoc","statistics":{"level":"9 / 10","submissions":190,"solved":78,"ratio":"41.05%"}}