{"output":"Para cada caso de teste, a saída deve conter o número mínimo de entradas que devem ser mantidas para satisfazer os requisitos descritos acima. O processo de recuperação de ano descrito acima deve dar o mesmo resultado para as entradas iniciais do que para as entradas que foram selecionadas para manter na memória.","input":"A entrada consiste de vários casos de teste. Cada caso de teste começa com o número de entradas N no registro, onde 1 ≤ N ≤ 1000. Cada uma das próximas N linhas contém uma entrada.\n\n                    Cada entrada tem o formato \"mm:dd:HH:MM número ±\", sendo \"mm\" o mês, \"dd\" o dia, \"HH\" a hora, \"MM\" os minutos, e o número (tendo 1-16 dígitos) de cada chamada, seguido por \"+\" marcando uma chamada que você quer definitivamente manter ou por \"-\" para marcar as outras chamadas. As entradas vêm diretamente do registro do telefone, ou seja, elas são classificadas por tempo de recepção da chamada correspondente (a última entrada é a mais recente).\n\n                    Você pode assumir que o processo de recuperação descrito acima produz o ano correto de cada chamada.\n\n                    O último caso de teste é demonstrado por um 0.","level":7,"name":"Chamadas Econômicas","has_images":false,"description":"O telefone que você comprou há muito tempo tem uma memória interna que mantém o controle de todas as chamadas que recebe. Ele registra a data (mês e dia) e a hora (hora e minuto) de cada chamada, juntamente com o número de quem liga. Apenas um número limitado de chamadas podem ser registradas (memória ainda era cara naquela época).\n\n                    Você descobre que o registro está quase cheio e, portanto, pretende apagar algumas entradas do registro. Na escolha das entradas para apagar você tem que considerar duas restrições:\n\n                    \n                    \tExistem algumas entradas (importantes) que você deseja manter.\n                    \tVocê deve conseguir recuperar o ano (que o telefone não armazena) de cada chamada que você mantém. O processo de recuperação é descrito abaixo.\n                    \n\n                    Calcule o número mínimo de entradas que devem ser mantidas para satisfazer estes requisitos.\n\n                    Recuperação dos anos\n\n                    Dada uma lista de timestamps (composta de mês, dia, hora e minuto) de chamadas, você descobre o ano de cada chamada pelo seguinte procedimento:\n\n                    \n                    \tA última chamada na lista ocorreu no ano atual.\n                    \tVocê deve comparar seu timestamp T com o timestamp T' da chamada anterior. Se T' < T, você deve assumir que as duas chamadas ocorreram no mesmo ano. Se T' ≥ T, você deve assumir que a chamada anterior ocorreu no ano anterior.\n                    \tVocê deve percorrer a lista de trás para frente e fazer como no item 2. a cada passo.\n                    \n\n                    Nota-se que este procedimento não é o correto de forma geral, mas você pode assumir que é para a entrada que você obtém, e você deve garantir que ele dá o mesmo resultado para um registo encurtado.\n\n                    P.S.: Devido a um erro no software do telefone, nenhuma ligação foi registrada dia 29 de Fevereiro.","id":"1659","category":"Paradigmas","statistics":{"level":"7 / 10","submissions":46,"solved":12,"ratio":"26.09%"}}