{"output":"Retorne uma linha de saída para cada caso de teste. Escreva \"Fail!\" se não há lugar à esquerda na parede onde a pintura poassa ser colocada sem sobrepor outra pintura. Caso contrário, escreva as coordenadas onde o canto inferior esquerdo da pintura deve ser colocado. No caso de haver mais de uma solução, selecione a solução com menor coordenada y, e em caso de empate utilizando a menor coordenada x.\n\n\n                    A seguinte imagem representa o segundo caso de teste:","input":"A primeira linha do ficheiro de entrada contém um número que representa o número de casos de teste a seguir. Cada caso de teste começa com uma linha contendo três números n, w e h. n é o número de quadros já pendurados na parede, w é a largura da parede e h é a altura da parede. As próximas n linhas contêm quatro números inteiros x1, y1, x2, y2 cada (0 ≤ x1 < x2 ≤ w, 0 ≤ y1 < y2 ≤ h); as coordenadas x fornecem a distância para o lado esquerdo da parede, as coordenadas y fornecem a distância até ao fundo da parede. (x1, y1) é a posição do canto inferior esquerdo de uma pintura, (x2, y2) é a posição do canto superior direito. A última linha de cada caso de teste contém as dimensões da próxima pintura para ser colocada, primeiro a sua largura w', então sua altura h' (1 ≤ w' ≤ w, 1 ≤ h ≤ 'h). Você não tem permissão para girar a pintura. Você pode supor que 0 ≤ n ≤ 200 e 1 ≤ w, h ≤ 1000000. Além disso, todas as pinturas já pendurados não se sobrepõem.","level":7,"name":"Decorando a Parede","has_images":true,"description":"Depois de construir sua mansão, o Sr. Rico não ficou satisfeito com as cores de suas paredes. para ele as paredes estão muito brancas. Para mudar isso, ele começou pendurar quadros de sua rara coleção. Mas logo percebeu que é muito difícil encontrar um lugar na parede onde uma pintura possa ser colocada sem sobrepor outra pintura. Agora ele precisa de um programa que informe a ele, onde colocar a próxima pintura sem mover qualquer outra pintura já colocada na parede,(ou informe que isso é impossível). As pinturas tem formato retangular e serão colocadas paralelamente ao lado da parede. Se não houver problemas o Sr. Rico irá lhe recompensar com uma bela recompensa, vá em frente e resolva o problema.","id":"1665","category":"Geometria Computacional","statistics":{"level":"7 / 10","submissions":45,"solved":16,"ratio":"35.56%"}}