{"output":"Para cada caso a saída de teste imprima a base do grafo especificado em uma única linha. Para este fim, imprima os números de todos os nós que são bases na ordem de classificação, separadas por um único caractere de espaço. Se a base estiver vazia, imprima uma linha vazia.","input":"A entrada contém vários casos de teste, cada um dos quais corresponde a um grafo orientado G. Cada um caso de teste inicia-se com um número inteiro v, que denota o número de vértices de G = (V, E), em que cada vértice é identificado por um inteiro no conjunto V = {1, ..., v}. Você pode assumir que v(1 ≤ v ≤ 5000). Isto é seguido por um número e inteiro não negativo e, a partir daí, e pares de vértice identificadores v1W1, ..., veWe, com o significado de que (vi, Wi) ∈ E. Não há outras arestas além das especificadas por estes pares. O último caso de teste é seguido por um zero.","level":9,"name":"A Base de um Grafo","has_images":true,"description":"Usaremos as seguintes definições padrão de teoria dos grafos. Seja V um conjunto finito não vazio e, seus elementos sendo chamados vértices (ou nós). Seja E um subconjunto do produto cartesiano V × V, seus elementos sendo chamado bordas. Então G = (V, E) é chamado um grafo direcionado.\n                    Seja N um inteiro positivo, e P = (e1, ..., en) uma sequência de comprimento N de arestas, e ei ∈ E de modo que ei = (vi, vi +1) para uma seqüência de vértices (v1, ..., vn+1). Então P é caminho de vértice v1 ao vértice vn +1 em G e dizemos que vn +1 é acessível a partir de v1, escrevendo (v1 → vn +1).\n                    Aqui estão algumas novas definições. Um nó v em um grafo G = (V, E) é chamado de sorvedouro, se para cada nó W em G que é acessível a partir de v, v também é acessível a partir de W. A base de um grafo é o subconjunto de todos os nós que são sorvedouros, ou seja, base(G) = {v ∈ V | ∀w ∈ V: (v → W) ⇒ (W → v)}. Você tem que calcular base de certos grafos.","id":"1677","category":"Grafos","statistics":{"level":"9 / 10","submissions":653,"solved":152,"ratio":"23.28%"}}