{"output":"Para cada caso de teste, primeiro apresentar o número do caso (começando com 1 e aumentando sequencialmente). Em seguida, imprima o tempo médio de solução para o conjunto de problemas com dois dígitos à direita do ponto decimal. Siga a descrição de um cronograma de solução que alcança esse tempo médio de solução. Visualiza uma linha para cada problema, na ordem em que foi informado na entrada, que identifica o número do problema, o membro utilizado para resolver (numerado de acordo com a ordem de entrada), o tempo que o membro começou a resolver o problema, e o tempo em que o problema foi resolvido. Siga o formato mostrado no exemplo de saída, e imprima uma linha em branco após cada caso de teste.","input":"Os dados de entrada conterão vários casos de teste. Cada caso de teste começa com uma linha contendo um par de números inteiros m e n. O número m especifica o número de membros da equipe (1 ≤ m  ≤ 3), e n especifica o número de problemas a serem resolvidos (1 ≤ n ≤ 10).\n\n\t\t\t\t\tA próxima linha contém m inteiros positivos informando os valores de inteligência dos membros da equipe m. Em seguida, as n linhas descrevem as compensações de tempo de capacidade para cada um dos n problemas. Cada linha começa com um k inteiro positivo (k ≤ 10), seguido por pares de k inteiros positivos s1 ,t1 , s2 , t2 ,..., sk , tk que satisfazem si  <  si+1 para 1 ≤ i  <  k . O requisito mínimo de inteligência do problema é s1, ou seja, não pode ser resolvido por um membro com menos capacidade intelectual do que este número. Se o problema é resolvido por um membro da equipe com capacidade  s , onde s1 ≤  s  < si+1 para algum  i , então o tempo de solução será t1. Finalmente, se o problema é resolvido por um membro da equipe com capacidade intelectual sk ou mais, então o tempo de execução será tk.\n\n\t\t\t\t\tUm par de zeros será a entrada para o último caso de teste.\n\n\t\t\t\t\tVocê pode assumir que cada problema será resolvido exatamente no tempo especificado para a capacidade informada, independentemente do número de outros problemas que estão sendo resolvidos por outros membros da equipe ao mesmo tempo. Nenhum problema terá um requisito de inteligência maior do que a do membro da equipe mais brilhante.","level":10,"name":"Gerenciamento de Partição Fixa em Competição","has_images":false,"description":"Uma técnica usada em estratégias iniciais de competição de programação envolve particionar a capacidade intelectual disponível de uma equipe por um número de membros, com cada membro tendo uma quantia fixa de inteligência, e diferentes membros potencialmente tendo quantidades diferentes. A soma da capacidade de todos os membros é igual a capacidade intelectual total da equipe.\n\n                Dado um conjunto de problemas, a tarefa da equipe é atribuir os problemas a diferentes membros da equipe, de modo que os problemas possam ser resolvidos simultaneamente. Esta tarefa é difícil devido ao fato de que o tempo para a solução de um problema pode depender da quantidade de informações disponíveis. Todo problema tem um requisito mínimo de inteligência: se a atribuição for para um membro mais brilhante, o tempo de solução pode aumentar ou diminuir.\n\n                Nesta tarefa, você tem que determinar atribuições ideais de problemas aos membros da equipe. O programa informa as capacidades intelectuais dos membros da equipe disponíveis para a solução dos problemas, e uma descrição, para cada problema, de como o tempo de solução depende da quantidade de informação disponível. O programa tem que encontrar um cronograma de solução que minimiza o tempo médio de solução para os problemas. Um cronograma de solução é uma atribuição de problemas aos membros da equipe em relação ao tempo, de tal forma que não há dois problemas que usam o mesmo membro ao mesmo tempo, e não há problema que é atribuído a um membro da equipe com menos capacidade do que o seu requisito mínimo. O tempo para a solução do problema é a diferença entre o tempo em que o problema foi submetido para ser resolvido (o início da competição começa no tempo zero para todos os problemas desta tarefa), e o tempo em que o problema foi resolvido.","id":"1678","category":"Ad-Hoc","statistics":{"level":"10 / 10","submissions":174,"solved":6,"ratio":"3.45%"}}