{"output":"Para cada caso de teste imprima a quantidade de gelo e água, em gramas, e a temperatura final da mistura em graus Celsius. Todos os números devem ser arredondados para um dígito. Adote a saída de exemplo como o formato esperado.","input":"A entrada contém vários casos de teste. Cada caso de teste consiste de quatro números reais mw, mi, tw, ti. A massa de água mw e a massa de gelo mi são ambas não-negativas, dados em gramas, e mw + mi > 0. A temperatura da água tw e a temperatura do gelo ti são informadas na sequencia, ambos em graus Celsius, e você pode assumir que -30 < ti ≤ 0 ≤ tw < 100. O último caso de teste é seguido por quatro zeros.","level":4,"name":"Bebida, com Gelo","has_images":true,"description":"Uma boa bebida é sempre servida com gelo. Dito isto, a quantidade de gelo é o que faz a diferença. Se for muito, a bebida será bem gelada, no entanto, isso é um pouco de fraude já que poderia haver menos gelo (e mais Vodka, por exemplo). Por outro lado, se há muito pouco gelo a bebida fica quente, o que é inaceitável. Você deve ajudar o garçom, é claro que não com a mistura nem com a bebida, mas com o cálculo do resultado esperado de tais misturas.\n\nPara facilitar as coisas, vamos supor que a água pura é misturada com gelo em um sistema fechado, isto é, não há nenhum problema com a temperatura exterior ou o aquecimento da garrafa, etc. Portanto, depois de um algum tempo passou, o sistema pode ser considerado como equilibrado (não há nenhuma outra alteração na temperatura e não há mais derretimento ou congelamento). Sua tarefa é calcular a temperatura final deste sistema balanceado e a quantidade de gelo e de água neste estado de equilíbrio.\n\nComo você conhece da física, é necessário 4.19 Joules para aquecer um grama de água em um Kelvin, enquanto é necessário 2.09 Joules se for gelo. Nós definimos as capacidades cw = 4.19 J/(g*K) e ci = 2,09 J/(g*K). Para derreter um grama de gelo é necessário 335 Joules, onde a temperatura permanece constante em zero. Nós definimos a constante em = 335 J/g. A energia térmica total do gelo e da água antes do experimento são iguais à energia térmica ao final da mistura.\n\nA figura abaixo mostra a energia de um grama de gelo, mistura-gelo-água, ou água, onde a temperatura é medida em relação a -30 graus Celsius. O salto em 0 graus representa o derretimento do gelo para a água. A quantidade de energia obtida é proporcional à quantidade de gelo já derretido.","id":"1679","category":"Geometria Computacional","statistics":{"level":"4 / 10","submissions":64,"solved":39,"ratio":"60.94%"}}