{"output":"Para cada caso de teste gere um desenho PostScript da borda com comandos em linhas separadas. Comece cada desenho nas coordenadas (300, 420) com o comando \"300 420 moveto\". A primeira rotação ocorre em (310, 420) utilizando o comando \"310 420 lineto\". Continue com rotações em sentido horário ou anti-horário de acordo com a string de entrada, usando a sequência \"x y lineto\" de comandos com as coordenadas devidas. Os pontos de rotações são separados por uma distância de 10 unidades. Não se esqueça do último ponto da borda e de terminar cada caso de teste com os comando stroke e showpage.\n                    \n                    Você pode exibir tais desenhos com o interpretador de PostScript gv, opcionalmente depois de uma conversão utilizando o ps2ps.","input":"A entrada contém diversos casos de testes, cada um em uma linha separada. Cada linha contém uma string não vazia de caracteres A e V descrevendo a maior borda da folha. Você pode assumir que o tamanho da string é menor que 200. O aquivo de entrada termina imediatamente após o último caso de teste.","level":4,"name":"Borda","has_images":true,"description":"Para produtos que são embalados em pequenos pacotes é necessário que a folha de instruções de uso seja dobrada até que seu tamanho se torne suficientemente pequeno. Assume-se que uma folha é retangular e só pode ser dobrada ao longo de linhas paralelas à sua menor borda inicial. O ato de dobrar tal linha, contudo, pode ser realizado em duas direções: tanto a superfície superior da folha é dobrada, ou a superfície inferior. Em ambos os casos as duas partes do retângulo que estão separadas pela linha da dobra são dispostas em conjunto e ignora-se qualquer diferença de espessura na folha dobrada resultante.Depois de diversas dobras serem realizadas pode-se desdobrar a folha novamente e observar sua maior curva de forma que pareça uma curva unidimensional, na verdade a junção de segmentos de linhas. Ao se mover por entre essa curva em uma direção fixa pode-se classificar cada ponto em que a folha foi dobrada como um tipo A, uma rotação em sentido horário, ou tipo V, uma rotação em sentido anti-horário. Dadas tais sequências de classificações, produza um desenho da maior borda da folha assumindo rotações de 90 graus em pontos equidistantes.","id":"1680","category":"Ad-Hoc","statistics":{"level":"4 / 10","submissions":200,"solved":148,"ratio":"74.00%"}}