{"output":"Para cada caso de teste, imprima em em uma linha o número mínimo de passos de dobradura necessários para produzir a folha de papel descrita.","input":"A entrada contém vários casos de teste, cada um em uma linha distinta. Cada linha contém uma string não vazia de caracteres A e V descrevendo o lado mais longo da folha. Assuma que o comprimento da string é menor que 200. O arquivo de entrada termina imediatamente após o último caso de teste.","level":2,"name":"Dobra","has_images":false,"description":"Leia a descrição do problema 1680 (Lado) para entender como dobrar uma folha de papel e como interpretar a entrada. Uma \"tira\" é definida como a parte maximal de uma folha que não tem vincos atravessando-a. Como as dobras ocorrem em locais equidistantes, todas as tiras são congruentes.\nNeste problema é dada a descrição do resultado da realização de diversas dobras como no problema E: Lado, ou seja, no estado desdobrado. Adicionalmente, é sabido que o comprimento da folha em seu estado dobrado é exatamente o comprimento de uma tira (novamente a grossura do papel é ignorada).\nEncontre o número mínimo de dobraduras necessárias para gerar a folha descrita a partir de uma folha de papel inicialmente plana. Note que realizar uma dobradura pode criar mais que uma dobra no resultado porque partes do papel estão sobrepostas devido à dobraduras anteriores. No entanto, quando um passo de dobradura é realizado todas as partes sobrepostas do papel são afetadas, isso é, não é permitido dobrar, por exemplo, apenas as três camadas superiores.\nPor último, note que todo resultado pode ser obtido iterando as dobras em uma direção fixa e realizando uma dobradura por vez, acumulando dessa forma uma pilha de todas as tiras, com comprimento de uma tira. Se n é o número de dobras na descrição de entrada, esse procedimento requer então n passos de dobradura, que não é necessariamente o mínimo, como pode ser observado na saída de exemplo.","id":"1681","category":"Paradigmas","statistics":{"level":"2 / 10","submissions":15,"solved":9,"ratio":"60.00%"}}