{"output":"Para cada caso de teste, a saída consiste em Q linhas contendo o vencedor do jogo (considerando que ambos jogam de forma ótima) para cada uma das Q operações sugeridas pelo conselheiro.","input":"A entrada contém vários casos de teste e termina com EOF.\n                    \n                    A primeira linha do teste consiste de dois inteiros N (N <= 1018) e Q (Q <= 105), o número escolhido por Jabba e a quantidade de operações na lista do conselheiro respectivamente.\n\n                    As Q próximas linhas consistirão de 3 inteiros A, B (1 <= A <= B <= N) e K (-A <= K <= 1018) descrevendo as operações escolhidas pelo conselheiro.","level":7,"name":"Nim Intergalático","has_images":false,"description":"Durante sua última visita ao planeta Tatooine, Han Solo foi capturado por mercenários de Jabba, the Hutt e levado ao seu palácio. Jabba, sabendo que Solo não tem dinheiro para pagar sua dívida propôs um acordo. Ambos iriam disputar uma partida de Nim Intergalático e, se Han vencesse sua dívida estaria paga, caso contrário, sua dívida seria duplicada.\n\n                    O Nim Intergalático é uma variação do conhecido jogo de Nim, onde pedras são arrumadas em colunas e em cada rodada um jogador tem que remover uma ou mais pedras de uma das colunas. O jogador que não puder realizar mais movimentos é considerado o perdedor. No caso do Nim Intergalático um dos jogadores (nesse caso Jabba) escolhe um número N (N <= 10^18) e as pedras são colocadas em N colunas sendo que a i-ésima coluna contém i pedras (primeira coluna com 1 pedra, segunda coluna com 2 pedras, e assim por diante).\n\n                    Tendo vasto conhecimento sobre esse tipo de jogos, e sabendo que quem faz o primeiro movimento (nesse caso Jabba) tem maior chance de ganhar, Han sugeriu uma pequena modificação no jogo. Ele poderia escolher três inteiros A, B e K e adicionar K pedras a todas as colunas entre A e B inclusive. Jabba aceitou sua proposta mas com uma limitação: o conselheiro de Jabba vai considerar Q possíveis operações deste tipo e Solo deve aplicar cada uma destas operações independentemente ao jogo original. Como Han não está acompanhado de seu fiel companheiro Chewbacca (que costuma ajuda-lo nessas situações), ele pediu para você ajuda-lo a vencer Jabba.","id":"1688","category":"Matemática","statistics":{"level":"7 / 10","submissions":108,"solved":42,"ratio":"38.89%"}}