{"output":"Para cada caso teste imprima uma única linha com \"Case #A: B\" onde A é o número do caso teste (começando de 1) e B é o menor P possível de forma que o nível ainda seja possível de ser completado. B deve ser arredondado para 4 dígitos após o ponto decimal. A entrada será de tal forma que erros até 10-5 ainda darão a resposta correta.","input":"A primeira linha contém T (T ≤ 100) – o número de casos teste. Após essa linha, haverá T casos teste. A primeira linha de um caso teste contém um inteiro N (1 ≤ N ≤ 104) – o número de conjuntos de paredes. As próximas N linhas contém a descrição de um conjunto de paredes da seguinte forma: Primeiro o número K (0 ≤ K ≤ 10) – o número de paredes que esse conjunto possui. Após isso, K tuplas de números de ponto flutuante da seguinte forma: X,Y (0 ≤ X, Y < 2π) – A parede começa no ângulo X e estende ao longo da circunferência em sentido horário até o ângulo Y. Paredes do mesmo conjunto nunca se intersectam. Nenhum dos conjuntos será uma circunferência completa. Quando o jogo começa, o primeiro conjunto atinge o centro após P segundos e o ponto preto pode começar em qualquer posição.\n\n                    A figura acima ilustra o primeiro teste de exemplo.","level":9,"name":"Super Circunferência","has_images":true,"description":"Skyrk desenvolveu um jogo chamado Super Circunferência. Sua simplicidade é contrastada por sua grande dificuldade. O objetivo de Super Circunferência é controlar um ponto que se desloca ao redor uma circunferência central tentando evitar contato com as paredes circulares que se aproximam.\n\n                    \n\n                    O ponto preto circula ao redor da circunferência vermelha a uma velocidade de uma revolução completa por segundo. Um nível tem vários conjuntos de paredes circulares que se aproximam, com as quais o ponto deve evitar o contato. Uma parede se aproximando pode ser interpretada como um setor de uma circunferência. O conjunto de paredes se aproxima do centro na velocidade de um conjunto a cada P segundos. O jogador consegue vencer se ele desviar de todas as paredes com sucesso.\n\n                    Um novo nível foi criado com N conjuntos de paredes. Para ajustar a sua dificuldade corretamente, você deve encontrar o menor valor de P que ainda torne o nível possível de ser completado.","id":"1691","category":"Ad-Hoc","statistics":{"level":"9 / 10","submissions":29,"solved":8,"ratio":"27.59%"}}