{"output":"Imprimir se existe, o número máximo de servidores infectados. Caso contrário, você deve imprimir \"Impossible Revenge!\".","input":"Existem vários testes, a primeira linha de cada teste contém dois inteiros N e K --- Número de servidores na rede e o Kuro-number (2 ≤ K <N ≤ 1000). As próxima N - 1 linhas contém a descrição dos N - 1 fios dessa rede --- Cada linha contém um par (u, v) significa que há uma conexão entre o servidor u e o servidor v (1 ≤ u, v ≤ N).","level":10,"name":"Curo Ataque","has_images":false,"description":"Uma nova rede universitária é composta por N servidores distribuídos em todo o campus , cada par de servidor é ligado por um caminho único feito de fios e são N - 1 fios ao todo, mas o Departamento de Informática esqueceu de atribuir os servidores para o instituto de matemática.\n\n                Um estudante de matemática preguiçoso, chamado Curo , está se sentindo ressentido, porque agora ele não pode executar seus programas em uma máquina poderosa. Então , ele decidiu implantar um vírus, feito por ele durante seu tempo livre, porque ele odeia seus cursos de matemática e prefere codificar algo mais divertido, ao invés de escrever números e símbolos intediantes.\n\n                Curo quer infectar o número máximo de servidores e ter sua vingança contra o departamento de Informática. Ele preparou uma simulação do ataque, mas seu computador não é poderoso o suficiente para executá-lo . Assim, ele precisa de sua ajuda para esta tarefa, mas primeiro você tem que saber como o vírus funciona.\n\n                Se o vírus infectar um servidor, os servidores adjacentes serão infectados também. Além disso, o programa tem uma variável pseudo-aleatória chamada Kuro-number. \n\n                No final do processo de infecção, a maior distância entre dois servidores infectados deve ser o Kuro-number.\n\n                Dada uma rede de computadores e um Kuro-number você deve obter, se existe, o número máximo de servidores infectados, caso contrário, você deve imprimir \"Impossible Revenge!\"","id":"1692","category":"Grafos","statistics":{"level":"10 / 10","submissions":258,"solved":32,"ratio":"12.40%"}}