{"output":"Para cada caso de teste imprima uma única linha contendo as respostas para as perguntas na ordem em que aparecem na entrada, cada resposta deve ser seguida por um único espaço (mesmo para a última consulta).","input":"A primeira linha contém um número inteiro T (1 ≤ T ≤ 35), o número de casos de teste.\n\n                    A primeira linha de cada caso de teste contém dois inteiros N e M (1 ≤ N, M ≤ 105), o número de vértices e o número de consultas, respectivamente.\n\n                    Vamos supor que os vértices das árvores são identificados por inteiros de 1 a N, e que a raiz da árvore é o vértice 1. A próxima linha contém uma seqüência de números inteiros V1, V2, ..., VN (1 ≤ Vi ≤ 109), os valores de cada vértice.\n\n                    Cada uma das próximas N - 1 linhas contém dois inteiros Ai e Bi (1 ≤ Ai, Bi ≤ N), os pares de vértices conectados por uma aresta na árvore. A árvore é conectada e válida.\n\n                    As próximas M linhas contêm as consultas, cada linha contendo dois inteiros X e K (1 ≤ X, Ki ≤ N), que é, encontrar o K-ésimo menor valor na subárvore com raiz em X. É garantido que cada consulta é válida.","level":9,"name":"Ordenando Árvores","has_images":false,"description":"É sabido que o Conde de Limãograb é o cara mais estranho no reino doce, mas a sua mais recente obsessão foi longe demais: ele está tentando descobrir a ordem de todas as coisas!\n\n                    Até agora ele tem tido sucesso em um monte de problemas de ordenação, mas ele está ficando louco, porque ele encontrou um problema que não pode resolver: dada uma árvore com raiz que consiste de N vértices, onde cada vértice i tem um valor Vi, ele tentou descobrir a ordem crescente de todos os valores na subárvore com raiz no vértice X.\n\n                    Ele resolveu facilmente para algumas sub-árvores, mas depois ele se cansou e notou que ninguém seria capaz de realizar essa tarefa em curto espaço de tempo. A fim de aliviar sua frustração, ele pediu-lhe para responder a M consultas: para um dado vértice X lhe dizer qual é o K-ésimo menor valor da subárvore com raiz no vértice X.","id":"1695","category":"Grafos","statistics":{"level":"9 / 10","submissions":135,"solved":56,"ratio":"41.48%"}}