{"output":"Para cada caso de teste imprima em uma única linha o tamanho do maior par de antenas, de mesmo tamanho, que\n                    podem ser construídas utilizando qualquer número de palitos.","input":"A entrada é composta de diversas instâncias.\n\n                    A primeira linha de cada instância contém um inteiro N ( 1 <= N <= 1000 ), o número de palitos encontrados.\n\n                    A segunda linha de cada instância contém uma sequência de N inteiros, S1, ..., Sn, onde Si (1 <= Si <= 100)\n                    é o tamanho do iésimo palito encontrado por Joãozinho.\n\n                    O final da entrada é sinalizado por um caso com N = 0. Que não deve ser processado.","level":9,"name":"Antenas","has_images":false,"description":"A professora do jardim de infância pediu como tarefa de casa que a turma montasse um robô utilizando apenas palitos de dente e cola. Joãozinho decidiu que para diferenciar seu robô dos robôs dos demais alunos, ele faria as antenas de seu robô do maior tamanho possível. Quando Joãozinho estava montando seu robô, os palitos acabaram, exatamente quando faltava apenas montar as duas antenas, e como já era tarde, não havia como comprar mais palitos. Joãozinho quebrou sua cabeça pensando numa forma de terminar seu robô, até que se lembrou que seu vizinho, seu Zé, era dono de um bar, e talvez pudesse lhe arrumar alguns palitos.\n\n                    Infelizmente Joãozinho não estava no seu dia de sorte, quando ele chegou no bar, seu Zé lhe disse que também estava sem palitos, e os únicos palitos que haviam no bar, eram os palitos usados pelos clientes do dia, que estavam esparramados pelo chão do bar, e muitos deles sujos e quebrados. Mas, como Joãozinho é um menino bastante insistente e um pouco porquinho, ele resolveu que iria usar esses palitos mesmo, e combinou com seu Zé que varreria o chão do bar em troca de todos os palitos que encontrasse. \n\n                     Como já era madrugada quando Joãozinho acabou de varrer o chão ele pediu a sua ajuda para determinar qual o maior par de antenas, de mesmo tamanho, que poderia ser montado.\n\n                    Dado o número N de palitos encontrados por Joãozinho e o tamanho de cada um desses palitos, determine o tamanho do maior par de antenas, de mesmo tamanho, que podem ser montadas colando qualquer número de palitos pelas suas extremidades.","id":"1700","category":"Paradigmas","statistics":{"level":"9 / 10","submissions":999,"solved":198,"ratio":"19.82%"}}