{"output":"Para cada caso de teste, dê como saída o valor final do acumulador em representação binária, novamente: bits mais significativos primeiro.","input":"O arquivo de entrada contém vários casos de teste. Cada caso de teste especifica o conteúdo da memória antes da execução do programa. Byte 0 a 31 são dadas em linhas separadas em representação binária. Um byte é indicado por seus bits mais e menos significativos. A entrada é terminada por EOF.","level":8,"name":"Computadores Simples","has_images":false,"description":"Você escreverá um interpretador para um computador simples. Este computador usa um processador com um pequeno número de instruções de máquina. Além disso, é equipado com 32 bytes de memória, um acumulador de 8 bits (accu) e um contador de programa de 5 bits (pc). A memória contém dados, bem como código, que é a arquitetura habitual de von Neumann. \n\n                    O contador de programa contém o endereço da instrução a ser executada em seguida. Cada instrução tem um comprimento de 1 byte - os 3 bits mais significativos (bits mais a esquerda) definem o tipo de instrução e os 5 bits menos significativos definem um operando opcional que é sempre um endereço de memória (xxxxx). Para instruções que não precisam de um operando, os 5 bits menos significativos não têm significado (-----). Aqui está uma lista de instruções da máquina e a sua semântica:\n                    \n\n                    000xxxxx   STA x   armazena o valor do acumulador no byte x da memória\n                    001xxxxx   LDA x   carrega o valor do byte x da memória para o acumulador\n                    010xxxxx   BEQ x   se o valor do acumulador for 0, carregue o valor x para o contador de programa\n                    011-----   NOP     nenhuma operação\n                    100-----   DEC     subtraia 1 do acumulador\n                    101-----   INC     adicione 1 ao acumulador\n                    110xxxxx   JMP x   carregue o valor de x para o contador de programa\n                    111-----   HLT     finaliza o programa\n\n                    \n\n                    No início, o acumulador e o contador do programa são definidos como 0. Depois de buscar uma instrução, mas antes de sua execução, o contador de programa é incrementado. Você pode assumir que os programas serão encerrados.","id":"1719","category":"Ad-Hoc","statistics":{"level":"8 / 10","submissions":1094,"solved":150,"ratio":"13.71%"}}