{"output":"Para cada caso de teste, imprima uma linha contendo algum ancestral comum ideal ótimo e os custos totais mínimos.","input":"O arquivo de entrada contém vários casos de teste. Cada caso de teste começa com dois números inteiros N e L, denota o número de sequências para as folhas e do seu comprimento, respectivamente. A entrada é terminada por N = L = 0. Caso contrário, 1 ≤ N ≤ 1024 e 1 ≤ L ≤ 1000. Em seguida, siga N palavras de comprimento L sobre o alfabeto dos aminoácidos. Eles representam as folhas de uma árvore binária completa, a partir da esquerda para a direita.","level":10,"name":"Árvores Filogenéticas Herdadas","has_images":false,"description":"Entre outras coisas, Biologia Molecular Computacional lida com o processamento de seqüências genéticas. Considerando a relação evolutiva de duas seqüências, podemos dizer que eles estão intimamente relacionados, se eles não diferem muito. Podemos representar a relação por uma árvore, colocando seqüências de ancestrais acima de seqüências de seus descendentes. Tais árvores são chamadas árvores filogenéticas.\r\n\r\n                    Considerando que uma tarefa da filogenia é inferir uma árvore a partir de seqüências de dados, vamos simplificar um pouco as coisas e proporcionar uma estrutura de árvore - esta será uma árvore binária completa. Você receberá as n folhas da árvore. Claro que você sabe, n é sempre uma potência de 2. Cada folha é uma sequência de aminoácidos (designadas pelos códigos compostos de um caractere que você pode ver na figura). Todas as sequências serão de igual comprimento l. Sua tarefa é derivar a seqüência de um ancestral comum com custos mínimos.\r\n\r\n                    \r\n                        \r\n\r\n                            \r\n                                \r\n                                    Aminoácido                           \r\n                                    Alanine AlaA  \r\n                                    ArginineArgR \r\n                                    AsparagineAsnN \r\n                                    Aspartic Acid AspD \r\n                                    CysteineCysC \r\n                                    Glutamine     GlnQ \r\n                                    Glutamic Acid GluE \r\n                                    Glycine       GlyG \r\n                                    Histidine     HisH \r\n                                    Isoleucine    IleI \r\n                                 \r\n                            \r\n                            \r\n                                \r\n                                    Aminoácido\r\n                                    Leucine       LeuL\r\n                                    Lysine        LysK\r\n                                    Methionine    MetM\r\n                                    Phenylalanine PheF\r\n                                    Proline       ProP\r\n                                    Serine        SerS\r\n                                    Threonine     ThrT\r\n                                    Tryptophan    TrpW\r\n                                    Tyrosine      TyrY\r\n                                    Valine        ValV\r\n                                \r\n                            \r\n                         \r\n                       \r\n                    \r\n\r\n                    Os custos são determinados como se segue: cada nó interior da árvore é marcado com uma sequência de comprimento L. O custo de uma extremidade da árvore é o número de posições nas quais as duas sequências diferem nas extremidades. O total custo é a soma dos custos em todas as bordas. A seqüência de um ancestral comum de todas as sequências é então encontrado na raiz da árvore. Um antepassado comum ideal é um ancestral comum com os custos totais mínimos.","id":"1723","category":"Grafos","statistics":{"level":"10 / 10","submissions":42,"solved":9,"ratio":"21.43%"}}