{"output":"Para cada caso de teste imprima em uma linha o número mínimo de movimentos necessários para levar as três peças para a mesma posição, ou a palavra \"impossible\" caso isso não seja possível para o tabuleiro e as posições iniciais dadas.","input":"O arquivo de entrada contém diversos casos de teste. Cada caso de teste começa com o número n. A entrada é terminada por n = 0. Caso contrário, 1 ≤ n ≤ 50. A seguir há três inteiros p1, p2, p3 com 1 ≤ pi ≤ n denotando as posições iniciais das peças do jogo. As cores das ligações são dadas em seguida como uma matriz m x m de letras minúsculas separadas por espaço. O elemento mij denota a cor da ligação entre os locais i e j. Como o grafo não é direcionado, você pode assumir que a matriz é simétrica.","level":6,"name":"Caminhada em um Grafo","has_images":true,"description":"\"Caminhada em um Grafo\" é um jogo jogado em um tabuleiro onde um grafo não-direcionado é desenhado. O grafo é completo e tem todos os ciclos, isso é, para quaisquer dos locais, existe exatamente uma ligação entre eles. As ligações são coloridas. Existem três jogadores e cada um deles tem uma peça. No início do jogo, as três peças estão em lugares pré-determinados no grafo. Em seu turno, os jogadores podem fazer um movimento. Um movimento consiste em mover a peça ao longo de uma ligação para um novo local no tabuleiro. A seguinte restrição é imposta sobre isso: a peça pode ser movida somente entre ligações da mesma cor que a ligação entre as peças dos jogadores adversários.\n                    Nos anos sessenta (\"faça amor, não faça guerra\") surgiu uma variante para um jogador desse jogo. Nessa variação, uma pessoa move todas as três peças, não necessariamente em ordem, mas apenas uma por vez. O objetivo desse jogo é colocar todas as peças no mesmo local com o menor número de movimentos possível. Encontre o menor número de movimentos necessários para colocar todas as três peças no mesmo local, dada uma configuração de tabuleiro e posições iniciais.","id":"1724","category":"Grafos","statistics":{"level":"6 / 10","submissions":64,"solved":37,"ratio":"57.81%"}}