{"output":"Para cada estudo de caso, primeiro exiba uma linha escrito “Grupo #x” onde x é o número do caso (contando de 1).\n\n                    Então, imprima uma linha por time na ordem em que aparecem na entrada. Em cada linha, exiba o nome do time, um caractere vazio, sua melhor posição possível, um sinal de menos e sua pior posição possível.\n\n                    Imprima uma linha vazia após cada estudo de caso, inclusive após a última.","input":"A entrada consistirá em um ou mais estudos de caso. Cada estudo de caso se atém ao seguinte formato:\n\n                \n                    Na primeira linha haverá um inteiro n (1 ≤ n ≤ 20), representando o número de times no grupo.\n                    Nas próximas n linhas, os nomes dos times se seguirão. Nomes sempre são menores que 30 caracteres e não contém espaços em branco.\n                    Na próxima linha, haverá um inteiro g, representando o número de jogos completos.\n                    Finalmente, cada uma das g linhas seguintes, descrevem um jogo completo no formato time1 time2 gols1 gols2.\n                    Você pode partir do pressuposto que no máximo 10 jogos restam e cada time tem ao menos um jogo a jogar. (Isso simplifica o problema um pouco).\n            \n                    A entrada será encerrada quando o valor de n for igual a zero.","level":6,"name":"Copa Européia 2000","has_images":false,"description":"Como você talvez saiba, a qualificação para o Campeonato Europeu de Futebol 2000 é um torneio em que em cada grupo cada time joga um contra o outro duas vezes.A Alemanha está no grupo 3 junto com a Turquia, Finlândia, Moldávia e Irlanda do Norte. 14 jogos foram disputados e 6 ainda acontecerão. \n                    Uma olhada rápida nas posições atuais talvez te faça pensar que a Irlanda do Norte já está fora do páreo. Mas isso está errado! Imagine que a Irlanda do Norte ganhe os seus três jogos restantes, a Alemanha empata com a Turquia e perde para a Finlândia, e a Moldávia derrota a Turquia. Aí a Irlanda do Norte fica em primeiro!\n                    Para aqueles que não estão familiarizados com o modelo de pontuação: Em cada jogo um time ganha 3 pontos por uma vitória, 1 ponto por um empate ou 0 pontos por uma derrota. Depois que todos os jogos tenham sido jogados, os times são ordenados de acordo com seus pontos. No caso de empate, os desempates adicionais são: diferença de gols (gols feitos - gols tomados), gols feitos e escolha aleatória, nessa ordem.\n                    A questão que seu programa deve responder é: Levando em conta todas as possibilidades de como os jogos restantes possam terminar, qual é a posição mais alta e mais baixa de cada time no grupo quando o torneio acabar?","id":"1727","category":"Paradigmas","statistics":{"level":"6 / 10","submissions":319,"solved":109,"ratio":"34.17%"}}