{"output":"Para cada caso de teste, você deve imprimir na primeira linha, “Test Case #.”, indicando o número do caso de teste. Na linha seguinte você deve imprimir “Vladimir needs # litre(s) of blood.” indicando quantos litros de sangue ele necessita para realizar a(s) rota(s) ou “There is no route Vladimir can take.” caso não exista rota(s) válida(s).","input":"A primeira linha da entrada contém um único número que diz a quantidade de casos de testes. A segunda linha começa com um único número que diz quantas especificações de rotas haverá seguir, ou seja, quantas conexões, válidas ou não, serão feitas até o seu destino. As linhas seguintes indicam as rotas (conexões entre duas cidades). Cada rota consiste nos nomes de duas cidades, a hora de partida e tempo total de viagem. Os tempos são em horas. Note que, Vladimir não pode usar as rotas que partem antes das 18h ou cheguem depois das 6h. Haverá no máximo 100 cidades, e menos do que 1000 conexões. Nenhuma conexão demora menos que 1 hora ou mais que 24 horas. Lembre-se, Vladimir tem no máximo 12 horas para realizar cada trajetoria, entre o anoitecer e o amanhecer. Todos os nomes de cidades devem ser menores que 32 caracteres.\n                    A última linha de cada caso de teste contém dois nomes de cidades. O primeiro nome é a cidade de partida de Vladimir, o segundo é o nome do destino.","level":9,"name":"Vladimir o Vampiro","has_images":false,"description":"Vladimir tem a pele branca, dentes muito longos e tem 600 anos, mas isso não é problema, porque Vladimir é um vampiro.\n\n                    Vladimir nunca teve qualquer problema por ser um vampiro. Na verdade, ele é um médico bem sucedido no turno da noite, e tem feito muitos amigos entre os colegas. Ele tem um truque muito impressionante, que sempre mostra em jantares. Ele pode dizer o grupo sanguíneo de uma amostra de sangue apenas pelo seu gosto.\n\n                    Vladimir adora viajar, mas por ser um vampiro, ele passa por três problemas sempre que vai viajar:\n\n                    \n                    \tPrimeiro, ele só pode viajar de trem, porque ele tem que levar seu caixão com ele. Mas viaja sempre de primeira classe, pois tem investido muito dinheiro em ações de longo prazo.\n                    \tSegundo, ele só pode viajar do anoitecer até o amanhecer, ou seja, das 6 da noite até às 6 da manhã. Durante o dia, ele tem que ficar dentro da estação de trem.\n                    \tTerceiro, ele tem que ter algo para comer com ele. Ele precisa de um litro de sangue por dia, que ele bebe ao meio-dia, 12:00, dentro de seu caixão.\n                    \n\n                    Você deve ajudar Vladimir encontrar rotas mais curtas entre duas cidades, para que ele possa viajar com uma quantidade mínima de sangue, pois do contrário, as pessoas podem acabar fazendo perguntas, como, “O que você vai fazer com todo esse sangue?”.","id":"1733","category":"Grafos","statistics":{"level":"9 / 10","submissions":109,"solved":32,"ratio":"29.36%"}}