{"output":"Para cada caso de teste imprima uma única linha que contém a árvore correspondente, denotada como descrito acima. Observe que, em geral, há muitas maneiras para denotar tal árvore: escolha sua favorita.","input":"A entrada contém vários casos de teste. Cada caso de teste especifica o código de Prüfer de uma árvore em uma linha. Você encontrará n-1 números separados por um único espaço. A entrada é terminada por EOF. Você pode assumir que 1 ≤ n ≤ 50.","level":8,"name":"Decodifique a Árvore","has_images":true,"description":"Uma árvore (isto é, um grafo conexo sem ciclos) com os vértices numerados por números inteiros 1, 2, ..., n é dado. O código \"Prüfer\" de tal estrutura é construído da seguinte forma: a folha (um vértice que tem uma única aresta incidente) com o menor número é escolhido. Esta folha, juntamente com a sua aresta incidente é removida do grafo, enquanto que o número do vértice que era adjacente à folha é anotado. No grafo obtido, este procedimento é repetido, até que haja apenas um vértice restante (que, a propósito, sempre tem o número n). A sequência com n-1 números anotados, é chamado de código de Prüfer da árvore.\n\n                    Sua tarefa é reconstruir uma árvore, dado o seu código de Prüfer. A árvore deve ser indicada por uma palavra da linguagem especificada pela seguinte gramática:\n\n                    \n                        T ::= \"(\" N S \")\"\n                        S ::= \" \" T S\n                            | vazio\n                        N ::= número\n                    \n\n                    Ou seja, as árvores têm parênteses em torno delas, e um número que indica o identificador do vértice raiz, seguido por arbitrariamente muitas (talvez nenhuma) subárvores separadas por um único caractere de espaço. Como um exemplo, dê uma olhada na árvore na figura abaixo que é indicado na primeira linha do exemplo de saída.\n\n                    Observe que, de acordo com a definição dada acima, a raiz de uma árvore pode ser uma folha também. Apenas para facilitar a notação nós designamos um vértice como raiz. Normalmente, o que estamos tratando aqui é chamado de \"árvore não enraizada\".","id":"1736","category":"Matemática","statistics":{"level":"8 / 10","submissions":103,"solved":21,"ratio":"20.39%"}}