{"output":"Para cada consulta em todos os casos de teste, gere uma linha contendo os identificadores de todas as empresas que podem rotear pacotes de dados em suas próprias conexões a partir do nó de início para o nó final da consulta. Se não houver empresas, imprima \"-\". Imprima uma linha em branco após cada caso de teste.","input":"A entrada contém vários casos de teste. Cada caso de teste inicia-se com o número de nós da rede n. A entrada é terminada por n = 0 . Caso contrário, 1 ≤ n ≤ 200. Os nós tem os números 1 , ..., n . Depois segue-se uma lista de conexões . Cada conexão começa com dois números A, B. A lista de conexões é terminada por A = B = 0. Caso contrário, 1 ≤ A, B ≤ n, e eles indicam o início e o ponto final da conexão unidirecional, respectivamente. Para cada conexão, os dois nós são seguidos pelas empresas que têm uma ligação do nó A para o nó B. A companhia é identificada por uma letra minúscula. O conjunto de empresas que possuem uma conexão é uma palavra composta apenas por letras minúsculas.\n\n                    Depois da lista de conexões, cada caso de teste é completado por uma lista de consultas. Cada consulta é composta de dois números A, B. A lista (e com ela o caso de teste) é terminada por A = B = 0. Caso contrário, 1 ≤ A, B ≤ n, e eles indicam o início e o ponto final da consulta. Você pode assumir que nenhuma ligação e nenhuma consulta contém os nós iniciais e finais idênticos.","level":4,"name":"Rede de Fibra","has_images":true,"description":"Diversas empresas iniciantes decidiram construir uma Internet melhor, a chamada \"FiberNet\". Eles já instalaram muitos nós que atuam como roteadores em todo o mundo. Infelizmente, eles começaram a discutir sobre as linhas de conexão, e acabou cada empresa estabelecendo seu próprio conjunto de cabos entre alguns dos nós. Agora, provedores de serviços, que querem enviar dados do nó A para o nó B estão curiosos, qual é a empresa capaz de fornecer as conexões necessárias. Ajude os provedores, respondendo às suas perguntas.","id":"1738","category":"Grafos","statistics":{"level":"4 / 10","submissions":1298,"solved":512,"ratio":"39.45%"}}