{"output":"O programa deve imprimir uma linha por pergunta do tipo 4 (“4 X Y”), respondendo se a sequência A[X...Y] é NON INCREASING, NON DECREASING, ALL EQUAL ou NONE como explicado acima.","input":"A entrada contém diversos casos testes e termina com o fim de arquivo. A primeira linha de cada caso teste começa com um inteiro N (1 ≤ N ≤ 104,) o número de elementos na sequência inicial. Na próxima linha tem N inteiros |A[i]| ≤ 109 (1 ≤ i ≤ N). A próxima linha contém um inteiro Q (1 ≤ Q ≤ 105), o número de operações que devem ser executadas. As próximas Q linhas são as operações.","level":10,"name":"Está Ordenado?","has_images":false,"description":"Chavaska gosta de jogar com sequência de inteiros. Ele tem uma sequência A que contém N inteiros que ele modifica\n                e analisa. Particularmente ele está interessado na ordem de algumas sequências contíguas.\n\n                 Ele explicou a Kabralouco como ele está se divertido e lhe convidou para jogar. Kabralouco quer jogar, mas como ele não consegue pensar tão rápido como Chavaska e não gosta de ficar atrás, ele decidiu roubar e agora esté te\n                pedindo para ajudá-li criando um programa que pode realizar as seguintes operações\n\n\n                \n                    0 X Y – Troca os elementos X e Y.\n                    1 X Y – Troca o valor do elemento na posição X por Y.\n                    2 X Y – Insere o elemento Y na posição X.\n                    3 X – Remove o elemento na posição X X.\n                    4 X Y – Pergunta a estrutura dos elementos A[X..Y] e as respostas devem ser:\n                \n                \n                    “ALL EQUAL” – Se A[i] = A[i+1] para todo i em [X,Y −1]\n                    “NON DECREASING” – Se A[i] ≤ A[i+1] para todo i em [X,Y−1] e A[i] ≠ A[i+1] para algum i em [X,Y−1]\n                    “NONINCREASING” – Se A[i] ≥ A[i+1] para todo i em [X,Y−1] e A[i] ≠ A[i+1] para algum i em [X,Y−1]\n                    “NONE” – Se nenhum dos casos acontecem.","id":"1740","category":"Estruturas e Bibliotecas","statistics":{"level":"10 / 10","submissions":538,"solved":55,"ratio":"10.22%"}}