{"output":"Seu programa deve imprimir uma linha para cada query com o número de maneiras de fugir o\n                    mais rápido possível. Como o número pode ser muito grande, sua saída deve ser módulo 109 + 7. Imprima uma linha em branco após cada caso teste.","input":"A entrada é composta por diversos casos testes e termina com o fim de arquivo. Cada uma descreve um mapa e começa com três inteiros N,M (1 ≤ N, M ≤ 1000) e H (0 ≤ H ≤ 100), os quais são, respectivamente, o tamanho do grid e o número de buracos, como descrito acima. Então, seguem H linhas, cada linha com 4 inteiros xi, yi, xf e yf (0 ≤ xi,xf ≤ N; 0 ≤ yi,yf ≤ M ) descrevendo o canto inferior esquerdo e o canto superior direito de um buraco. Depois vem um inteiro Q (1 ≤ Q ≤ 100), o número de queries. As próximas Q linhas, cada uma com 4 inteiros xi, yi, xfe yf (0 ≤ xi,xf ≤ N; 0 ≤ yi,yf ≤ M ), os quais são o começo e o fim como descrito acima. Entre casos de testes consecutivos, haverá uma linha em branco. É garantido que em um mapa, todos os buracos são disjuntos e terá sempre pelo menos um jeito de sair.","level":10,"name":"Entrando em Confusão","has_images":true,"description":"Bob foi a Babilônia procurando por novas aventuras. Mas, assim que chegou, ele encontrou confusão com as criaturas daquele lugar que não eram muito gentis. Eles tinham um jogo esquisito e agora era a vez de Bob jogá-lo. Eles colocariam o Bob em algum lugar e objetivo era sair com vida. \n\n                 Como Bob sabia que ele seria frito caso não fizesse um plano a tempo, ele robou um mapa do terreno em que ele seria jogado. Mas ele ainda não sabia exatamente onde seria largado. Então ele teve que memorizar o mapa inteiro para poder sair com vida. Felizmente, o terreno era retangular (N+1)x(M+1) e as únicas possíveis direções eram ir para o norte,sul, leste e oeste. Uma coisa crucial era memorizar onde eram os buracos, também retangulares. Como ele tinha que sair o mais rápido possível, ele não podia errar o caminho.\n                \n                \n\n                Exemplo de um grid 6x6 com dois buracos e um jeito de sair.\n\n                 Agora ele está te perguntando de quantas maneiras ele poderia sair o mais rápido possivel se ele fosse largado\n                em uma posição (xi, yi) e tivesse que chegar em (xf , yf).","id":"1742","category":"Grafos","statistics":{"level":"10 / 10","submissions":374,"solved":29,"ratio":"7.75%"}}