{"output":"Aprezente uma linha com um inteiro que representa o número de inteiros k tal que existe um plano de viagem para que Endre acaba levando k crianças na viagem.","input":"A primeira linha contém dois números inteiros I e S (1 ≤ I, S ≤ 104), que representam, respectivamente, o número de ilhas e o número de serviços de barco entre eles. Ilhas são identificados com números inteiros distintos de 1 a I. A segunda linha contém I inteiros C1, C2,. . . , CI, onde Ci indica o número de doces o grupo recebe ao chegar a ilha i (1 ≤ Ci ≤ 105 para i = 1, 2,..., I). Cada uma das próximas linhas S descreve um serviço de barco diferente, com dois inteiros A e B (1 ≤ A < B ≤ I), o que representa que é possível viajar da ilha A para ilha B e da ilha B para a ilha A. Não existem dois serviços de barco permitem viajar entre o mesmo par de ilhas.","level":10,"name":"Distribuição Igual","has_images":false,"description":"Endre tem muitos sobrinhos e sobrinhas. Uma vez por ano, ele leva alguns deles em uma viagem para um arquipélago onde um barco empresa opera serviços bidirecionais entre alguns pares de ilhas. Como Endre e as crianças podem voar e retornar diretamente de ou para qualquer uma das ilhas, qualquer viagem pode ser descrita como uma seqüência não vazia i1, i2,..., in de ilhas, de tal modo que cada par consecutivo de ilhas ij e ij + 1 têm um serviço de barco entre eles. A primeira e as última ilha de uma viagem pode ou não ser a mesma ilha, e as ilhas podem ser visitadas mais de uma vez durante a viagem.\n\n                    Cada ilha do arquipélago produz uma diferente variedade peculiar de doces, e recebe os seus visitantes dando a cada grupo que chega um determinado número de peças de doces. Endre não gosta de doces, mas as crianças comem todos quase que instantaneamente. Para evitar brigas, cada vez que o grupo chega a uma ilha e recebe doces, ele distribui uniformemente eles entre os filhos.\n\n                    Você pode se perguntar como Endre sempre consegue distribuir uniformemente os doces que recebem em cada ilha. Bem, a resposta é realmente muito simples. A cada ano, a agência de viagens envia-lhe o plano de viagem (a seqüência i1, i2,..., in ) de antemão. Como ele quer viajar com a maior quantidade de seus sobrinhos e sobrinhas possíveis, ele calcula o número máximo de crianças k ele pode levar para a viagem sem violar a regra sobre a distribuição uniforme de doces. Observe que cada plano de viagem determina exclusivamente o número de crianças a serem tomadas.\n\n                    Isso vem acontecendo há anos, e cada vez Endre acaba levando um número diferente de crianças na viagem. Ele gostaria de saber quantos números diferentes de crianças, ele pode levar em uma viagem, ou seja, o número de inteiros k tal que existe um plano de viagem para a qual ele acaba levando k crianças na viagem. Agora Endre está ocupado preparando a viagem deste ano. Você pode ajudá-lo com a resposta?","id":"1747","category":"Grafos","statistics":{"level":"10 / 10","submissions":562,"solved":172,"ratio":"30.60%"}}