{"output":"Apresente uma linha com um inteiro que representa o mínimo da diferença total de tempo entre todas as partições possíveis do conjunto de candidatos em casais.","input":"A primeira linha contém um inteiro par N (2 ≤ N ≤ 1000) representando o número de candidatos que serão acoplados. A segunda linha contém N inteiros T1, T2,. . . , TN (-11 ≤ Ti ≤ 12 para i = 1, 2,..., N), indicando os fusos horários dos candidatos.","level":6,"name":"Ajude o Cupido","has_images":false,"description":"O trabalho de Cupido está ficando mais difícil, por isso ele está adotando novas tecnologias para ajuda-lo com sua difícil tarefa de combinar pessoas em casais felizes. Ele nomeou os melhores programadores em sua equipe para um novo projeto chamado Advanced Couples Matching (ACM). Para este projeto, os programadores precisam produzir um algoritmo que leva um conjunto de um número par de N pessoas solitárias e combina-los em N/2 casais, de modo que cada pessoa esteja exatamente em um casal.\n\n                    Infelizmente, os dados disponíveis sobre cada pessoa são limitados. Neste mundo moderno, usando de gênero, etnia, idade ou nacionalidade como critério para formar casais não é uma opção sensata, de modo que os programadores só podem utilizar os dados sobre a conexão à internet de cada candidato. Eles decidiram concentrar-se em fusos horários nesta fase. As pessoas que vivem em zonas de tempo mais próximas são mais propensos a encontrar tempo para interagir uns com os outros. Assim, os programadores decidiram criar casais de modo a minimizar a diferença de tempo total.\n\n                    Cada fuso horário é identificado por um número inteiro entre -11 e 12, inclusive, representando a sua diferença em horas de um fuso horário especial chamado Tempo Universal Coordenado (ou UTC). A diferença de tempo de duas pessoas que vivem em zonas de tempo representados por números inteiros i e j é o mínimo entre | i - j | e 24 - | i - j |. Dada uma partição de um conjunto de um mesmo número N de candidatos em N/2 casais, a sua diferença de tempo total é a soma da diferença de tempo de cada casal.\n\n                    Você está convidado a escrever um programa que recebe como entrada os fusos horários de um conjunto de N candidatos. A saída do programa deve ser o mínimo da diferença total de tempo entre todas as partições possíveis do conjunto para casais.","id":"1750","category":"Ad-Hoc","statistics":{"level":"6 / 10","submissions":731,"solved":303,"ratio":"41.45%"}}