{"output":"Apresente uma linha com N - 1 inteiros que representam o custo mínimo de cada etapa de sua viagem, ou o valor -1 se é impossível viajar usando o sistema de transporte escoltado do ICPC para aquela etapa. Mais precisamente, para k = 1, 2,. . . , N - 1, o k-ésimo número deve ser o custo mínimo dos carros que você tem que alugar para ir da província pk para província pk + 1, utilizando o sistema escoltado de transporte do ICPC , ou o valor -1 se é impossível viajar da província pk para província pk + 1 com este sistema.","input":"A primeira linha contém três inteiros R, C e N, representando respectivamente o número de linhas, o número de colunas e o número de províncias que deseja visitar (1 ≤ R, C ≤ 500 e 2 ≤ N ≤ 5). As linhas são numeradas de 1 a R e colunas são numeradas de 1 a C. As próximas 3 × R linhas descrevem o sistema de transporte escoltado do ICPC por meio de três grupos de R linhas cada, com cada linha contendo C inteiros. Na i-ésima linha do primeiro grupo, o j-ésimo número representa o custo Vij de alugar um carro na província de linha i e coluna j, enquanto os números correspondentes no segundo e terceiro grupo representam, respectivamente, Rij e Cij (1 ≤ Vij ≤ 1000, 0 ≤ Rij ≤ R e 0 ≤ Cij ≤ C, para i = 1, 2,..., R e j = 1, 2,..., C). As N linhas seguintes descrevem as províncias p1, p2,. . . , pN que você quer visitar, na mesma ordem que você quiser visitá-los. O k-ésimo número dessas linhas descreve a província pk com dois inteiros Ik e Jk, indicando que pk esta na linha Ik e coluna Jk (1 ≤ Ik ≤ R e 1 ≤ Jk ≤ C para k = 1 , 2,..., N).","level":10,"name":"Jornada Pelo Reino","has_images":false,"description":"O reino de Quadradônia é dividido em províncias que formam um padrão de grade de R linhas e C colunas. Diz a lenda que muitas coisas maravilhosas esperam ser descobertas em algumas das províncias, embora não esteja claro se você pode realmente encontrar a forma sólida indescritível de histórias de água chamada de \"gelo\", ou se são apenas dragões.\n\n                    Você está planejando uma viagem através do reino para descobrir, mas as estradas são perigosas por isso você tem que ter muito cuidado. Para ir de uma província para outra que você gostaria de usar o sistema de transporte conveniente escoltado, gerido pela Interprovincial Communication & Peregrination Company (ICPC). Em cada província, o ICPC fornece uma carruagem fortemente guardada para você viajar para qualquer outra província em um retângulo que a contém, com a mesma taxa fixa (que pode no entanto variar de uma província para outra). Mais formalmente, na província na linha i-ésima e coluna j-ésima você pode alugar um carro escoltado por um custo de Vij, que lhe permite viajar com segurança para qualquer província na maioria das linhas Rij de distância da linha i, e na maioria das colunas Cij de distância da coluna j (isto é, ter número da linha i' e coluna j' com número | i - i' | ≤ Rij e | j - j' | ≤ Cij).\n\n                    Em sua jornada você deseja visitar N províncias p1, p2,. . . , pN, nessa ordem. Andando à procura de aventuras é um negócio caro e seu orçamento é limitado, então você gostaria de gastar o mínimo possível no transporte. Portanto, você gostaria de calcular o custo mínimo de cada etapa de sua viagem, ou seja, o custo mínimo dos carros que você tem que alugar para ir da província pk para a província pk + 1, para k = 1, 2,. . . , N - 1.","id":"1752","category":"Grafos","statistics":{"level":"10 / 10","submissions":216,"solved":70,"ratio":"32.41%"}}