{"output":"Apresente uma linha com um inteiro que representa o número de distribuições distintas dos K cavaleiros ao redor da mesa. Este número pode ser bastante grande, por isso imprima o resto da divisão por 109 + 7.","input":"A primeira linha contém dois inteiros K (1 ≤ K ≤ 106) e D (1 ≤ D ≤ 105), representando, respectivamente, o número de cavaleiros e o número de cavaleiros distraídos. Cada uma das linhas próximas D descreve um cavaleiro distraído diferente com dois inteiros A e B (1 ≤ A, B ≤ K), indicando que o cavaleiro que foi atribuído o assento A na verdade sentou-se no assento B. É garantido que não há dois cavaleiros que se sentaram no mesmo assento.","level":9,"name":"Cavaleiros Da Tàvola Redonda","has_images":false,"description":"Todos os meses o Rei Arthur celebra uma reunião do Conselho Superior. Os K cavaleiros que participam desses encontros são conhecidos como Os Cavaleiros da Távola Redonda, provavelmente porque eles se sentam em uma enorme mesa de carvalho redonda tendo K lugares e um grande trono com uma espada e uma pedra esculpidas em sua parte traseira.\n\n                    Para a reunião de hoje, cada cavaleiro recebeu um número entre 1 e K que indica o assento que ele deve tomar durante a reunião. Os assentos são numerados no sentido horário de 1 a K, sendo o assento numerado 1 o primeiro a esquerda do grande trono. Obviamente, o próprio rei não foi dado um número, porque ele se senta no trono. O escudeiro do Rei Arthur garantiu que não há dois cavaleiros com o mesmo número portanto não deverá haver nenhum problema.\n\n                    Como de costume, o rei foi o primeiro a entrar na sala do conselho hoje. De acordo com as regras de protocolo, ele sentou-se no seu trono e preparou-se para receber os K cavaleiros que devem entrar e sentar-se um a um. Após os D primeiros cavaleiros chegarem, o rei observou que alguns deles poderiam ter-se sentado em assentos errados, porque eles estavam distraídos falando sobre quem iria ganhar o próximo torneio. Que confusão! O escudeiro do Rei Arthur prontamente interveio e deu instruções para o restante K - D cavaleiros. Cada um deles deve entrar na sala do conselho e tentar sentar-se em seu assento legítimo; se sua cadeira já está ocupada, o cavaleiro deve caminhar no sentido horário ao redor da mesa e sentar no primeiro assento desocupado que ele encontra. Assim, a distribuição final de cavaleiros em torno da mesa depende da ordem em que entram na sala.\n\n                    Rei Arthur está agora interessado em saber o número de distribuições distintas dos K cavaleiros ao redor da mesa, dadas as cadeiras ocupadas pelos primeiros D cavaleiros. Duas distribuições são consideradas distintas quando há pelo menos um cavaleiro que se sente em diferentes lugares em ambas as distribuições.\n\n                    Como o Royal Advisor in Combinatorics and other Mathematics (ou Real ACM) a tarefa é atribuída a você. Você precisa dar uma resposta dentro de cinco horas em risco de perder o favor do rei. Anda logo!","id":"1753","category":"Ad-Hoc","statistics":{"level":"9 / 10","submissions":75,"solved":26,"ratio":"34.67%"}}