{"output":"Para cada caso de teste imprima uma única linha contendo o inteiro que representa a menor quantidade de rotas visíveis que Donkey deverá usar.","input":"A primeira linha da entrada conterá um inteiro T (1 ≤ T ≤ 100) indicando o número de casos de teste.\n\n                    A primeira linha de cada caso de teste contém os inteiros N (1 ≤ N ≤ 100) e V (0 ≤ V < N2/2), a quantidade de cidades e a quantidades de rotas visíveis do solo, respectivamente.\n\n                    As próximas V linhas conterão os inteiros Ai e Bi (Ai ≠ Bi; 0 ≤ Ai, Bi < N) , indicando que a rota entre os barris das cidades Ai e Bi​ encontra-se visível do solo. Em nenhum caso de teste o par Ai, Bi aparecerá mais que uma vez.","level":6,"name":"Viagem Barril","has_images":true,"description":"Donkey Kong tem alguns assuntos pendentes a resolver ao redor do país e como está com muita pressa, optou por se deslocar de um local à outro através do SUTVB (Sistema Unificado de Transporte Via Barril). \n\n                    \n\n                    Cada uma das cidades possui um único barril que consegue disparar para o barril de qualquer outra cidade que o \"passageiro\" desejar ir.\n\n                    Donkey quer fazer uma viagem discreta e pediu sua ajuda para encontrar um conjunto de rotas que minimize a quantidade de disparos em que ele é visto.\n\n                    O conjunto de rotas que Donkey deseja encontrar depende do posicionamento das nuvens. Como mostra a figura acima, os barris ficam imediatamente acima das nuvens. O plano de Donkey é utilizar as nuvens para esconder seu trajeto. Pra facilitar seu trabalho, Donkey te emprestou um radar que mostra quais rotas podem ser visualizadas do solo em um dado momento.\n\n                    Sua tarefa é dizer a Donkey qual a menor quantidade de rotas visíveis que ele precisará usar de modo que consiga chegar a qualquer cidade que deseje.\n\n                    Cada rota é considerada apenas uma vez na contagem, independente da direção em que for usada. Em outras palavras, Se a rota A-B é visível e ele usar 10 vezes essa rota, só será contabilizado como 1 rota visível.","id":"1757","category":"Grafos","statistics":{"level":"6 / 10","submissions":633,"solved":195,"ratio":"30.81%"}}