{"output":"Para cada aluno imprima uma única linha contendo a média obtida pelo aluno após o arredondamento do professor. A média deve ter exatamente dois dígitos após o ponto decimal.","input":"A primeira linha da entrada contém o inteiro T ( 1 ≤ T ≤ 5000) que indica a quantidade de casos de teste.\n\n                    A primeira linha de um caso de teste contém os inteiros P (2 ≤ P ≤ 5) e N (2 ≤ N ≤ 50), indicando a quantidade de provas que o professor realizou e a quantidade de alunos matriculados na turma, respectivamente.\n\n                    As N linhas seguintes conterão P números de ponto flutuante com um dígito após o ponto decimal, indicando as notas (0.0 ≤ nota ≤ 10.0)  obtidas pelo i-ésimo aluno em cada uma das provas aplicadas pelo professor.","level":4,"name":"Pontos Extras","has_images":false,"description":"A instituição em que o professor Charles ensina possui o seguinte critério para decidir a aprovação de um aluno:\n\n                    \n\n                    média ≥ 7.0 = APROVADO\n\n                    4.0 ≤ média < 7.0 = PROVA FINAL\n\n                    média < 4.0 = REPROVADO\n\n                     \n\n                    O professor Charles resolveu dar uma bonificação aos seus alunos com base no seu desempenho e estabeleceu os seguintes critérios:\n\n                    1 - Arredondamentos que prejudiquem o aluno serão desconsiderados, permanecendo a nota original.\n\n                    2 - Nenhum arredondamento deve modificar a situação do aluno (APROVADO, FINAL, REPROVADO).\n\n                    3 - Se o aluno foi aprovado ou se tem nota suficiente para realizar a prova final, a média desse aluno será substituida pela maior nota obtida nas provas.\n\n                    4 - Os alunos reprovados foram preguiçosos e não devem receber nenhuma pontuação extra. \n\n                    A aplicação da regra 3 deve ocorrer sempre que possível, desde que não viole as regras 1 ou 2.\n\n                    Escreva um programa que recebe as notas que os alunos obtiveram em cada prova e calcule a sua média conforme os critérios do professor.","id":"1758","category":"Ad-Hoc","statistics":{"level":"4 / 10","submissions":1469,"solved":526,"ratio":"35.81%"}}