{"output":"Para cada caso imprima “Caso #X:”, onde X é o número do caso atual, começando em 1. Para cada operação 2, imprima em uma nova linha como a string S se encontra depois de todas as operações anteriores terem sido executadas. A saída possui aproximadamente 3*10⁶ caracteres.","input":"A primeira linha da entrada contém T (1 ≤ T ≤ 100), o número de casos de teste. A primeira linha de cada caso de teste possui S (1 ≤ |S| ≤ 10⁴), a string que Guga possui. A segunda linha de cada caso possui Q (1 ≤ Q ≤ 10⁵) , o número de operações que Guga irá executar em S. Cada uma das próximas Q linhas possuem uma operação como explicado acima. Para cada operação, 0 ≤ x ≤ |S|.","level":8,"name":"Guga e a String","has_images":false,"description":"Guga tem uma string S contendo apenas letras minúsculas e quer fazer operações nela. Cada operação pode ser de um dos seguintes tipos:\n\n                \n                \t\n                \t0 x, deslocar cada vogal de S x posições da esquerda pra direita (voltando para o começo, caso necessário)\n                \t\n                \t\n                \t1 x, deslocar cada consoante de S x posições da esquerda pra direita (voltando para o começo, caso necessário)\n                \t\n                \t\n                \t2, imprimir como S se encontra atualmente\n                \t\n                \n\n                As vogais que estamos considerando são as letras a, e, i, o e u.\n\n                Uma operação do tipo 0 só desloca vogais por posições de S que possuem vogais.\n\n                Uma operação do tipo 1 só desloca consoantes por posições de S que possuem consoantes.\n\n                \n\n                Por exemplo,\n\n                A string “computador” após a operação 1 2 fica “dorcumapot”, ou seja, cada consoante vai para a posição em S da segunda próxima consoante.\n\n                A string “abe” após a operação 0 1, fica “eba”.","id":"1781","category":"Strings","statistics":{"level":"8 / 10","submissions":4284,"solved":535,"ratio":"12.49%"}}