{"output":"Para cada caso imprima uma linha contendo \"Caso #i: X Y\", onde i é o número do caso atual, iniciando em 1, e (X, Y) são as coordenadas de onde o buraco negro deve estar. X e Y são números reais com 2 casas decimais cada um. Para cada caso haverá exatamente uma solução válida.","input":"A primeira linha contém um inteiro T (1 ≤ T  ≤ 10000), o número de casos de teste. Cada caso de teste possui 4 linhas, cada uma com um par de números reais com 2 casas decimais, X e Y (-1000.0 ≤ X, Y ≤ 1000.0). Cada par representa, respectivamente, as antigas coordenadas da primeira e da segunda estrela, e as novas coordenadas da primeira e da segunda estrela. As posições antiga e nova de cada estrela são diferentes, assim como as posições de duas estrelas no mesmo instante de tempo.","level":3,"name":"Ih, Ferrou, um Buraco Negro!","has_images":true,"description":"André é um astrônomo amador que luta para revelar uma verdade ao mundo: há um buraco negro em direção à Terra! Todos os outros astrônomos tratam ele feito louco, e por consequência, as pessoas normais também, mas ele não desiste de derrubar essa conspiração!\n\n                    Mas como ele descobriu esse buraco negro? Foi assim: buracos negros possuem uma gravidade avassaladora, e todas as estrelas próximas a um começam a girar em torno dele. Algumas mais rápidas, outras mais lentas, algumas mais próximas, outras mais distantes, mas sempre mantendo velocidade angular e distância do buraco negro constantes. Ao observar o céu com seu telescópio um certo dia, André anotou as posições de todas as estrelas que viu. Um mês depois, repetiu a experiência e viu que duas certas estrelas haviam se movido, o que indica que caíram na órbita de um buraco negro!\n\n                    \n\n                    \n\n                    \n\n                    A imagem acima ilustra a trajetória de duas estrelas ao redor do buraco negro.\n\n                    Porém, André não é bom em matemática, e ele não sabe como calcular a posição exata do buraco negro. A superfície do céu pode ser representada por um plano coordenado por eixos X e Y, e ele possui as coordenadas antigas e novas das duas estrelas. Ajude-o calculando as coordenadas do buraco negro no céu e salve o mundo antes que seja tarde demais!","id":"1783","category":"Geometria Computacional","statistics":{"level":"3 / 10","submissions":403,"solved":284,"ratio":"70.47%"}}