{"output":"Para cada caso, exiba uma única linha, a quantidade máxima de posições possíveis de serem visitadas se a posição de início for escolhida de forma ótima.","input":"Haverá diversos casos de testes. Cada caso inicia com três inteiros, L, C e K (1 ≤ L, C ≤ 1000, 0 ≤ K ≤ 5), representando, respectivamente, a quantidade de linhas, colunas, e a quantidade de posições especiais que podem ser utilizadas. A segunda linha contém um caractere P (‘N’ ou ‘R’) representando o modo do jogo, normal ou reverso.\n\n                    A seguir haverá L linhas, cada linha contendo C inteiros X (0 <= X <= 10^7).\n\n                    A entrada termina com L = C = K = 0, a qual não deve ser processada.","level":9,"name":"Brincando com Números","has_images":false,"description":"Alguns amigos, entediados em uma tarde de domingo, resolveram inventar uma brincadeira. Eles desenharam uma matriz de L linhas e C colunas em uma folha de papel, e em seguida escreveram um número em cada uma de suas LxC posições.\n\n                    A brincadeira funciona da seguinte maneira:\n\n                    \n                    \tUma posição (i, j) qualquer da matriz pode ser escolhida para começar o jogo, i representando uma linha, e j uma coluna.\n                    \tA partir dessa posição, é possível mover para as posições (i-1, j) – (i, j+1) se o modo do jogo for normal ou para as posições (i+1, j) – (i, j-1) se o modo do jogo for reverso. Porém, só é possível mover para alguma dessas posições, se o número contido nela for menor que o número da posição atual.\n                    \tNesse jogo, há algumas posições especiais. São as posições que contêm um número primo. Quando um jogador cai nessa posição, ele pode se mover para qualquer uma das 2 adjacentes(de acordo com o modo do jogo), mesmo que o número contido nela não seja menor que o número atual.\n                    \tEm uma partida, é possível utilizar apenas K posições especiais. Após a utilização das K posições, uma posição com número primo será tratada como uma posição normal.\n                    \tO objetivo do jogo é “visitar” o maior número de posições possíveis.","id":"1788","category":"Paradigmas","statistics":{"level":"9 / 10","submissions":332,"solved":120,"ratio":"36.14%"}}