{"output":"Para cada pesquisa processada, seu programa deve imprimir na primeira linha do texto Instancia #x, onde x é o número da instância do arquivo de entrada. (As instâncias são numeradas sequencialmente a partir de um). Na segunda linha deve ser impresso o custo mínimo do período de n dias. Nesta fase de seu trabalho, não é necessário imprimir o plano de produção. Uma linha em branco deve ser deixada entre cada pesquisa.","input":"A entrada é constituída por várias instâncias, armazenadas em sequência ao longo do arquivo de entrada. Cada instância possui a estrutura que segue. Na primeira linha é especificado um valor inteiro 0 ≤ n ≤ 180 que indica o número de dias do planejamento. O caso em que n = 0 representa o final do arquivo e não deve ser processado.\n\nNas próximas n são especificados, na ordem que segue, os inteiros ft ≥ 0, pt, ht e dt ≥ 0, em que 1 ≤ t ≤ n.","level":9,"name":"Beverly Hills, Century City","has_images":false,"description":"Beverly Hills e Century City figuram entre os condados mais abastados e sofisticados de grande Los Angeles. Seus habitantes, pessoas de gostos pouco convencionais e atitudes demasiadamente excêntricas, estão sempre procurando novas diversões, novas quinquilharias e novos hobbies para empregar seus dividendos. A grande mania da região, no momento, é a criogenia. Inspirados pelo enredo do filme Vanilla Sky, vários cidadãos e cidadãs têm recorrido à empresa local A.C.M – Agência Criogênica keith-Morris – com o intuito de \"prolongar\" sua existência.\n\nTal movimentação deixou a A.C.M com um problema a ser resolvido: construir um plano de produção de suas células criogênicas num dado período de tempo. De maneira mais precisa a empresa deseja encontrar um plano de produção de custo mínimo num período de n dias, sujeito a:\n\n\n\tCusto de produção fixos não negativos ft, 1 ≤ t ≤ n;\n\tCustos unitários de produção pt;\n\tCustos unitários de estocagem ht;\n\tDemandas não negativas dt;\n\n\nSua tarefa é construir um programa para ajudar a A.C.M a resolver seu problema.","id":"1810","category":"Paradigmas","statistics":{"level":"9 / 10","submissions":165,"solved":37,"ratio":"22.42%"}}