{"output":"Você devera imprimir um cabeçalho indicando o número da instância que está tratando (Instancia #i) e na linha seguinte o numero de ator/atriz que está com maior risco de sofrer um infarto. O risco para o infarto cresce com o número de observações consecutivas em que o numero de batimentos cresceu. Caso haja empate neste critério, devolva o ator que apresenta a maior diferença entre a primeira e a última medição do intervalo em que os batimentos foram aumentando. Se persistir o empate, o risco será maior para aquele com o maior batimento no fim do intervalo. Se ainda não houver decisão, retorne o de menor índice.\n\t\t\t\t\t\n\t\t\t\t\t Obs: deve ser impressa uma linha em branco após cada instância.","input":"São dadas várias instâncias. A primeira linha de cada instância contem o número 0 ≤ n ≤ 1000 de atores/atrizes monitorados (que serão identificados pelos números 1, 2, ..., n) e o numero 0 ≤ m ≤ 100 de batimentos observados nestes atores. A seguir, em cada um das próximas n linhas são dadas as m medições (o batimento cardíaco é um inteiro entre 0 e 200). O caso em que n = 0 representa o final do arquivo e não deve ser processado.","level":8,"name":"O Óscar Vai Para...","has_images":false,"description":"Não há momento de maior angústia entre as estrelas do cinema que a cerimônia de entrega das estatuetas no Kodak Theatre. Não são raros os atores e atrizes que veem suas pulsações atingirem níveis alarmantes. Os riscos de um enfarto crescem muito quando os batimentos se tornam mais e mais rápidos em períodos consecutivos, caracterizando um período de grande ansiedade.\n\n                    Preocupada com este fato, a Academia de Artes e Ciências de Hollywood resolveu monitorar em intervalos regulares os batimento cardíacos dos vários candidatos a receber a estatueta. Com estes dados pretende-se fazer um programa que alerte os médicos de plantão caso um dos famosos esteja à beira de um ataque cardíaco. Sua tarefa neste problema é auxiliar a Academia nesta nobre missão.","id":"1811","category":"Ad-Hoc","statistics":{"level":"8 / 10","submissions":380,"solved":113,"ratio":"29.74%"}}