{"output":"Para cada instância solucionada, você deverá imprimir um identiﬁcador Instance h, em que h é um número inteiro, sequencial e crescente a partir de 1. Na linha seguinte deve ser impresso Viable ou Not Viable, dependendo do escalonamento para a instância ser ou não viável, respectivamente. Uma linha em branco deve separar a saída de cada instância.","input":"Seu escalonador deve estar preparado para trabalhar com diversas instâncias de entrada. Cada instancia segue o formato que segue. Na primeira linha, são fornecidos os números de máquinas, 0 ≤ m ≤ 100, e de tarefas, 0 ≤ n ≤ 1000, respectivamente. Nas próximas n linhas são fornecidos os valores pt ≥ 0,rt ≥ 0 e dt ≥ 0 (uma tripla por linha) para as tarefas t ∈ T. Os instantes rt e dt são inteiros, e pt é decimal. Valores m = 0 e n = 0 indicam o término do processamento das instâncias e não devem ser processados. Todos os valores da entrada que constem em uma mesma linha são separados por um número qualquer de espaços em branco.","level":3,"name":"Um Cluster Para Evitar Enchentes","has_images":false,"description":"A Academia de Ciências da República Tcheca, preocupada com as inundações ocorridas durante os últimos verões em Praga, está fomentando o desenvolvimento de um novo cluster computacional para, entre outras tarefas, promover uma previsão do tempo mais acurada. Este novo cluster é composto por m máquinas iguais operando em paralelo. Por razões orçamentárias, cada máquina pode processar uma única tarefa por vez, e cada tarefa não pode ser processada em mais de uma máquina simultaneamente. O cluster permite, no entanto, preempção. Ou seja, é possível interromper a execução de uma tarefa e retorná-la posteriormente, em outra máquina inclusive. \n\nPor estar em Praga para a realização de um evento relativo à Ciência da Computação, você foi convidado a desenvolver uma versão preliminar do escalonador de tarefas do cluster. Nesta versão, é fornecido um conjunto de tarefas T, em que cada tarefa t ∈ T possui:\n\n\n    Um requisito de processamento pt que denota o número de unidades de tempo necessárias para realizar tal tarefa;\n    Um instante de liberação rt , que representa a unidade de tempo a partir da qual a tarefa está disponível para processamento (ela poderia estar aguardando dados, por exemplo);\n    E um valor dt ≥ pt + rt que indica o primeiro instante, em unidades de tempo, em que a tarefa deve, impreterivelmente, ter sido completada. Isto é, a tarefa t deve ser realizada no intervalo [rt, dt).\n\n\nSeu escalonador deve receber estes dados, de acordo com o formato descrito abaixo e dizer se existe ou não um escalonamento viável, isto é, um escalonamento que complete todas as tarefas nos intervalos de tempo permitidos.","id":"1812","category":"Matemática","statistics":{"level":"undefined","submissions":-1,"solved":-1,"ratio":"undefined"}}