{"output":"Para cada instância solucionada, você deverá imprimir um identiﬁcador \"Instancia h\", em que h é um número inteiro, sequencial e crescente a partir de 1. As próximas k linhas referem-se à possibilidade das entregas. Para 1 ≤ j ≤ k, você deve imprimir na j-ésima linha a mensagem \"Impossivel\" se não for possível realizar a entrega dentro do tempo limite, ou \"Possivel - <d> km, <t> min\", onde <d> é a distância que deve ser percorrida e <t> o tempo gasto para percorrer essa distância. Se houver mais de um caminho com a menor distância possível, escolha o de menor tempo.\n\nUma linha em branco deve separar a saída de cada instância.","input":"Seu programa será capaz de resolver várias instâncias do problema logístico. Cada instância possui a estrutura descrita abaixo.\n\nNa primeira linha são fornecidos o número de cidades (0 ≤ n ≤ 100) e o número de estradas (0 ≤ m ≤ 10000) da malha viária. Nas próximas m linhas são dados, em cada linha, quatro números inteiros separados por espaços em branco, x y c t, em que x e y são as cidades de onde sai e onde chega uma estrada, respectivamente, c é o comprimento desta estrada e t o tempo gasto para percorrê-la (obtido junto ao departamento nacional de estradas e rodagem, que afere o trânsito de tempos em tempos). Observe que 1 ≤ x, y ≤ n e que c, t ≥ 0. Uma característica interessante na República Tcheca é que as estradas são de mão única para evitar as ultrapassagens indevidas, que causam acidentes.\n\nNa linha seguinte é fornecido um inteiro k ≥ 0 que representa o número de entregas que seu programa deve planejar nesta malha viária. As próximas k linhas possuem, em ordem, a cidade de origem, a cidade de destino e o tempo limite t para o transporte da mercadoria, em minutos. De acordo com o órgão de inspeção e vigilância sanitária, nenhum transporte com duração superior a 100 horas será admitido. Logo, 0 ≤ t ≤ 6000. Um valor n = 0 indica o término das instâncias e não deve ser processado.","level":9,"name":"Anacrônico?","has_images":false,"description":"Mr. Řež Slovankou é proprietário de uma empresa em Praga especializada no transporte de produtos perecíveis. Por ser uma das mais antigas e tradicionais empresas do ramo, ela é responsável por mais de 90% dos transportes deste tipo de mercadoria realizadas no país. Diariamente, vários caminhões carregados deixam postos da empresa (local onde os produtos ﬁcam armazenados) com destino aos centros consumidores.\n\nVisando um futuro ingresso no Espaço Econômico Europeu, o governo da República Tcheca, através do órgão de inspeção e vigilância sanitária, baixou uma série de medidas para assegurar ainda mais a qualidade dos alimentos consumidos pela população. Para não perder mercado, a empresa de Mr. Řež precisa adequar-se, o mais rápido possível, às novas regras.\n\nSegundo o governo, a partir de agora, produtos destinados a diferentes centros consumidores não mais poderão compartilhar um mesmo caminhão. Além disso, todo transporte deverá ser concluído em um período abaixo de um tempo limite, especiﬁcado para cada mercadoria.\n\nA adequação a essas novas regras trará consigo um aumento generoso nos custos operacionais da empresa. Preocupado com isso, Mr. Řež decidiu que seus caminhões deverão satisfazer às regras, mas que também deverão percorrer sempre o menor caminho possível até os centros consumidores (para economizar combustível, gastar menos os pneus, etc.).\n\nPara resolver este problema logístico, Mr. Řež pediu auxílio a você, que disse ser capaz de construir um programa que recebe um mapa da malha viária (em que cada estrada tem associado um comprimento em quilômetros e um tempo em minutos que leva para ser percorrida), a origem e o destino do transporte, o tempo limite, e diz se é ou não possível realizar a entrega de acordo com as restrições impostas. Em caso aﬁrmativo, você ainda disse que responderá o tempo gasto e a distância percorrida.\n\nMr. Řež ﬁcou muito impressionado e satisfeito com sua prestatividade, e prometeu-lhe uma boa gratificação.","id":"1813","category":"Grafos","statistics":{"level":"9 / 10","submissions":334,"solved":72,"ratio":"21.56%"}}