{"output":"Para cada instância solucionada, você deverá imprimir um identificador Instancia h em que h é um número inteiro, sequencial e crescente a partir de 1. Na linha seguinte você deve imprimir a posição x y ideal para o ponto central do centro de convenções. Caso exista mais que um ponto ideal para a construção, imprima aquele com o menor valor para x. Caso ainda exista mais que uma opção, imprima aquele com o menor valor para y. Trunque os números impressos em exatamente três casas decimais. Caso não seja possível construir o centro, escreva a palavra impossível na linha.\n\n                    Uma linha em branco deve separar a saída de cada instância.","input":"A entrada é composta de diversas instâncias. Cada instância inicia-se com uma linha contendo o número 0 ≤ n ≤ 1000 de árvores da floresta, seguida por n linhas contendo os pares ordenados xi yi, que representam as coordenadas das árvores da floresta. Todas as coordenadas dadas são inteiras. A entrada termina com n = 0.","level":8,"name":"Centro de Convenções","has_images":false,"description":"Já com a Final Mundial da Maratona de Programação em mente, o governo chinês iniciou um projeto para a construção de um centro de convenções novo. Esse centro será o mais moderno do mundo, com toda a infraestrutura para sediar importantes eventos. O governo já decidiu (e se decidiu está decidido) construí-lo no formato de uma circunferência. Quando visto de cima esse novo centro, com auxílio de toda sua iluminação de ultima geração, irá dar a impressão de ser uma grande nave espacial redonda. Com truques de luzes, pretende-se ainda criar a impressão de movimento para o imponente prédio.\n\n                    Porém todos sabem que a China possui um grande problema de espaço físico, e o único lugar disponível para a construção fica nos arredores de uma antiga floresta de árvores milenares. Para deixar o projeto ainda mais atraente, decidiu-se que o centro será construído dentro da floresta, mas sem derrubar uma única árvore. A sorte do projetista é que a floresta é esparsa, e existe bastante espaço entre as árvores em alguns lugares. Como se deseja criar o maior (no sentido da área construída) centro de convenções possível, sua tarefa é ajudar a encontrar o melhor lugar para a construção. Seu objetivo é encontrar as coordenadas do ponto central da construção, que deve estar dentro do fecho convexo induzido pelas árvores.","id":"1818","category":"Geometria Computacional","statistics":{"level":"undefined","submissions":-1,"solved":-1,"ratio":"undefined"}}