{"output":"Para cada instância solucionada, você deverá imprimir um identiﬁcador Instancia h em que h é um número inteiro, sequencial e crescente a partir de 1. Na próxima linha, você deve imprimir os três números a1, a2 e a3, representando os cocientes da função linear procurada. Esses números devem estar truncados em três casas decimais.\n\n                    Uma linha em branco deve separar a saída de cada instância.","input":"A entrada é composta de diversas instâncias. Para cada instância da entrada é dado um número inteiro 3 ≤ n ≤ 1000 indicando quantas triplas foram obtidas na coleta de dados. Em cada uma das próximas n linhas é dada uma tripla Xi, Yi e Zi ,como área de plantio (em milhares de hectares), a quantidade de trabalhadores envolvidos (dado em milhares de pessoas), e a produção agrícola (dada em toneladas de alimentos), respectivamente. O arquivo de entrada termina quando for encontrado n = 0. Assuma que não existe uma relação linear entre a quantidade de trabalhadores e a área de plantio, ou seja, não existem constantes α,β tais que, para todo i, xi = αyi + β. Assuma também que 0 ≤ Xi,Yi,Zi ≤ 1000 e que todos os valores dados são inteiros.","level":10,"name":"Estimando a Produção","has_images":true,"description":"A China é uma grande produtora de alimentos, mas também uma enorme consumidora. Pesquisadores chineses perceberam que em certos momentos de sua história a produção agrícola foi maior que o consumo, e em outros momentos esse quadro se inverteu. Preocupados com o futuro da grande nação, passaram a coletar dados sobre a área de plantio, a quantidade de trabalhadores e a produção agrícola. Para melhor investir seus recursos, eles agora desejam fazer uma previsão sobre a produção do país.\n\n                    O conjunto de dados que os pesquisadores conseguiram coletar é formado por triplas (Xi,Yi,Zi), em que Xi representa a área de plantio, Yi a quantidade de trabalhadores e Zi a produção agrícola. Como essa produção está ligada diretamente com os demais dados coletados, eles decidiram estimar a produção futura usando a função linear a1+a2x+a3y, que minimiza a soma dos erros quadrados\n\n                     \n\n                    em que n é o total de triplas disponíveis. Desta forma eles serão capazes de planejar melhor a produção e o consumo dos próximos anos. Seu objetivo é calcular a função linear desejada.","id":"1819","category":"Matemática","statistics":{"level":"10 / 10","submissions":43,"solved":1,"ratio":"2.33%"}}