{"output":"Para cada instância solucionada, você deverá imprimir um identificador Instancia h, em que h é um número inteiro, sequencial e crescente a partir de 1. Na linha seguinte, você deve imprimir possivel se for possível realizar os casamentos entre os n rapazes e as n garotas sem que parentes se casem, e imprimir impossivel em caso contrário.\n\nUma linha em branco deve separar a saída de cada instância.","input":"Seu programa deve estar preparado para trabalhar com diversos grupos de jovens, doravante denominados instâncias. Cada instância tem a estrutura que segue.\n\n                    Na primeira linha são fornecidos inteiros n (0 ≤ n ≤ 100), que representa o número de rapazes e garotas, e m (0 ≤ m ≤ 1000) que representa o número de parentescos existentes entre eles. Não foram incluídos em m parentescos entre um mesmo sexo, pois isso é irrelevante ao problema.\n\n                    Nas próximas m linhas são fornecidos m pares de números entre 1 e n, inclusive, um par por linha. O primeiro número representa um rapaz e o segundo uma garota que são parentes.\n\n                    Valores n = m = 0 indicam o final das instâncias e não devem ser processados.","level":9,"name":"Miai Chinês","has_images":false,"description":"São notórios os problemas que a China vem enfrentando ao longo do tempo para controlar a explosão populacional que aflige o país. Para piorar a situação, no interior, os casamentos costumam ser tradicionalmente arranjados nas famílias, aumentando as chances do nascimento de crianças com pais aparentados.\n\t                   \n                    Ciente do problema, o governo chinês resolveu criar uma agência oficial de matrimônios. Esta agência deve receber as informações dos jovens que pretendem se casar e decidir se é possível realizar casamentos entre eles que evitem uniões de parentes e de tal forma que nenhum dos jovens termine solteiro. Como em muitos outros países do mundo, na China são permitidos apenas casamentos monogâmicos entre rapazes e garotas.\n\n                    Sua tarefa neste problema é auxiliar o governo, escrevendo um programa para descobrir se é possível realizar casamentos em dados grupos de jovens.","id":"1821","category":"Grafos","statistics":{"level":"9 / 10","submissions":152,"solved":53,"ratio":"34.87%"}}