{"output":"Para cada instância solucionada, você deverá imprimir um identificador Instancia h em que h é um número inteiro, seqüencial e crescente a partir de 1. Na linha seguinte, voce deve imprimir sim se existir uma maneira de ir do ponto de partida do labirinto até seu ponto de chegada (sem atravessar nenhum pauzinho...), e imprimir nao em caso contrário.\r\n\r\n                    Uma linha em branco deve separar a saída de cada instância.","input":"Seu programa deve estar preparado para trabalhar com diversos labirintos, doravante denominados instâncias. Cada instância é iniciada com uma linha contendo 5 números, ditos  n xi yi xf yf . O valor  n  indica o número de pauzinhos que foram usados para construir o labirinto. O par ( xi , yi ) é o canto inferior esquerdo do pátio e também o ponto de partida. O par ( xf , yf ) é o canto superior direito e também ponto de chegada do labirinto. Nas próximas  n  linhas são dadas as coordenadas  x1 y1 x2 y2  representando os extremos ( x1 , y1 ) e ( x2 , y2 ) de um dos pauzinhos usados na construção do labirinto. O arquivo de entrada termina com  n  < 0. Pode-se assumir que todos os números dados são inteiros e que  n  ≤ 1000.","level":10,"name":"O Penúltimo Imperador","has_images":false,"description":"Muito se conhece do último imperador da China, imortalizado no clássico filme vencedor do Oscar. Porém, seu antecessor, o Imperador Thang Po Lop teve uma vida muito mais interessante, uma vez que morreu ainda na cidade proibida, cercado de concubinas e criados eunucos.\r\n\r\n                    O Imperador Po Lop era um grande colecionador de pauzinhos (daqueles que os orientais utilizam para comer). Desde seus 9 anos ele os guardava e construía com eles enormes labirintos utilizando uma estratégia bastante interessante. Inicialmente Po Lop escolhia um dos pátios retangulares da cidade proibida para construir o labirinto, e esse labirinto sempre ocupava todo o espaço do pátio escolhido. Os pauzinhos eram então colocados nesse pátio aparentemente em lugares aleatórios, sempre paralelos a um dos cantos do pátio. O imperador nunca colocava pauzinhos sobrepostos (nem mesmo parte deles), apesar de ser possível existir cruzamentos ou até mesmo pauzinhos se encostando. Consta na biografia do imperador Po Lop que ele construiu labirintos gigantescos, sempre tomandos esses cuidados.\r\n\r\n                    Infelizmente havia um problema. Apesar de exímio construtor de labirintos, o imperador era incapaz de saber se afinal o labirinto continha ou não um caminho ligando sua a entrada à sua saída (sempre em lados opostos do pátio). Para saber isso, ele se utilizava de seus eunucos. Ele instruía o eunuco a procurar o caminho naquele labirinto. Muitas vezes, o eunuco dizia não ser possível. O imperador Po Lop se zangava e degolava o infeliz, pois duvidava da resposta do criado. Felizmente, além de muito paciente (não com eunucos) o imperador era bastante cuidadoso, e anotava criteriosamente as informações sobre os labirintos que construía. Estas anotações foram encontradas na biblioteca da cidade proibida quando da revolução e salvas da destruição. Sua tarefa neste problema é resolver finalmente o enigma, verificando se os labirintos construídos pelo Imperador Po Lop têm ou não saída.","id":"1823","category":"Grafos","statistics":{"level":"10 / 10","submissions":28,"solved":5,"ratio":"17.86%"}}