{"output":"Para cada cenário, você deverá escrever uma linha no arquivo de saída, com um dos seguintes conteúdos:\n\n\n\tNo caso da formiga morrer de fome, a espressão \"Morreu...\"\n\tCaso contrário, você deverá escrever:\n\t\n\t\tA porcentagem das comidas que foram devoradas na peregrinação da formiga rumo à saída (com três digitos, espaços à esquerda se for o caso, arredondado para o inteiro mais próximo, ou para baixo, no empate, seguido seguido do sinal %);\n\t\tA quantidade de trombadas que a formiga deu nas paredes do retângulo (10 casas, alinhado à direita, espaços à esquerda);\n\t\tA porta pela qual ela saiu.\n\t\n\t\n\n\nA imagem a seguir é sobre o exemplo abaixo:","input":"A entrada consistirá de diversos cenários. Para cada cenário serão fornecidas, numa única linha, as medidas do retângulo, primeiro a largura M (Norte - Oeste), depois a profundidade N (Norte - Leste) (0 < m,n ≤ 100.000), e a porta por onde entrou a formiguinha. Uma linha contendo o valor 0 para uma das dimensões do retângulo marca o final da entrada.","level":6,"name":"Formigando","has_images":true,"description":"Um grupo de cientistas malucos da ACGOP (Academia de Ciência e Ginástica Olímpica Pindamonhangabense) está estudando o comportamento de uma estranha raça de formigas cegas. Após anos de estudo, eles concluíram que:\n\n\n\tEssas formigas só andam em linha reta e seu comportamento é o mesmo da luz. Ou seja, quando encontram uma parede pela frente, sua rota é \"refletida\" (como se fosse um raio de luz incidindo num espelho plano) e ela segue andando de modo que sua rota forme com o obstáculo um ângulo igual ao de incidência;\n\tEssas formigas só param quando passam por um alimento e voltam a andar no mesmo sentido que vinham logo após devorar o alimento;\n\tO máximo que uma formiga consegue viajar sem morrer de fome é 2 metros.\n\n\nPara comprovar essas conclusões, os cientistas construíram uma série de cenários, onde eles colocariam as formigas para andar. Cada cenário consiste num retângulo de dimensões M x N metros com 4 entradas, situadas nos vértices, que de agora em diante chamaremos pelos nomes dos pontos cardeais, conforme a figura:\n\n\n\nDentro do retângulo foram distribuidas MN comidas, colocadas no centro de cada quadrado de 1 metro de lado interior ao retângulo. As formigas são introduzidas nos retângulos por uma das quatro portas numa rota que forma 45 graus com os lados do retângulo de modo que, após percorrer aproximadamente 0,707 metros, alcançam o primeiro alimento e, em seguida, continuam suas viagens pelo mesmo caminho, até que uma das três situações ocorra:\n\n\n\tA formiga bate na parede: neste caso sua rota é refletida e ela segue andando de modo que sua rota forma com a aparede um ângulo igual ao de incidência (ou seja, permanece 45 graus);\n\tA formiga anda mais de 2 metros e não encontra comida: nesse caso ela morre (tadinha);\n\tA formiga encontra uma porta: nesse caso ela sai e o experimento está concluído.\n\n\nSua missão é escrever um programa que preveja o que vai acontecer com a formiga colocada em cada um dos cenários da pesquisa.","id":"1825","category":"Geometria Computacional","statistics":{"level":"6 / 10","submissions":34,"solved":14,"ratio":"41.18%"}}