{"output":"Para cada caso de teste, imprima uma linha com a palavra \"vazia\" se a GLC não gera nenhuma cadeia de terminais, ou a palavra \"finita\" se a GLC gera alguma, mas não infinitas cadeias de terminais, ou a palavra \"infinita\" se a GLC gera infinitas cadeias de terminais.","input":"A entrada contém vários casos de teste. Cada caso de teste fornece a descrição de uma gramática livre-do-contexto.\r\n\r\nA primeira linha de um caso de teste contém dois inteiros v e r, onde v é a quantidade de variáveis da GLC, r é a quantidade de regras, 1 ≤ v ≤ 102 e 0 ≤ r ≤ 2·102.\r\n\r\nCada uma das próximas v linhas contém uma palavra feita somente de letras maiúsculas, ou seja, uma variável da GLC. A variável da primeira linha é a variável inicial.\r\n\r\nCada uma das próximas r linhas descreve uma regra da GLC. É dada uma palavra de letras maiúsculas, um inteiro 0 ≤ k ≤ 102 e uma sequência de k elementos, onde cada elemento é uma variável, ou um símbolo terminal.","level":10,"name":"A Linguagem é Infinita?","has_images":false,"description":"Gramática livre-do-contexto – GLC – é uma estrutura matemática utilizada para gerar cadeias, que são sequências finitas de símbolos terminais. Dizemos que o conjunto de todas as cadeias que podem ser geradas por uma GLC G é a linguagem de G, escrito L(G). Neste problema, dada uma GLC G, você deve determinar se L(G) é um conjunto vazio, finito, ou infinito.\r\n\r\nUma GLC é uma 4-upla (V, Σ, R, S), onde\r\n\r\n\r\n\tV é um conjunto finito e não-vazio cujos elementos chamamos de variáveis.\r\n\tΣ é um conjunto finito e não-vazio, disjunto de V, cujos elementos chamamos de símbolos terminais.\r\n\tR é um conjunto regras. Uma regra tem a forma \r\n\tA → U1U2...Uk\r\n\tonde A ∈ V, k ≥ 0 e Ui ∈ V ∪ Σ para i = 1,2,...,k.\r\n\tS ∈ V é a variável inicial.\r\n\r\n\r\nPara gerar uma cadeia utilizando uma GLC, realizamos o seguinte procedimento.\r\n\r\nPrimeiro, escrevemos a variável inicial S. Em seguida, escolhemos uma regra para substituir S, digamos, S → U1U2...Uk. Após esta escolha, apagamos o S e escrevemos em seu lugar a cadeia de variáveis e/ou terminais U1U2...Uk. Repetimos este processo até que não restem variáveis escritas. Se não é possível gerar uma cadeia sem variáveis partindo apenas da variável inicial, dizemos que a linguagem da GLC é vazia.\r\n\r\nPor exemplo, seja a GLC abaixo, onde S é a variável inicial.\r\n\r\nS → aSa\r\n\r\nS → bSb\r\n\r\nS → a\r\n\r\nS → b\r\n\r\nS → \r\n\r\nUtilizando a GLC acima, podemos gerar qualquer palíndromo feito de a's e b's. Por exemplo:\r\n\r\nS → aSa → abSba → abba\r\n\r\nObserve que a cadeia vazia é uma cadeia válida. Logo, se uma GLC G gera, por exemplo, apenas a cadeia vazia, L(G) é finita, mas não é vazia.\r\n\r\nNeste problema, as variáveis serão palavras feitas somente de letras maiúsculas, ou seja, caracteres entre A e Z. Os símbolos terminais serão letras minúsculas, ou seja, caracteres entre a e z. As regras serão dadas conforme descrito na próxima seção. A variável inicial será sempre a primeira variável do caso de teste.","id":"1826","category":"Grafos","statistics":{"level":"10 / 10","submissions":67,"solved":30,"ratio":"44.78%"}}