{"output":"Para cada caso de teste deverá ser impressa a mensagem \n        \"Caso #t: R\", onde t \n        é o número do caso de teste (cuja contagem se inicia no número um) \n        e R é uma das três reações possíveis de Sheldon: \n        \"Bazinga!\", \"Raj trapaceou!\", ou \"De novo!\".","input":"A entrada consiste em uma série de casos de teste. A primeira \n        linha contém um inteiro positivo T \n        (T ≤ 100), que representa o número de casos de \n        teste. Cada caso de teste é representado por uma linha da entrada, \n        contendo as escolhas de Sheldon e Raj, respectivamente, separadas \n        por um espaço em branco. As escolha possíveis são as personagens do \n        jogo: pedra, papel, tesoura, lagarto e Spock.","level":2,"name":"Bazinga!","has_images":false,"description":"No oitavo episodio da segunda temporada do seriado The Big Bang \n        Theory, The Lizard-Spock Expansion, Sheldon e Raj discutem qual \n        dos dois é o melhor: o filme Saturn 3 ou a série Deep Space \n        9. A sugestão de Raj para a resolução do impasse é uma disputa de \n        Pedra-Papel-Tesoura. Contudo, Sheldon argumenta que, se as partes \n        envolvidas se conhecem, entre 75% e 80% das disputas de \n        Pedra-Papel-Tesoura terminam empatadas, e então sugere o \n        Pedra-Papel-Tesoura-Lagarto-Spock. \n As regras do jogo proposto são:\n        a tesoura corta o papel;o papel embrulha a pedra;a pedra esmaga o lagarto;o lagarto envenena Spock;Spock destrói a tesoura;a tesoura decapita o lagarto;o lagarto come o papel;o papel contesta Spock;Spock vaporiza a pedra;a pedra quebra a tesoura.\n Embora a situação não se resolva no episódio (ambos escolhem \n        Spock, resultando em um empate), não é difıcil deduzir o que \n        aconteceria se a disputa continuasse. Caso Sheldon vencesse, ele se \n        deleitaria com a vitória, exclamando \"Bazinga!\"; caso Raj vencesse, \n        ele concluiria que \"Raj trapaceou!\"; caso o resultado fosse empate, \n\t    ele exigiria nova partida: \"De novo!\".  Conhecidas as personagens do        jogo escolhido por ambos, faça um programa que imprima a provável \n        reação de Sheldon.","id":"1828","category":"Iniciante","statistics":{"level":"2 / 10","submissions":15348,"solved":7384,"ratio":"48.11%"}}