{"output":"A primeira linha da saída consiste na mensagem \n        \"Campeao: C!\", onde C é o nome do participante\n        que venceu o maior número de rodadas, ou a mensagem \n        \"A competicao terminou empatada!\", se for o caso.\nApós esta mensagem inicial, deve ser impressa, para cada rodada \n        disputada, a mensagem \"Rodada #r: V foi o\n        vencedor\", onde r é o número da rodada (cuja contagem se \n        inicia no número um) e V é o nome do participante que \n        venceu a rodada de número r.\nAo final de cada mensagem da saída deve ser impressa uma quebra de\n        linha.","input":"A primeira linha da entrada contém o número inteiro positivo \n        N (N ≤ 1.000), que representa o número de\n        rodadas disputadas.\nCada rodada é representada por duas linhas: a primeira contém a \n        exponencial dita por Lucas, na forma a^b\n        (2 ≤ a, b ≤ 10.000), e a segunda contém o fatorial \n        escolhido por Pedro, na forma n! (2 ≤ n ≤ \n        10.000).  \n        Os números a, b, n são inteiros e a expressão\n        a^b significa \"a elevado à \n        b-ésima potência\".","level":6,"name":"Jogo do Maior Número","has_images":true,"description":"Lucas e Pedro são alunos do ensino médio que ficaram impressionados \n        após uma aula de matemática, na qual foi apresentado o fatorial de um \n        número natural n, isto é,\n\t\t \n        com 0! = 1. Ficaram com uma dúvida, porém: qual operação produz os\n        maiores resultados, o fatorial ou a exponenciação?\nCom esta dúvida em mente, propuseram o Jogo do Maior Número: os dois\n        participantes teriam que dizer, ao mesmo tempo e o mais rápido possível,\n        o maior número que viesse a cabeça, sendo o vencedor aquele que dissesse\n        o maior dentre os dois números.\n        Escolheram Beto como juiz, que foi tomando notas dos números que\n        os dois não cessavam de falar. Lucas citava sempre exponenciais, \n        enquanto Pedro se concentrava nos fatoriais.\nAo fim da brincadeira, um porém: nem os participantes, tampouco o \n        juiz, tinha a menor ideia de quem havia sido o vencedor. Escreva, \n        portanto, um programa que os auxilie a decidir quem foi o vencedor de \n        cada rodada da brincadeira, e quem se sagrou campeão (maior número de \n        vitórias, consideradas todas as rodadas).","id":"1829","category":"Matemática","statistics":{"level":"6 / 10","submissions":1476,"solved":462,"ratio":"31.30%"}}