{"output":"Para cada caso de teste a saída deve ser a mensagem\n        \"Caso #t: A Especial, B Predileta e \n\t    C Sortida\", onde os inteiros A,B,C são as \n        quantidades de cada \n        tipo de caixa de bombom e t é o número do caso de teste, \n        cuja contagem tem início no número um. Ao final de cada mensagem deverá         ser impressa uma quebra de linha.","input":"A entrada consiste em vários casos de teste, sendo cada caso \n        representado por uma única linha com os valores de X, \n        Y e Z, \n        (0 ≤ X,Y,Z ≤ 10000), em kilogramas,\n\t    separados por um espaço em branco e seguidos de uma quebra de linha. \n        Uma linha com três zeros indica o fim da entrada, e não deve ser \n        processada.\nOs valores de X, Y, Z são números reais com até 3 casas \n        decimais de precisão.","level":9,"name":"Caixas de Bombons","has_images":false,"description":"Uma fábrica de chocolates produz três tipos de bombons. Os \n        ingredientes básicos necessários para a fabricação de uma unidade de \n        cada tipo estão listados abaixo:\n        Crocante:5 gramas de amendoim, 25 gramas de chocolate branco e 20 \n            gramas de chocolate ao leite;Misto:25 gramas de chocolate branco e 25 gramas de chocolate ao \n            leite;Tradicional:50 gramas de chocolate ao leite.\nEsta fábrica comercializa três tipos de caixa de bombons, com 30 \n        unidades cada, com os nomes e composições listados a seguir:\n        Especial:30 bombons do tipo Crocante;Predileta:10 bombons do tipo Crocante e 20 bombons do tipo Misto;Sortida:10 bombons de cada um dos três tipos.\nSabendo que no mês de abril a fábrica gastou, na fabricação dos \n        bombons dos três tipos descrito, X kg de amendoim, \n        Y kg de chocolate branco e Z kg de chocolate ao \n        leite, quantas caixas, de cada tipo, foram produzidas neste referido \n        mês?","id":"1830","category":"Matemática","statistics":{"level":"9 / 10","submissions":475,"solved":100,"ratio":"21.05%"}}