{"output":"Para cada caso de teste deve ser impressa a mensagem\n        \"Caso #t: R$ C\", onde t é o número do \n        caso de teste (cuja contagem tem início no número um) e C é \n        o valor do serviço, com duas casas decimais, representando os centavos,         sem separador de milhar e com a vírgula separando os reais dos \n        centavos.\nAo final de cada mensagem deve ser impressa uma quebra de linha.","input":"A entrada consiste em T (T ≤ 1.000) casos de         teste, onde o valor de T é informado na primeira linha da\n        entrada.\n\n        \nCada caso de testes é representado por até cinco linhas: a primeira \n        delas contém o valor R (1 ≤ R ≤ 10), em \n        reais, que a empresa cobra por minuto de serviço.  A linha seguinte \n        contém o número M (0 ≤ M ≤ 100) de lâmpadas \n        da sequência errada, e as M cores desta sequência são dadas \n        na linha abaixo (caso M seja maior do que zero),\n        separadas por espaços em branco. Estas cores são strings \n        de caracteres de tamanho S (1 ≤ S ≤ 50) e \n        há, no máximo, 20 cores distintas em cada caso de teste.\n        De forma semelhante, as últimas duas linhas do caso de teste contém a\n        quantidade N (0 ≤ N ≤ 100) de lâmpadas da \n        sequência desejada e a relação das N cores que deve compôr a         montagem final.","level":8,"name":"Decoração Natalina","has_images":false,"description":"Maria bem que tentou ajustar a decoração natalina de seu comércio, \n        mas o resultado final não a agradou: o jeito foi contratar uma empresa \n        especializada no ramo de decorações natalinas. O serviço que ela \n        precisa é simples até: colocar N luzes de pisca-pisca \n        coloridas em uma dada sequência, mas seus ajudantes conseguiram apenas \n        colocar M lâmpadas em uma sequência que não era a \n        desejada.\nA empresa conta com profissionais do ramo, que fazem o serviço com \n        rapidez e eficiência, e tarifa seu serviço pelo tempo que o profissional\n        levaria para concluí-lo se trabalhasse de maneira ótima. No caso de\n        montagem de pisca-pisca, o profissional leva 30 segundos para remover \n        uma lâmpada já instalada, um minuto para trocar uma lâmpada já \n        instalada por outra de outra cor e dois minutos e meio para inserir uma         nova lâmpada na armação (esta tarefa demanda mais tempo que as demais \n        porque é necessário inserir um novo contato na fiação).\nDado o valor cobrado pela empresa para cada minuto de trabalho, em \n        reais, a sequência desejada de N lâmpadas e a sequência de \n        M lâmpadas montadas na ordem não desejada, calcule o valor \n        do serviço da empresa, em reais.","id":"1833","category":"Paradigmas","statistics":{"level":"8 / 10","submissions":342,"solved":110,"ratio":"32.16%"}}