{"output":"O relatório a ser impresso contém várias linhas. A primeira delas \n        deverá conter a mensagem \"Relatorio Vogon #35987-2\". \n        Em seguida, deve ser impressa, em uma linha, a mensagem \"Distancia \n        entre referencias: d anos-luz\", onde d é a \n        distância entre os dois pontos de referência pelos quais a autoestrada \n        deve passar, em anos-luz, com duas casas decimais de precisão.\nNa linha seguinte deve ser impressa a mensagem \"Setor Oeste:\" e, nas         duas linhas seguintes,  as mensagens \"P planeta(s)\" e \n        \"H bilhao(oes) de habitante(s)\", onde P é o \n        número de planetas que ficaram à esquerda da autoestrada, quando se \n        viaja no sentido do primeiro ponto de referência ao segundo, e \n        H é o total de habitantes destes planetas.\n        De modo semelhante, devem ser produzidas três mensagens equivalentes \n        para o Setor Leste, que fica à direita da autoestrada.\nPor fim, deve ser impressa a mensagem: \"Casualidades: P \n        planeta(s)\", onde P é o número de planetas que estavam na \n        rota da construção da autoestrada e, naturalmente, tiveram que ser \n        dizimados.","input":"A primeira linha da entrada contém as coordenadas \n        X1, Y1, X2, Y2 (-10.000 ≤ Xi, Yi ≤ \n        10.000) dos pontos de referência P1 e P2 pelos \n        quais a autoestrada passará em linha reta, separadas por um espaço em \n        branco. As coordenadas são números inteiros e a unidade de distância \n        é o ano-luz.\nA segunda linha da entrada contém o número N (1 ≤ \n        N ≤ 1.000) de planetas que fazem parte do setor espacial \n        onde a estrada passará. As próximas N linhas contém, cada \n        uma, as coordenadas X e Y (-10.000 ≤ \n        X, Y ≤ 10.000) do planeta e o número H (1 ≤\n        H ≤ 100.000) de habitantes, em bilhões. Estes valores \n        são números inteiros separados por espaços em branco.","level":6,"name":"Vogons!","has_images":false,"description":"Os vogons são uma raça alienígena que habita a Vogosfera, segundo o \n        \"Guia do Mochileiro das Galáxias\", escrito por Douglas Adams. Nas \n        palavras do próprio autor:\n\"Here is what to do if you want to get a lift from a Vogon: \n        forget it. They are one of the most unpleasant races in the Galaxy. Not         actually evil, but bad-tempered, bureaucratic, officious and callous. \n        They wouldn't even lift a finger to save their own grandmothers from \n        the Ravenous Bugblatter Beast of Traal without orders - signed in \n        triplicate, sent in, sent back, queried, lost, found, subjected to \n        public inquiry, lost again, and finally buried in soft peat for three \n        months and recycled as firelighters. The best way to get a drink out of         a Vogon is to stick your finger down his throat, and the best way to \n        irritate him is to feed his grandmother to the Ravenous Bugblatter \n        Beast of Traal. On no account should you allow a Vogon to read poetry \n        at you.\"\nNo romance, os vogons foram os responsáveis pela destruição da \n        Terra, pois ela ficava na rota de construção de uma autoestrada \n        intergalática. Este é típico modo de trabalho vogon: muitas raças já \n        foram exterminadas e planetas inteiros destruídos para que o trânsito \n        entre as galáxias ficasse menos congestionado.\nDados dois pontos de referência, pelos quais a nova autoestrada \n        intergalática passará em linha reta, e as coordenadas e habitantes dos \n        planetas do setor espacial, escreva um programa que gere um relatório \n        para os vogons.","id":"1834","category":"Geometria Computacional","statistics":{"level":"6 / 10","submissions":622,"solved":269,"ratio":"43.25%"}}