{"output":"Para cada caso de teste deverá ser impressa ou a mensagem \n        \"Caso #t: ainda falta(m) E estrada(s)\" ou a \n        mensagem \"Caso #t: a promessa foi cumprida\", conforme for o \n        caso, onde t é o número do caso de teste (cuja \n        contagem tem início no número um) e E é o número mínimo de \n        estradas que devem ser construídas para que a promessa seja \n        cumprida.\nAo final de cada mensagem deve ser impressa uma quebra de linha.","input":"A entrada consiste em uma série de casos de teste. O número \n        T (T ≤ 100) de casos de teste é indicado na \n        primeira linha da entrada.\nCada caso de teste é composto por várias linhas.  A primeira e a \n        segunda linha do caso de teste contém, respectivamente, os valores \n        N (1 ≤ N ≤ 100) e M \n        (0 ≤ M ≤ N(N\n        - 1)/2), onde N é o número de pontos principais da cidade e \n        M o número de estradas já construídas.  Os principais\n        pontos da cidade são identificados sequencialmente por números \n        inteiros, a partir do número um.\nAs M linhas seguintes contém pares de valores X        e Y (1 ≤ X, Y ≤ N), que indicam\n        que existe uma estrada que liga o ponto X ao ponto \n        Y.","level":4,"name":"Promessa de Campanha","has_images":false,"description":"Durante sua campanha eleitoral, o prefeito do município de Barro \n        Bravo prometeu que, até o fim de seu mandato, os cidadãos conseguiriam \n        se locomover entre os principais pontos do município sem passar por \n        nenhum trecho de estrada de terra (quando assumiu o cargo, não era \n        possível ir a lugar algum sem passar pelo barro...).\nA primeira providência que tomou foi finalizar as diversas vias de \n        ligação que haviam sido parcialmente construídas, mas não terminadas. \n        Assim que concluiu esta etapa, já com o orçamento reduzido, o prefeito \n        precisava determinar se a promessa já fora cumprida ou não, e caso não \n        tem sido, quantas estradas ainda deveriam ser construídas para que a \n        promessa se concretizasse.\nEscreva, portanto, um programa que auxilie o prefeito a obter sua\n        resposta.","id":"1835","category":"Grafos","statistics":{"level":"4 / 10","submissions":1741,"solved":870,"ratio":"49.97%"}}