{"output":"Imprima uma linha contendo unicamente o nome do vencedor da partida. Se não é possível definir um único vencedor para a partida, imprima uma linha contendo unicamente o caractere asterisco (*).","input":"A primeira linha da entrada informa o inteiro n (1 ≤ n ≤ 9), seguido da carta virada sobre a mesa no início da partida. Cada uma das 4 linhas seguintes informa o nome de um jogador, seguido de um inteiro m (0 ≤ m ≤ n), o qual representa o número de rodadas que o jogador declarou que faria no início da partida. A ordem em que são informados os jogadores é sempre a mesma ordem em que jogam em cada rodada. Seguem-se por fim n linhas, de modo que a i-ésima dessas linhas informa as 4 cartas que foram jogadas na i-ésima rodada, na ordem em que foram jogadas. Cada carta é informada no formato XY, com X ∈ {4, 5, 6, 7, Q, J, K, A, 2, 3}, Y ∈ {D, S, H, C}, e D, S, H e C correspondendo respectivamente aos naipes ♦, ♠, ♥, ♣. Considere que o nome de cada jogador é composto por no mínimo 1 e no máximo 10 caracteres do conjunto {a, b, …, z, A, B, …, Z}.","level":8,"name":"O Prisioneiro de Azkaban","has_images":false,"description":"Em 1950, quatro homens foram presos acusados de incendiarem a igreja de Chapecó. Se de fato eram os culpados ou não nunca se saberá, mas a fúria do povo é sempre mais rápida a julgar que os tribunais. Preocupado em preservar a integridade física dos prisioneiros, o delegado de polícia local quis transferi-los para Azkaban. “Eles estarão mais seguros nas mãos dos dementadores que nas mãos do povo de Chapecó”, declarou enquanto acertava com o Ministro da Magia os detalhes da transferência, programada para a manhã seguinte.\n\n\t\t\t\t\tEnquanto esperavam sem sono pela transferência que jamais aconteceria, os presos resolveram jogar Dane-se, um jogo muito popular no Brasil. Numa de suas muitas versões, as regras do jogo são:\n\n\t\t\t\t\t\n\t\t\t\t\t\tSão usadas apenas 40 cartas de um baralho francês tradicional com 52 cartas, descartando-se todas as cartas com número 8, 9 ou 10. A ordem crescente básica de valor das figuras empregada no Dane-se é:\n\t\t\t\t\t\n\n\t\t\t\t\t4 5 6 7 Q J K A 2 3\n\n\t\t\t\t\t\n\t\t\t\t\t\tUm dos jogadores distribui a cada jogador n cartas. Depois, ainda vira uma carta sobre a mesa, a qual determina as manilhas do jogo, que são as cartas com figura imediatamente posterior à figura da carta virada na ordem básica. Por exemplo, se é virada uma carta com figura 7, são definidas como manilhas do jogo as cartas Q♦, Q♠, Q♥ e Q♣. Se é virada uma carta com figura 3, as manilhas são 4♦, 4♠, 4♥ e 4♣. As manilhas de uma partida valem mais que qualquer outra carta. Embora o naipe não interfira no valor de cartas que não são manilhas, entre manilhas a ordem crescente de valor dos naipes é:\n\t\t\t\t\t\n\n\t\t\t\t\t♦  ♠  ♥  ♣\n\n\t\t\t\t\t\n\t\t\t\t\t\tUma vez definidas as manilhas da partida, cada jogador tem de dizer quantas das n rodadas ele acha que fará. Todos os jogadores devem declarar seus palpites antes mesmo de começarem as rodadas. Iniciam-se, então, as rodadas, em cada uma das quais cada jogador joga uma de suas cartas revelando-a sobre a mesa. Diz-se que um jogador faz uma rodada se a carta que ele joga naquela rodada é de maior valor que todas as outras cartas jogadas naquela rodada. Quando uma rodada não é feita por jogador algum, o que é possível dado que o desempate por naipe ocorre apenas entre as manilhas, diz-se que aquela rodada embuchou.\n\t\t\t\t\t\tAo final do jogo, cada jogador ganha tantos pontos quanto for a diferença entre o número de rodadas que o jogador disse que faria e o número de rodadas que de fato fez. Vence o jogador com menos pontos.","id":"1840","category":"Ad-Hoc","statistics":{"level":"8 / 10","submissions":289,"solved":110,"ratio":"38.06%"}}