{"output":"Imprima N linhas. Cada linha deve conter duas strings Ci e Dj, indicando que a criança Ci deve ficar com o filhote Dj. Imprima os filhos na mesma ordem em que são descritos na entrada.","input":"A primeira linha contém o inteiro N (1 ≤ N ≤ 200). As próximas N linhas descrevem os filhos de Ned. Cada linha contém N+1 strings. A primeira é o nome da criança. As próximas N strings são os nomes dos lobos em sua ordem de preferência. O primeiro lobo dado na linha é o preferido da criança.  As próximas N linhas descrevem os filhotes de lobo. Cada linha contém o nome do filhote e sua lista de crianças, também em ordem de preferência.\n\nCada string contém no máximo 10 letras maiúsculas e/ou minúsculas.","level":6,"name":"Lobos Stark","has_images":false,"description":"Jon: \"Lorde Stark? Há cinco filhotes, um para cada criança Stark. O lobo é o brasão de sua Casa. Elas devem tê-los.\"\n\nDurante uma viagem, Ned Stark encontrou N filhotes de lobo e decidiu dar um filhote para cada um de seus N filhos. Ned quer fazer tanto as crianças quanto os lobos felizes, e, por isso, deseja encontrar a combinação ideal de lobos e crianças.\nDepois de brincar um pouco com os filhotes, cada filho deu a Ned uma lista de lobos em ordem de preferência. Desta forma, cada criança quer ficar com o filhote que está no topo de sua lista; se isto não for possível, a criança quer ficar com o filhote que aparece em segundo na lista, e assim por diante.\nDepois de observar como cada lobo reage a cada filho, Ned também deduziu, para cada lobo, a lista de crianças que ele quer que sejam seus donos, também em ordem de preferência.\nNed precisa encontrar uma combinação tal que, para toda criança Ci e todo lobo Dj, não ocorre que Ci prefere Dj ao filhote combinado a ela e Dj prefere Ci à criança combinada a ele. Se existe mais de uma combinação possível, Ned deseja aquela em que cada filho tem o melhor lobo (mais preferido) que pode ter.","id":"1852","category":"Paradigmas","statistics":{"level":"6 / 10","submissions":104,"solved":64,"ratio":"61.54%"}}