{"output":"Imprima uma linha para cada operação do tipo Q com sua resposta.","input":"A primeira linha contém um inteiro N (1 ≤ N ≤ 5×104), o número de inimigos inicialmente em sua lista.\n\n\t\t\t\t\tConsidere que todas as pessoas são numeradas de 1 a 109, inclusive. A próxima linha contém N inteiros, descrevendo a lista inicial de Arya. A próxima linha contém um inteiro Q (1 ≤ Q ≤ 5×104), o número de operações. As próximas Q linhas descrevem as operações. Cada operação pode estar em um dos seguintes formatos:\n\n\t\t\t\t\t\n\t\t\t\t\t\tI p e (1 ≤ e, p ≤ 109): Insira a pessoa p depois do inimigo e na lista. É garantido que e está na lista, e p não está na lista;\n\t\t\t\t\t\tR e (1 ≤ e ≤ 109): Remova o inimigo e da lista. É garantido que e está na lista;\n\t\t\t\t\t\tQ a b (1 ≤ a, b ≤ 109): Determine quantos inimigos estão na lista entre a e b, excluindo ambos. É garantido que a e b estão na lista.","level":10,"name":"A Lista da Morte de Arya","has_images":false,"description":"Arya: \"Cersei. Walder Frey. Montanha. Meryn Trant.\"\n\n\t\t\t\t\tPara se manter motivada, Arya sempre lembra a lista de inimigos que ela mais odeia. O principal objetivo de sua jornada é matar todos na sua lista!\n\n\t\t\t\t\tEntretanto, às vezes algum inimigo dela pode ser morto por outra pessoa.  Quando ela descobre que tal inimigo morreu, ela o remove da sua lista.  Além disso, Arya também pode fazer novos inimigos durante sua jornada. Quando ela faz um novo inimigo, tal inimigo é incluído na sua lista.\n\n\t\t\t\t\tArya quer matar seus inimigos um por um, na mesma ordem em que aparecem na sua lista. A qualquer momento, ela pode se perguntar quanto tempo irá levar para matar todos que estão entre dados dois inimigos. Para tal, dados dois inimigos a e b, ela deve determinar quantos inimigos estão na lista entre a e b, excluindo ambos. Ajude Arya respondendo tais perguntas.","id":"1856","category":"Estruturas e Bibliotecas","statistics":{"level":"10 / 10","submissions":1535,"solved":113,"ratio":"7.36%"}}