{"output":"Imprima uma linha contendo unicamente o valor exato da área da terra que Robb Stark recebeu, sem zeros desnecessários à esquerda ou à direita.","input":"A primeira linha da entrada consiste de dois inteiros, N e B (0 ≤ N < 100, 1 ≤ B ≤ 103), os quais representam respectivamente o número de construções já existentes no mapa e o limite para a área do território de Robb Stark estabelecido por Lorde Frey. A segunda linha consiste de dois inteiros, Xm e Ym (0 ≤ Xm, Ym ≤ 104), os quais representam respectivamente a latitude e a longitude da localidade que Robb escolheu para a construção da mansão. Cada uma das N linhas seguintes é composta por dois inteiros X e Y (0 ≤ X, Y ≤ 104), os quais representam respectivamente a latitude e a longitude de cada construção.","level":10,"name":"Prelúdio de um Casamento Vermelho","has_images":true,"description":"Poucos sabem que, na série de eventos que antecederam o sangrento Casamento Vermelho, Lorde Frey prometeu a Robb Stark uma parte do território das Terras Fluviais, além de uma mansão. As exatas palavras que Lorde Frey disse a Robb Stark, numa reunião nas Gêmeas, foram:\n\n\t\t\t\t\t— Aqui está o mapa das Terras Fluviais e de todas as construções que existem nelas. Coloque um prego em cima da localidade onde você deseja que seja construída sua mansão. Escolha a localidade que quiser, desde que ela não fique em cima nem ao norte de uma construção já existente. Ainda, se a localidade que você escolher ficar na mesma latitude que outra construção, a outra construção deverá estar mais a leste que a sua localidade.\n\n\t\t\t\t\tE assim procedeu Robb Stark. Lorde Frey, então, continuou:\n\n\t\t\t\t\t— Pegue agora estes outros pregos e ponha-os em cima de construções já existentes, para que lhe pertençam também. Escolha as construções que quiser. Saiba que, após terminar, eu esticarei este elástico em volta de todo o mapa e o soltarei, de modo que o elástico seja parado pelos pregos. Todo o território no interior ou sobre a fronteira da região definida pelo elástico será seu. No entanto, não abuse de minha benevolência. Se a área do seu território exceder B metros quadrados, eu lhe cortarei fora a cabeça aqui mesmo.\n\n\t\t\t\t\tRobb fez sua escolha de modo a possuir a maior área de terra possível mantendo sua cabeça, pelo menos por um tempo. Você é capaz de adivinhar qual área ele obteve?","id":"1857","category":"Geometria Computacional","statistics":{"level":"10 / 10","submissions":252,"solved":32,"ratio":"12.70%"}}