{"output":"Imprima uma linha contendo o número máximo de soldados que podem ser mortos.","input":"A primeira linha contém dois inteiros N e M (0 ≤ M < N ≤ 5×104). As próximas N linhas fornecem as posições dos soldados. A i-ésima linha contém dois inteiros x[i] e y[i] (-400 ≤ x[i], y[i] ≤ 400). Não há dois soldados na mesma posição.  As próximas M linhas contém dois inteiros i e j cada (1 ≤ i, j ≤ N, i ≠ j), descrevendo a lista fornecida pelo espião.","level":10,"name":"O Contra-ataque de Ramsay","has_images":false,"description":"Ramsay: \"Não preciso de um exército. Preciso de 20 homens bons.\"\n\n\t\t\t\t\tOs Boltons conquistaram o castelo de Winterfell e agora precisam protegê-lo da invasão do \"Rei\" Stannis. Os N soldados de Stannis estão posicionados entre Castle Black, que fica a nordeste de Winterfell, e Winterfell. Para cada soldado i (1 ≤ i ≤ N), os Boltons sabem sua posição (x[i], y[i]) no mapa.\n\n\t\t\t\t\tRamsay Bolton decidiu contra-atacar antes que a invasão ocorra, enviando seus homens para matar alguns dos soldados de Stannis. Ramsay quer que eles morram um de cada vez, em uma ordem tal que seus homens precisem viajar apenas para o norte e para o leste, e tal que todo soldado deve ser mais forte que os que morreram antes dele (isto é loucura, mas Ramsay é mesmo louco).\n\n\t\t\t\t\tEm outras palavras, Ramsay quer encontrar uma sequência de soldados (s1, s2, ..., sK) tal que, para todo 1 < i ≤ K:\n\n\t\t\t\t\t\n\t\t\t\t\t\tx[si] > x[si-1];\n\t\t\t\t\t\ty[si] > y[si-1]; e\n\t\t\t\t\t\tsi é mais forte que si-1\n\t\t\t\t\t\n\n\t\t\t\t\tUm espião forneceu a Ramsay uma lista de M pares ordenados de soldados na forma (i, j), indicando que o soldado i é mais forte que o soldado j. Note que esta relação é transitiva, isto é, se i é mais forte que j e j é mais forte que k, então i é mais forte que k, mesmo que o par (i, k) não apareça na lista.   Além disso, para qualquer par de soldados i e j, se não é possível concluir que um soldado é mais forte que o outro através da lista, então i não é considerado mais forte que j, e nem j é considerado mais forte que i.  Por fim, a lista é dada de tal forma que, para todo soldado i, existe no máximo um soldado j tal que (i, j) está na lista.\n\n\t\t\t\t\tSua tarefa é determinar o número máximo de soldados que podem ser mortos pelos homens de Ramsay.","id":"1863","category":"Estruturas e Bibliotecas","statistics":{"level":"10 / 10","submissions":388,"solved":51,"ratio":"13.14%"}}