{"output":"Para cada caso de teste, imprima, caso o balão tenha passado ileso, a palavra “OUT”, seguida da posição da coluna da qual o mesmo saiu no final; e caso tenha estourado no meio do caminho,  a palavra “BOOM”, e em qual linha e coluna o mesmo estourou.","input":"Haverá diversos casos de teste. Cada caso de teste inicia com três inteiros, L, C e P (1 ≤ L ≤ C ≤ P ≤ 9), indicando a quantidade de L linhas e C colunas da matriz e P a posição da coluna a qual o balão será solto.\n\n\t\t\t\t\tO último caso de teste é indicado quando L = C = P = 0, sendo que este caso não deve ser processado.","level":2,"name":"Ventiladores e Balões","has_images":true,"description":"Em um feriado, os empregados da empresa fabricante de ventiladores Irmãos Fulano, mais conhecida como IF, propuseram uma gincana. Dada uma caixa retangular, de grandes dimensões, formadas por compartimentos, contendo apenas a parede frontal e traseira, com todos os compartimentos acessíveis internamente, ventiladores pequenos, mas potentes, e sem a grade de proteção, foram amarrados internamente na caixa, em alguns compartimentos. Após isto, um balão é solto dentro da caixa, na reta de uma determinada coluna de compartimentos. Cada ventilador estará ligado com um determinado nível de força. Então, é verificado o ventilador mais próximo à esquerda e à direita do balão. Se ambos estiverem com o mesmo nível de força, o balão continua descendo normalmente. Caso seja diferente, o balão será empurrado para o lado do ventilador com o nível mais fraco, e o mesmo se deslocará tantas colunas forem a diferença entre o maior nível e o menor entre os ventiladores. Veja o caso abaixo em todos os detalhes:\n\n\t\t\t\t\t\n\n\t\t\t\t\t\n\t\t\t\t\t\tBalão solto na coluna 6;\n\t\t\t\t\t\tNa primeira linha, o ventilador mais próximo à direita do balão tem dois níveis a mais que o mais próximo da esquerda, deslocando o balão para a coluna 4;\n\t\t\t\t\t\tNa segunda linha, o ventilador mais próximo à direita do balão tem dois níveis a mais que o mais próximo da esquerda, deslocando o balão para a coluna 2;\n\t\t\t\t\t\tNa terceira linha, o ventilador mais próximo à direita do balão tem o mesmo nível em relação ao mais próximo da esquerda, mantendo o balão na coluna 2;\n\t\t\t\t\t\tNa quarta linha, o ventilador mais próximo à direita do balão tem dois níveis a menos que o mais próximo da esquerda, deslocando o balão para a coluna 4, saindo sem estourar;\n\t\t\t\t\t\n\n\n\t\t\t\t\tSe, na mesma caixa, o balão fosse solto na coluna 2, o balão teria estourado na linha 1 e coluna 1, nas hélices do ventilador que se encontra neste local.\n\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t                \t\n\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\tEscreva um programa que, dada uma matriz, representando a caixa e uma coluna, na qual o balão será solto, e verifique se o mesmo passa por todos os ventiladores sem estourar.","id":"1870","category":"Ad-Hoc","statistics":{"level":"2 / 10","submissions":553,"solved":378,"ratio":"68.35%"}}