{"output":"Para cada caso de teste, imprima o resultado da partida no tempo normal, baseado nos gols que foram marcados.","input":"Haverá diversos casos de teste. O primeiro número a ser lido será um inteiro C, representando a quantidade de casos de teste. Cada caso de teste se inicia com um número inteiro P, representando a quantidade de gols na partida. A seguir serão lidos P linhas, cada um com dois caracteres M e S, indicando a primeira letra do time que marcou o gol e a primeira letra do time que sofreu o gol, respectivamente.","level":3,"name":"Tribol","has_images":true,"description":"Na cidade de Triangulândia, o maior sonho de sua população era construir um campo de futebol, mas lá todos os terrenos são triangulares. Se fosse para fazer um campo retangular, uma boa parte do terreno não seria aproveitada para construir o campo. Então, os irmãos Hipo e Tenusa tiveram uma grande ideia: A criação de um novo jogo, derivado do futebol, mas jogado em um campo triangular, e chamaram o jogo de Tribol. As regras eram simples:\r\n\r\nJogam três equipes ao mesmo tempo: Red, Green e Blue.\r\n\r\n\r\n\tA partida tem um tempo de trinta minutos.\r\n\tA equipe que fizer um gol no adversário do sentido anti-horário ao mesmo, é um gol normal.\r\n\tA equipe que fizer um gol no adversário do sentido horário ao mesmo, vale o dobro.\r\n\tSe as três equipes fizerem a mesma quantidade de gols, ocorre um trempate\r\n\tSe as duas equipes que fizerem mais gols tiverem feito a mesma quantidade, ocorre um empate, e o jogo é decidido por pênaltis.\r\n\tA equipe que fizer mais gols, vence.\r\n\r\n\r\nExemplo de partida. Os times estão dispostos no campo igual à imagem abaixo.\r\n\r\n\n\t\t\t\t\t\r\n\r\n\tA equipe Green faz um gol na equipe Blue e um gol na equipe Red, totalizando 3 gols;\r\n\tA equipe Blue faz dois gols na equipe Green, totalizando 2 gols;\r\n\tA equipe Red faz dois gols na equipe Green, totalizando 4 gols e vencendo a partida. ","id":"1875","category":"Geometria Computacional","statistics":{"level":"3 / 10","submissions":2979,"solved":1348,"ratio":"45.25%"}}