{"output":"Para cada caso de teste, imprima a linha \"Lucky Denis!\" se a função pode ser usada por Denis, ou \"Try again later, Denis...\" em caso contrário.","input":"A entrada é composta por vários casos de teste e termina com fim de arquivo.\n\n\t\t\t\t\tA primeira linha de um caso de teste é composta por dois inteiros N e M, que são respectivamente o número de torneios realizados por Denis e o número de alunos que irão competir em cada torneio, onde 1 ≤ N ≤ 3 e 1 ≤ M ≤ 10.\n\n\t\t\t\t\tEm seguida são dados N inteiros c1, c2, ..., cN, os coeficientes da função de Denis, onde ci ≥ 1 para todo i.\n\n\t\t\t\t\tEm um caso de teste, é garantido que os valores da função de Denis não passam de 109.","level":3,"name":"Torneios em Sequência","has_images":false,"description":"Denis é um professor de programação competitiva muito justo. Em sua disciplina, ele faz uma sequência de N torneios de programação para avaliar seus M alunos. A última ideia de Denis foi premiar os três alunos que se saírem melhor nos torneios. Para isto, Denis teve a ideia de criar a seguinte função classificatória.\n\n\t\t\t\t\tf(T1,T2,...,TN) = c1T1 + c2T2 + ... + cNTN\n\n\t\t\t\t\tNa função, a N-upla (T1,T2,...,TN) indica as classificações de um aluno nos N torneios. Por exemplo, se há dois torneios, um aluno fica em terceiro lugar no primeiro torneio e em primeiro lugar no segundo torneio, seu par ordenado é (3, 1).\n\t\t\t\t\tComo Denis quer ser o mais justo possível, ele não quer que haja possibilidade de empate. Como ele também está com preguiça de tentar provar que sua função é livre de empates, ele pediu a sua ajuda para fazer um programa que, dados os coeficientes c1, c2, ..., cN, determine se a função pode de fato ser usada para classificação. Ou seja, se a função não irá classificar dois alunos distintos igualmente.\n\t\t\t\t\tObserve que o software utilizado por Denis para classificar seus alunos em um torneio é livre de empates. Ou seja, não é possível que dois alunos fiquem em primeiro lugar em um mesmo torneio, ou em segundo lugar, etc.","id":"1878","category":"Paradigmas","statistics":{"level":"3 / 10","submissions":736,"solved":379,"ratio":"51.49%"}}