{"output":"Para cada instância, imprima um número real arredondado para 3 casas decimais com o valor mínimo esperado. O número deve sempre ser impresso com as 3 casas decimais.","input":"A primeira linha da entrada contém um inteiro T indicando o número de instâncias.\n\nCada instância inicia com 3 inteiros, N, M (1 ≤ N, M ≤ 100.000) e K (1 ≤ K ≤ 1000), representando o número de ilhas, a quantidade de barqueiros e o custo da viagem de avião.\n\nAs próximas M linhas contêm 3 inteiros cada, A, B, C (1 ≤ C ≤ 1.000), indicando que existe um barqueiro cobrando C baht para ir da ilha A para a B, ou da ilha B para a A. Entre cada par de ilhas existe no máximo um barqueiro.","level":10,"name":"Passeios Aleatórios pela Tailândia","has_images":false,"description":"A Tailândia tem algumas centenas de ilhas. Todas as ilhas de tamanho razoável têm pequenas pistas de voo, onde aviões de pequeno porte operam. O sistema de transporte, no entanto, é bastante estranho às vistas de um estrangeiro...\n\nOs barqueiros são muito confiáveis. Partindo, por exemplo, de Ko Khang Khao (เกาะค้างคาว), você consegue um barco para as ilhas vizinhas a preços razoáveis: Ko Sichang (เกาะสีชัง), Ko Kham Yai (เกาะขามใหญ่), Ko Kham Noi (เกาะขามน้อย), Ko Ram Dok Mai (เกาะร้ามดอกไม้), Ko Prong (เกาะปรง), ou Ko Yai Thao (เกาะใหญ่ท้าว) (sim, Ko significa ilha em tailandês).\n\nOs pilotos de avião, por sua vez, são muito temperamentais. Você pega o avião e ele deixa você em uma ilha aleatória, que ele decide de acordo com sua própria vontade. Toda ilha tem a mesma probabilidade de ser escolhida pelo piloto, inclusive a ilha de origem. Apesar de o destino ser incerto, toda viagem de avião tem o mesmo preço fixo.\n\nAssim, quando você quer ir de uma ilha a outra tem sempre duas opções. Pegar um barco para uma ilha vizinha, cujo preço varia de acordo com o trecho percorrido, ou arriscar e pegar um avião, pagando o preço fixo de K baht.\n\nConsidere que as ilhas são numeradas de 1 a N. Sua tarefa neste problema é determinar o valor mínimo esperado de uma viagem a ser feita da ilha 1 para a ilha N.","id":"1882","category":"Ad-Hoc","statistics":{"level":"10 / 10","submissions":163,"solved":1,"ratio":"0.61%"}}