{"output":"Para cada instância, imprima uma linha contendo 'Y' se for possível que Nai Khanom Tom vença todos os Rajasis; imprima 'N' caso contrário.","input":"A entrada é composta por diversas instâncias. A primeira linha da entrada contém um inteiro T indicando o número de instâncias.\n\n\t\t\t\t\tA primeira linha de cada instância contém 3 inteiros, N (1 ≤ N ≤ 2000), H (0 ≤ H < 109) e K (1 ≤ K ≤ 2000), onde H representa o valor inicial dos pontos de vida. Cada uma das N linhas seguintes contém 2 inteiros, xi e yi (1 ≤ xi, yi < 109).","level":10,"name":"Lutando Contra os Rajasi","has_images":false,"description":"O Muay Thai é uma arte marcial originária da Tailândia. Muitos praticantes dessa arte são considerados lendas pelo povo tailandês. Dentre todos eles, Nai Khanom Tom é considerado o \"pai\" do muay thai. A seguinte história faz parte da lenda desse lutador.\n\n\t\t\t\t\tO rei Mangra da Birmânia organizou uma luta entre um preso de guerra tailandês e um guerreiro birmano para decidir qual tinha o melhor estilo de luta. Nai Khanom Tom foi escolhido para lutar e derrotou com muita facilidade seu adversário. Porém, o árbitro da luta alegou que isso aconteceu pela dança (Ram Muay) feita por Nai Khanom Tom. Por isso, o rei mandou a que Nai lutasse contra dez guerreiros birmanos, um após o outro. Ainda assim, o resultado foi o mesmo, Nai Khanom Tom venceu todos. Após ver as habilidades de Nai, o rei Mangra concedeu-lhe a liberdade.\n\n\t\t\t\t\tEssa história passou de geração a geração. Existem até pessoas que acreditam que Nai Khanom Tom podia vencer qualquer quantidade de adversários, incluindo seres da mitologia tailandesa.\n\n\t\t\t\t\tVocê é um grande fã do muay thai e deseja testar a veracidade dessa afirmação. Suponha que Nai Khanom Tom possui H pontos de vida e tem que lutar contra N Rajasis. Cada um deles possui xi pontos de vida e yi pontos de recuperação. Para vencer uma luta, os pontos de vida de Nai devem de ser maiores do que os pontos de vida do Rajasi. Após lutar, Nai perde xi pontos de vida e recupera yi pontos em seguida. Além disso, pelo seu treinamento Nai conhece K feitiços que podem ser usados para derrotar um Rajasi instantaneamente. Porém, nesse caso, ele não perde nem ganha os pontos de vida como o caso anterior.\n\n\t\t\t\t\tAgora, chegou a sua oportunidade de provar essa hipótese. Dada a descrição de um conjunto de N Rajasis, você deve responder se Nai Khanom Tom pode vencer todos eles. Note que Nai Khanom Tom pode lutar com os Rajasis na ordem que ele quiser.","id":"1884","category":"Ad-Hoc","statistics":{"level":"10 / 10","submissions":598,"solved":74,"ratio":"12.37%"}}