{"output":"Para cada instância, imprima uma linha contendo um único caractere. Imprima 'Y' se for possível fazer o sorteio; caso contrário, imprima 'N'.","input":"A entrada é composta por diversas instâncias. A primeira linha da entrada contém um inteiro T indicando o número de instâncias.\n\nCada instância é composta por duas linhas. A primeira linha contém 2 inteiros, N (1 ≤ N ≤ 1018) e K (0 ≤ K ≤ 105), que representam o número de pessoas e o número de dados, respectivamente. A segunda linha contém K inteiros. O i-ésimo inteiro dessa linha, digamos fi (1 ≤ fi ≤ 1018), representa o número de faces do i-ésimo dado.","level":7,"name":"Loteria Tailandesa","has_images":false,"description":"Borommarachathirat IV (สมเด็จพระบรมราชาธิราชที่ 4) foi um monarca do reino de Ayutthaya no século XVI. Borommarachathirat IV decidiu organizar uma loteria para sua população de súditos, utilizando uma certa quantidade de dados. São dados tradicionais tailandeses, que podem ter várias faces, cada face podendo ocorrer com a mesma probabilidade.\n\nPor seu forte senso de justiça, o monarca exige que o sorteio seja perfeitamente justo, ou seja, que cada um de seus súditos tenha a mesma chance de ser sorteado. O sorteio consiste de um número finito de lançamentos e, após cada lançamento, é decidido se houve algum vencedor ou se será necessário realizar um novo lançamento. Os lançamentos devem seguir as seguintes regras:\n\n\n\tvários dados podem ser jogados simultaneamente no mesmo lançamento;\n\tresultados anteriores podem influenciar na escolha dos dados para os lançamentos seguintes;\n\tum mesmo dado pode ser escolhido para vários lançamentos.\n\n\nO importante é garantir que, como resultado do sorteio, cada um dos habitantes tenha iguais chances de ser sorteado. Veja que nem sempre isso é possível. Por exemplo, se tivermos 5 pessoas e apenas um dado de 6 faces, não há como realizar o sorteio. Já com este dado é possível realizar o sorteio se a população for de 3, 6, 18, ou 36 pessoas, por exemplo.\n\nSua tarefa neste problema é fazer um programa para ajudar o monarca a decidir se é possível realizar o sorteio com os dados disponíveis.","id":"1885","category":"Ad-Hoc","statistics":{"level":"7 / 10","submissions":105,"solved":35,"ratio":"33.33%"}}