{"output":"Para cada instância, imprima uma única linha contendo o numero mínimo de guardas necessários para vigiar todos os templos reais da cidade.","input":"A entrada é composta por diversas instâncias. A primeira linha da entrada contém um inteiro T indicando o número de instâncias.\n\nCada instância consiste de diversas linhas. A primeira linha contém dois inteiros, N (1 ≤ N ≤ 103) e M (1 ≤ M ≤ 5*103) que representam o número de templos reais de Phuket e o número de ruas entre templos reais, respectivamente. Cada templo e identificado por um inteiro entre 1 e N. As seguintes M linhas descrevem as ruas da cidade. Cada rua é descrita por dois inteiros que representam os templos que ela liga.","level":6,"name":"Resguardando os Templos","has_images":false,"description":"Existem milhares de templos budistas na Tailândia. Em geral, os templos budistas são chamados de \"wat\". Além disso, existem alguns templos que recebem uma distinção pela sua importância e são chamados de \"templos reais\". Um exemplo desse último tipo é o templo \"Wat Phra Kaew\", localizado no Grande Palácio de Bangkok. Esse templo acolhe a imagem do Buda Esmeralda, que é a mais venerada na Tailândia. Em 2016, a final mundial do ACM ICPC será realizada em Phuket, Tailândia. Por isso, espera-se que o turismo se incremente nessa cidade. Isso levou às autoridades de Phuket a pensar em melhorar a segurança dos templos reais da cidade.\n\nPor esta razão a Unidade de Segurança de Phuket (USP) contratou a pesquisadora Lua \"a engenhosa\" Kuratowski. A USP está interessada em resolver o seguinte problema, dados N templos reais e M ruas que ligam esses templos, posicionar guardas nessas ruas de forma que todo templo real seja vigiado. Consideramos que um templo é vigiado se pelo menos uma das ruas que tem como extremo esse templo é vigiada por algum guarda. Por outro lado, as ruas foram construídas de forma que sempre existe uma sequência de ruas que liga dois templos quaisquer. Além disso, por costumes ancestrais de Tailândia, se fazemos uma trilha pelos templos reais da cidade, sempre andando por ruas distintas e visitando templos distintos até retornar ao templo de partida, sempre temos a certeza de ter passado por um número par de ruas, já que existe certa superstição com os números ímpares.\n\nComo Lua é muito esperta, basta-lhe apenas olhar a descrição dos templos de Phuket, que ela já sabe qual é a resposta ótima (aquela que usa o número mínimo de guardas). Ela escreveu a resposta em um papel, enquanto assobiava \"Elephant Gun\", e o entregou à USP.\n\nEla sabe que você deseja participar da final mundial do próximo ano, e considera que este é um bom problema para testar suas habilidades. Por isso, desafia a você a resolvê-lo.","id":"1886","category":"Ad-Hoc","statistics":{"level":"6 / 10","submissions":231,"solved":119,"ratio":"51.52%"}}