{"output":"Para cada instância, imprima Q linhas. A i-ésima linha desse grupo de Q linhas deve conter um único inteiro que representa o custo mínimo de manutenção do sistema após a adição da i-ésima via.","input":"A entrada é composta por diversas instâncias. A primeira linha da entrada contém um inteiro T indicando o número de instâncias.\n\nCada instância é composta por diversas linhas. A primeira linha de cada instância contém três inteiros, N, M e Q (descritos no enunciado, 1 ≤ N, M, Q  ≤ 3*104) separados por um espaço. As seguintes M linhas descrevem as vias iniciais do sistema. Cada via é representada por três inteiros a, b e c (1 ≤ a, b ≤ N e 1 ≤ c ≤ 3*104), onde a e b representam as cidades que são ligadas por essa via, e c é o custo de manutenção. As Q linhas seguintes representam as vias adicionadas ao sistema. A i-ésima linha desse grupo de Q linhas descreve a i-ésima via adicionada ao sistema através de três inteiros, como no caso anterior.","level":9,"name":"As Vias Férreas Kunming-Cingapura","has_images":false,"description":"A via férrea Kunming-Cingapura é um conjunto de vias (já construídas e em plano de construção) que têm como objetivo ligar diferentes cidades da Ásia. Esse projeto começou em 1900 com a proposta de construir uma via férrea que ligasse a cidade de Kunming (China) a Cingapura, por parte do império britânico. Depois, em 1918, essa via férrea foi conectada ao conjunto de vias de Tailândia mediante uma via férrea que ligava Bangkok e Cingapura. No ano 2000, a ASEAN (Associação de Nações do Sudeste Asiático) propôs completar esse sistema de vias férreas.\n\nO término desse projeto está previsto para o ano 2020. Devido à importância desse sistema para a integração do sudeste asiático, as empreiteiras responsáveis têm contactado você para calcular o custo mínimo para manter este sistema ao longo do tempo. Cada via (já construída e por construir) tem um custo de manutenção. O que se deseja é, dadas as N cidades que o sistema Kumming-Cingapura liga, as M vias iniciais do sistema e as Q vias que serão adicionadas ao longo do tempo, calcular o custo mínimo para manter o sistema conectado após construir cada uma dessas Q vias. Consideramos que o sistema está conectado se, para cada par de cidades existe um conjunto de vias que as ligam.","id":"1887","category":"Ad-Hoc","statistics":{"level":"9 / 10","submissions":127,"solved":33,"ratio":"25.98%"}}