{"output":"Para cada instância, imprima um número real arredondado para 3 casas decimais com a diferença mínima esperada entre as duas inscrições. Imprima a resposta com exatamente 3 casas decimais.","input":"A primeira linha da entrada contém um inteiro T indicando o número de instâncias.\n\nCada instância inicia com 3 inteiros, N, M (1 ≤ N, M ≤ 3.000), e K (0 ≤ K ≤ 100.000), onde N é o tamanho da primeira inscrição e M é o tamanho da segunda inscrição. As próximas duas linhas contém, respectivamente, a primeira e a segunda inscrição. Uma inscrição consiste de uma cadeia de caracteres de 'a' a 'z'.","level":9,"name":"Os chedis de Kamphaeng Phet","has_images":false,"description":"Um chedi (conhecido também como estupa, pagode ou dágaba) é um monumento geralmente em formato de torre cônica construído sobre os restos mortais de uma pessoa importante da religião budista. Alguns sítios históricos tailandeses contêm dezenas desses monumentos, muitos deles dedicados a monges ou líderes religiosos antigos (bhikkhu - ภิกษุณี, como são chamados na Tailândia). Vários desses monges dedicaram suas vidas à contemplação e oração a diferentes entidades. Para citar um exemplo, no sítio de Kamphaeng Phet encontram-se vários chedi em que as inscrições fazem referência a Garuda (ครุฑ) (não confunda com o personagem homônimo do Street Fighter). O mesmo se repete no sítio de Si Satchanalai e de Sukhothai.\n\nA língua tai tem diferenças muito sutis entre as diferentes letras, que torna a análise dos especialistas extremamente difícil. Por exemplo, quando qualquer símbolo da palavra correspondente ao deus Ramakien (รามเกียรติ์) é mudado, seu significado é completamente alterado. Lembrando que algumas dessas ruínas têm mais de 700 anos, estes escritos já sofrem a ação do tempo e de vândalos há séculos. Assim, o trabalho desses pesquisadores é muito complicado. Um outro exemplo é o par de inscrições abaixo encontrada em chedis diferentes.\n\nจัดษุตังขึ้นโดยพรภิะบมพุธานุญาษุ\n\nจัดตั้งขึ้โกดยพระบรมษุพุทธานญาต\n\nOs especialistas acreditam que se refiram à mesma entidade. Para chegar a essa conclusão, eles desenvolveram um método que chamam de análise da diferença probabilística mínima.\n\nEssa análise funciona da seguinte maneira. Sejam a = a1a2...aN e b = b1b2...bM duas inscrições com N e M caracteres, respectivamente. O valor do parâmetro chamado diferença é inicializado com zero. A cada passo, analisa-se um par de caracteres (ai, bj), com 1 ≤ i ≤ N + 1 e 1 ≤ j ≤ M + 1, começando por (a1,b1). Note que quando  i = N + 1, ai é o caracter vazio e o mesmo vale para bj quando j = M + 1. Se ai = bj, pode-se considerar que existe uma correspondência entre tais caracteres nas inscrições e trocar o par atual por (ai+1, bj+1). Tal correspondência nunca existe se ai ≠ bj e um caracter de uma inscrição nunca pode corresponder a dois caracteres da outra inscrição. Se for considerado que não existe correspondência entre os caracteres do par, então o valor da diferença deve ser aumentada por uma das seguintes formas:\n\n\n\t\n\tadicionando 1 à diferença e trocando o par atual por (ai+1, bj) ou por (ai, bj+1);\n\t\n\t\n\tadicionado K à diferença e trocando o par atual por (ai+x, bj+y), onde x e y são escolhidos aleatoriamente com distribuição uniforme nos intervalos [1, N-i+1] e [1, M-j+1], respectivamente. Se i > N, apenas y varia aleatoriamente. Se j > M, apenas x varia aleatoriamente.\n\t\n\n\nA análise termina quando os caracteres ai e bj são ambos o caracter vazio. Note que o valor da diferença pode variar de acordo com as escolhas tomadas.\n\nOs especialistas consideram que quanto menor for a diferença obtida, maior será a correspondência entre as inscrições. Assim, eles pedem que você escreva um programa para encontrar a diferença mínima esperada entre duas inscrições.","id":"1888","category":"Ad-Hoc","statistics":{"level":"9 / 10","submissions":67,"solved":23,"ratio":"34.33%"}}