{"output":"Para cada instância, imprima uma única linha contendo a área mínima para os dados da instância, arredondado para 2 casas decimais; se não for possível formar um triângulo com as larvas, imprima -1.\n\n.","input":"A entrada é composta por diversas instâncias. A primeira linha da entrada contém um inteiro T indicando o número de instâncias.\n\nCada instância consiste de um inteiro N (1 ≤ N ≤ 2*103), representando o número de larvas, seguido de N números reais, representando seus comprimentos. O comprimento de cada larva é um número real entre 1 e 500.","level":8,"name":"Treinando com as Larvas de Phuket","has_images":false,"description":"A culinária tailandesa é conhecida mundialmente por tentar combinar especiarias de forma a sempre ter presente num prato os elementos doce (açúcar, frutas, pimentões), apimentado, azedo (vinagre, tamarindo, lima) e salgado (shoyu, molho de peixe). O prato mais exótico, que sempre é oferecido aos turistas, é o que contém larvas de inseto fritas. O paladar ocidental costuma rejeitar a ideia de comer larvas, mas elas são muito apreciadas na Tailândia e disputadas em festas e encontros. As crianças tailandesas costumam brincar com a comida e, em particular, adoram construir triângulos usando as larvas fritas como arestas.\n\nMarcos \"o resolvedor\" de Rubik ajuda no treinamento de alunos de sua universidade para uma famosa competição de programação de computadores. No ano que vem, a final mundial dessa competição será em Phuket, na Tailândia.\n\nDe conhecimento desse costume das crianças tailandesas, Marcos teve uma ideia para um treino especial. A ideia é preparar uma grande quantidade de larvas fritas de diversos comprimentos. Cada um de seus amigos, em sequência, deve selecionar 3 delas para formar um triângulo e precisará comer uma quantidade de larvas fritas proporcional à área do triângulo formado.\n\nMarcos espera que, para comer menos larvas fritas possível, você escreva um programa para escolher as larvas que formam um triângulo de área mínima. Dessa forma, além de treinar suas habilidades de programação, você também estará treinando para enfrentar a culinária tailandesa. Caso goste dessa iguaria, você pode usar esse programa para ajudar seus amigos, fazendo com que mais larvas fritas sobrem na sua vez.","id":"1889","category":"Ad-Hoc","statistics":{"level":"8 / 10","submissions":347,"solved":105,"ratio":"30.26%"}}