{"output":"Para cada instância, imprima em uma linha Y se for possível remover todas as moedas, ou N caso contrário. Se for possível remover todas as moedas, a linha seguinte deve conter uma lista de N inteiros separados por espaços, cada qual representando o número de uma moeda, indicando a sequência em que elas devem ser removidas. Caso haja mais de uma sequência possível, imprima a lexicograficamente menor.","input":"A primeira linha da entrada contém um inteiro T indicando o número de instâncias.\r\n\r\nCada instância é dada por um inteiro N (0 ≤ N ≤ 105), representando o número de moedas, seguido por uma cadeia de comprimento N, formada pelos caracteres 'B' (face branca exposta) e 'D' (face dourada exposta), representando uma configuração inicial.","level":6,"name":"Removendo Moedas no Kem Kradãn","has_images":false,"description":"Andréh e Andréas são dois amigos multiperitos que gostam muito de jogos. Sabendo que vários de seus amigos anseiam por uma viagem a Phuket, na Tailândia, Andréh e Andréas querem desafiar\r\n\r\nseus amigos em um tradicional jogo tailandês, o Kem Kradãn.\r\n\r\nKem Kradãn (เกมกระดาน) é um jogo de tabuleiro tailandês existente desde o século II a.C. As peças do jogo são N moedas em que uma das faces é dourada e a outra é branca. Inicialmente as moedas são dispostas em linha sobre o tabuleiro e numeradas de 1 a N, da esquerda para a direita.\r\n\r\nQuando uma moeda de número i está com a face dourada exposta, ela pode ser retirada da mesa. Ao fazê-lo, as moedas de números i-1 e i+1, caso existam e ainda estejam no tabuleiro, são revertidas. Isto é, se estavam com a face dourada exposta, passam a ficar com a face branca exposta e vice-versa. O jogo consiste em tentar remover todas as moedas da mesa.\r\n\r\nAntes de desafiar seus amigos, Andréh e Andréas querem ter certeza que as configurações escolhidas para o desafio têm solução. Para ajudá-los, dada uma configuração inicial, você deve determinar se é possível remover todas as moedas e, se possível, mostrar como fazer isso.","id":"1891","category":"Ad-Hoc","statistics":{"level":"6 / 10","submissions":321,"solved":161,"ratio":"50.16%"}}