{"output":"A saída esperada consiste em duas linhas. A primeira linha contém o custo mínimo da árvore. A segunda linha contém a sequência genética do indivíduo de índice (N*2)-1, que sempre é a raiz da árvore.","input":"A entrada consiste de múltiplas linhas. A primeira linha contém 2 inteiros N (3 ≤ N ≤ 10000) e L (1 ≤ L ≤ 1000), representando o número de espécies e o comprimento dos códigos. As próximas N linhas contêm as sequências genéticas dos indivíduos das folhas (1, ..., N). As próximas (N-1)*2 linhas contêm dois inteiros A (1 ≤ A ≤ (N*2)-1) e B (1 ≤ B ≤ (N*2)-1) representando que existe uma ligação entre o individuo de índice A e o individuo de índice B.","level":10,"name":"Filogenia","has_images":true,"description":"Bino é um naturalista, e viajou para o planeta Binox com o objetivo de estudar a filogenia dos seres desse planeta. Bino conseguiu desenhar as árvores filogenéticas dos seres do planeta Binox, porém ele precisa da sua ajuda para determinar a menor quantidade possível de mudanças evolutivas que ocorreram entre os decendentes diretos na árvore.\n\n\t\t\t\t\tComputacionalmente, as árvores filogenéticas são representadas por árvores binárias, em que suas folhas representam indivíduos conhecidos e seus nós internos e a raiz representam ancestrais hipotéticos, que geralmente não se possui informações genéticas precisas sobre. Com isso, Bino vai fornecer uma topologia de árvore e o código genético dos indivíduos representados pelas folhas. O código genético dos seres de Binox é representado por uma sequência de letras minúsculas do alfabeto.\n\n\t\t\t\t\tComo Bino irá fornecer apenas os códigos genéticos dos indivíduos representados pelas folhas, a sua tarefa será inferir os códigos genéticos dos indivíduos representados pelos outros nós. Sua inferência terá que minimizar a quantidade de mudanças entre os códigos dos indivíduos diretamente ligados na árvore. As figuras a seguir apresentam a configuração inicial e duas possíveis configurações finais para a árvore do primeiro caso de teste:\n\n\t\t\t\t\t\n\n\t\t\t\t\tPara calcular o custo total da árvore depois de inferida, basta comparar todas as posições do código genético de indivíduos ligados diretamente. Para cada diferença encontrada, o custo é incrementado em um. Por exemplo, para a árvore resposta do primeiro caso de teste:\n\n\n\t    Custo inicia em 0\n\t    Ligação entre 1 (\"ac\") e 4 (\"aa\"): 'c' ≠ 'a' (Custo + 1).\n\t    Ligação entre 2 (\"ba\") e 4 (\"aa\"): 'b' ≠ 'a' (Custo + 1).\n\t    Ligação entre 3 (\"ab\") e 5 (\"aa\"): 'b' ≠ 'a' (Custo + 1).\n\t    Ligação entre 4 (\"aa\") e 5 (\"aa\"): \"aa\" = \"aa\".\n\t    Custo total 3.\n\n\nAs duas árvores inferidas tem custo total 3. Porém, Bino quer a árvore com menor custo possível e que a raiz tenha o menor valor lexicográfico possível para esse custo. Logo, Bino escolherá a árvore com raiz de código \"aa\".\n\nÉ garantido que todos as indivíduos folhas não tenham filhos e que todos os demais tenham exatamente dois filhos.","id":"1894","category":"Grafos","statistics":{"level":"10 / 10","submissions":104,"solved":21,"ratio":"20.19%"}}