{"output":"A saída deverá conter \"Y\" caso Charlinho consiga realizar uma combinação válida para invocar Prassódia ou \"N\" caso contrário.","input":"A primeira linha da entrada contém 4 inteiros, o primeiro inteiro N ( 1 ≤ N ≤ 20) representa o número de cartas na mesa seguido por 3 inteiros A,D,H (1 ≤ A,D,H, ≤ 1000) que representam respectivamente o ataque, a defesa e a habilidade exata para invocar Prassódia. Cada uma das N linhas seguintes representam uma carta da mesa, onde cada linha contém os atributos na ordem X,Y,Z (1 ≤ X,Y,Z ≤ 50) ataque, defesa e habilidade respectivamente.","level":6,"name":"É Hora do Duelo!","has_images":false,"description":"Monstros de Duelo é o mais famoso campeonato de cartas do mundo. Cada duelo é disputado por dois jogadores, onde cada jogador começa com 8.000 Pontos de Vida e com o seu Deck (Baralho). Cada carta representa um monstro que tem os atributos de Ataque, Defesa e habilidade. Estamos no duelo final com os dois maiores duelistas da história. De um lado Charlinho, um garoto que gosta muito de estudar, mas que também sabe sentir o coração das cartas. Do outro lado Gilmar, que não foi criado a leite com pêra, mas é reconhecido como o Mestre das Cartas. É a vez de Charlinho, e ele acaba de combinar seus monstros na mesa para obter o proíbido \"Prassódia\". \n\t\t\t\t\tPrassódia é o monstro mais forte do jogo, e quando invocado, a partida é finalizada na hora e o jogador que o invocou ganha o duelo. Para invocar Prassódia é necessário combinar duas ou mais cartas na mesa somando ataque com ataque, defesa com defesa e habilidade com habilidade para obter os atributos de Prassódia informados no início do duelo.\n\t\t\t\t\tSe uma carta for escolhida para ser combinada, os atributos da carta tem que ser utilizados por inteiro, sendo inválido apenas utilizar o ataque ou apenas utilizar a defesa ou apenas a habilidade daquela carta e ainda não podendo utilizar apenas uma parte do ataque e/ou uma parte da defesa e/ou uma parte da habilidade. \n\t\t\t\t\tGilmar se espanta por um momento, pois ele foi o único em toda a história que conseguiu invocar Prassódia, mas acaba duvidando da jogada de Charlinho porque haviam várias cartas na mesa, o que tornaria tal jogada muito suspeita. \n\t\t\t\t\tVocê é o Juíz do duelo e ficou responsável por avaliar se o Charlinho realmente conseguiu invocar ou não Prassódia com as cartas na mesa.","id":"1896","category":"Ad-Hoc","statistics":{"level":"6 / 10","submissions":1071,"solved":434,"ratio":"40.52%"}}