{"output":"Seu programa deve imprimir uma única linha contendo unicamente o nome do vencedor da partida, assumindo-se que ambos os jogadores jogam de maneira ótima. Se a partida empata, a linha da saída deverá conter unicamente o símbolo ?.","input":"A entrada consiste de dois inteiros A e B (0 ≤ A, B ≤ 107), os quais representam respectivamente os números exibidos por Alice e Bob no início do jogo, conforme explicado anteriormente.","level":9,"name":"Par ou Ímpar 2.0","has_images":false,"description":"Alice e Bob são dois amigos que moram no planeta Terra 2.0, construído após a destruição do planeta Terra 1.0 pelos Vogons. Em Terra 2.0, tudo é melhorado. Os seres humanos, por exemplo, não possuem 10 dedos nas mãos, mas 10 milhões: 5 milhões em cada mão. O tradicional jogo ‘Par ou Ímpar’, muito jogado em Terra 1.0, também foi bastante melhorado. Alice e Bob jogam ‘Par ou Ímpar 2.0’ o tempo todo. Nesta versão do jogo, os jogadores devem ao mesmo tempo exibir usando as mãos um número inteiro entre 0 e 10 milhões. Se os números exibidos pelos dois jogadores forem iguais, configura-se empate. Senão, os jogadores se alternam escrevendo números num pedaço de papel. Sendo A o inteiro exibido por Alice no início da partida e B o inteiro exibido por Bob, cada número escrito no papel deve ser um produto de |A - B| fatores, sendo todos os fatores números primos, não necessariamente distintos, pertencentes ao intervalo definido pelos inteiros A e B. Além disso, não é permitido que um mesmo número seja escrito no papel mais de uma vez. Perde o jogador que, em sua vez de jogar, não for capaz de escrever no papel um número novo. Como Bob é um cavalheiro, Alice é sempre a primeira a jogar. Note que se não há primos no intervalo definido pelos inteiros A e B, Alice não consegue escrever número algum no papel na sua primeira jogada, e Bob vence a partida.\n\nPor exemplo, se A = 5 e B = 2, há somente 10 números que podem ser escritos no papel, os quais são:\n\n8 = 2 × 2 × 2\n12 = 2 × 2 × 3\n20 = 2 × 2 × 5\n18 = 2 × 3 × 3\n30 = 2 × 3 × 5\n50 = 2 × 5 × 5\n27 = 3 × 3 × 3\n45 = 3 × 3 × 5\n75 = 3 × 5 × 5\n125 = 5 × 5 × 5\n\nAssim, se tanto Alice quanto Bob jogarem de maneira ótima, Bob vence a partida neste caso.","id":"1904","category":"Matemática","statistics":{"level":"9 / 10","submissions":629,"solved":133,"ratio":"21.14%"}}