{"output":"A única linha da saída deve consistir de apenas um único inteiro, representando o número de possibilidades para a nova senha do Prof. Antônio Neri, considerando que o teclado contém uma tecla para cada inteiro de 1 a N e que a nova senha é uma sequência de K números que aparecem consecutivamente numa sequência de Collatz.","input":"A única linha da entrada consiste de dois inteiros positivos N e K (N, K ≤ 107).","level":9,"name":"Senhas de Collatz","has_images":false,"description":"Quando o Prof. Antônio Neri, mais jovem, conheceu a Conjectura de Collatz, ficou muito fascinado. Caso você ainda não conheça a Conjectura de Collatz, ela enuncia que, para qualquer inteiro positivo X, a sequência de Collatz para X eventualmente atinge 1. A propósito, a sequência de Collatz para um inteiro positivo X é definida como a sequência infinita a0, a1, a2… tal que a0 = X e, para todo i > 0, ai = ai-1 / 2 se ai-1 é par ou ai = 3 × ai-1 + 1 se ai-1 é ímpar. Por exemplo, para X = 7, os primeiros 20 termos da sequência de Collatz são:\n\n\t\t\t\t\t7, 22, 11, 34, 17, 52, 26, 13, 40, 20, 10, 5, 16, 8, 4, 2, 1, 4, 2, 1…\n\n\t\t\t\t\tA Conjectura de Collatz ainda não foi provada, apesar de existirem vários matemáticos brilhantes neste mundo, como o Prof. Antônio Neri. Ele continua tão fascinado pelo assunto que, noutro dia, ao olhar para o teclado do sistema de alarme da sua casa, o qual contém uma tecla para cada inteiro de 1 a N, ele resolveu trocar sua senha para que a nova senha seja uma sequência de K números que apareçam consecutivamente numa sequência de Collatz. Por exemplo, se N = 20 e K = 5, há 11 possibilidades para a nova senha do Prof. Antônio Neri:\n\n\t\t\t\t\t1, 4, 2, 1, 4\n\n\t\t\t\t\t2, 1, 4, 2, 1\n\n\t\t\t\t\t3, 10, 5, 16, 8\n\n\t\t\t\t\t4, 2, 1, 4, 2\n\n\t\t\t\t\t5, 16, 8, 4, 2\n\n\t\t\t\t\t6, 3, 10, 5, 16\n\n\t\t\t\t\t8, 4, 2, 1, 4\n\n\t\t\t\t\t10, 5, 16, 8, 4\n\n\t\t\t\t\t12, 6, 3, 10, 5\n\n\t\t\t\t\t16, 8, 4, 2, 1\n\n\t\t\t\t\t20, 10, 5, 16, 8","id":"1906","category":"Ad-Hoc","statistics":{"level":"9 / 10","submissions":503,"solved":66,"ratio":"13.12%"}}