{"output":"Para cada caso, exiba o tempo de quique da bola escolhida por você, ou “impossivel” caso não exista uma bola que irá satisfazer o desejo de Kiko.","input":"Haverá diversos casos de testes. A primeira linha de cada caso inicia com dois inteiros N (1 ≤ N ≤ 100) e T (1 ≤ T ≤ 105) representando a quantidade de bolas que Kiko tem em mãos e o segundo que Kiko deseja ver as N+1 bolas quicando juntas. Na próxima linha, N inteiros no intervalo [1, T] seguem representando o tempo de quique de cada uma das bolas.  \n\n\t\t\t\t\tA entrada termina com N = T = 0, a qual não deve ser processada.","level":8,"name":"Ajude Kiko","has_images":false,"description":"Depois de tanto pedir uma bola quadrada à sua mãe, Kiko não ganhou apenas uma, mas sim várias bolas de aniversário! A diversão de Kiko é soltar várias bolas de uma vez no chão e ficar observando elas quicarem. Como as bolas possuem tamanho, peso e são feitas de matérias diferentes, o tempo de quique de uma para outra é variável. Nesse problema iremos supor que toda bola quica infinitamente de acordo com seu tempo de quique.\n\n\t\t\t\t\tKiko soltou ao mesmo tempo N bolas e percebeu que dependendo das bolas que solta, em alguns instantes, todas as bolas quicam ao mesmo tempo, e ele achou isso genial!\n\n\t\t\t\t\tDado o tempo de quique em segundos das N bolas que Kiko escolheu e um tempo T, que é o segundo que Kiko deseja que todas as bolas quiquem ao mesmo tempo, sua tarefa é escolher o menor tempo de quique de mais uma bola para que todas as N+1 bolas, quando forem soltas juntas, quiquem todas ao mesmo tempo pela primeira vez exatamente no segundo T.\n\n\t\t\t\t\tObs: O tempo de quique que irá escolher, não pode ser igual ao de nenhum previamente escolhido por Kiko e deverá ser maior que 1.\n\n\t\t\t\t\tTempo de quique é a diferença dos tempos que a bola encosta no chão por duas vezes consecutivas. Se uma bola tem tempo de quique = 4, iremos considerar que ela quicará nos segundos 4, 8, 12, 16...","id":"1909","category":"Matemática","statistics":{"level":"8 / 10","submissions":1858,"solved":406,"ratio":"21.85%"}}