{"output":"Para cada caso, exiba uma única linha, a menor quantidade de cliques nos botões necessária para ir do canal de origem ao destino ou -1 caso seja impossível chegar ao canal de destino devido as restrições de Clotilde.","input":"Haverá diversos casos de testes. Cada caso inicia com três inteiros, O, D e K (1 ≤ O, D ≤ 105, 0 ≤ K ≤ 100), representando, respectivamente, o canal de origem, destino, e a quantidade de canais que Clotilde não quer passar. A segunda linha conterá os K canais proibidos por Clotilde. É garantido que o canal de origem e destino nunca serão proibidos.\n\n\t\t\t\t\tA entrada termina com O = D = K = 0, a qual não deve ser processada.","level":8,"name":"Ajude Clotilde","has_images":true,"description":"Clotilde ama assistir novelas, porém o controle da sua televisão não é nada convencional. Ele possui apenas seis botões, o botão liga/desliga e cinco botões para mudar de canal.\n\n\t\t\t\t\tOs botões de mudança de canal funcionam da seguinte maneira: +1 (avança um canal), -1(volta um canal), x2(vai para o dobro do canal atual), x3(vai para o triplo do canal atual) e /2(vai para a metade do canal atual, esse botão só funciona se o canal atual for par).\n\n\t\t\t\t\t\n\n\t\t\t\t\tEis o famoso controle de Clotilde.\n\n\t\t\t\t\tOs vizinhos de Clotilde costumam visitar sua casa nos finais de semana, assistem televisão e não voltam ao canal de sua novela, assim fazendo com que Clotilde perca muito tempo tentando achar o canal de seu interesse novamente.\n\n\t\t\t\t\tSua tarefa é, dado o número do canal atual e o número do canal de interesse de Clotilde, você deve calcular a menor quantidade de cliques nos botões necessária para sair de um e chegar no outro. Lembrando que como Clotilde é uma pessoa séria, ela não gosta de passar por alguns canais específicos, mesmo que tenha que apertar mais botões para chegar no canal destino. Outra restrição é, não existe canal menor igual a 0 ou maior que 105. Ex: Se está no canal 55000, você não pode apertar o botão x2 nem o x3.","id":"1910","category":"Grafos","statistics":{"level":"8 / 10","submissions":3175,"solved":782,"ratio":"24.63%"}}