{"output":"Para cada caso de teste, seu programa deverá imprimir uma única linha com o valor da altura da maior torre de cilindros que pode ser construída, seguido da palavra “centimetro(s)”.","input":"A entrada contém vários casos de teste. A primeira linha de cada caso de teste contém um inteiro N (1 ≤ N ≤ 10³ ), que representa a quantidade de cilindros dispostos sobre a mesa, seguem N linhas, cada linha contendo a altura h (1 ≤ h ≤ 1000) do cilindro em centimetros, o raio r (1 ≤ r ≤ 1000) da base do cilindro e uma palavra p representando a cor do cilindro. A palavra pode ser: VERMELHO, LARANJA, VERDE ou AZUL.\r\n\r\n\t\t\t\t\tO fim da entrada é indicado quando N == 0, a qual não deverá ser processada.","level":8,"name":"Ajude o Sr. Barriga","has_images":true,"description":"Nhonho, filho do Sr. Barriga está participando de uma brincadeira nova criada pelas crianças da vila bastante conhecida por “Torre de cilindros”. A brincadeira consiste em construir a maior torre composta por cilindros, respeitando todas as regras, claro! Logo abaixo está descrito o funcionamento da brincadeira.\r\n\r\n\t\t\t\t\t\r\n\t\t\t\t\t\t\r\n\t\t\t\t\t\tSerá disposta em uma mesa, uma quantidade N de cilindros.\r\n\t\t\t\t\t\t\r\n\t\t\t\t\t\t\r\n\t\t\t\t\t\tCada cilindro possui uma cor, que pode ser: Vermelho, laranja, verde ou azul.\r\n\t\t\t\t\t\t\r\n\t\t\t\t\t\t\r\n\t\t\t\t\t\tCada cilindro possui uma altura h, e uma base com um raio de tamanho r.\r\n\t\t\t\t\t\t\r\n\t\t\t\t\t\t\r\n\t\t\t\t\t\tPara a construção da torre, os cilindros deverão ser empilhados, sendo que o cilindro do topo deverá sempre ter a base menor que a do cilindro logo abaixo dele. Exceto o primeiro cilindro, que poderá ter a base de qualquer tamanho, já que não existe nenhum outro cilindro abaixo dele.\r\n\t\t\t\t\t\t\r\n\t\t\t\t\t\t\r\n\t\t\t\t\t\tExistem também algumas restrições bem interessantes quanto às cores dos cilindros. Elas estão descritas abaixo:\r\n\r\n\t\t\t\t\t\t\r\n\t\t\t\t\t\t\t\r\n\t\t\t\t\t\t\tUm cilindro vermelho nunca pode ser colocado sobre um cilindro laranja.\r\n\t\t\t\t\t\t\t\r\n\t\t\t\t\t\t\t\r\n\t\t\t\t\t\t\tUm cilindro laranja nunca pode ser colocado sobre um cilindro azul.\r\n\t\t\t\t\t\t\t\r\n\t\t\t\t\t\t\t\r\n\t\t\t\t\t\t\tUm cilindro azul nunca pode ser colocado sobre um cilindro verde.\r\n\t\t\t\t\t\t\t\r\n\t\t\t\t\t\t\t\r\n\t\t\t\t\t\t\tUm cilindro verde nunca pode ser colocado sobre um cilindro vermelho.\r\n\t\t\t\t\t\t\t\r\n\t\t\t\t\t\t\r\n\t\t\t\t\t\t\r\n\t\t\t\t\t\r\n\r\n\t\t\t\t\tCansado de ver o seu filho reclamar de perder sempre e consequentemente de ouvir a frase\r\n\r\n\t\t\t\t\t“Olha ele hein! Olha ele hein! Olha ele...” repetidas vezes, Sr. Barriga quer dar uma pequena dica para Nhonho, informando a maior altura que é possível ser construída dado a lista com as características dos cilindros disponíveis para construção da torre. Porém, apesar de ser bom em matemática e cobrar o preço do aluguel corretamente, Sr. Barriga não conseguiu calcular a altura máxima que a torre pode ter, devido a grande quantidade de cilindros disponíveis. Então ele contratou você para escrever um programa capaz de informar esse valor.\r\n\r\n\t\t\t\t\tPara lhe ajudar a entender melhor o problema, Sr. Barriga lhe demonstrou através de um desenho a altura da maior torre possível de ser construída com cinco peças, seguindo todas as regras da brincadeira. Logo abaixo você pode consultar o desenho do Sr. Barriga.","id":"1913","category":"Paradigmas","statistics":{"level":"8 / 10","submissions":391,"solved":133,"ratio":"34.02%"}}