{"output":"Para cada caso de teste, exiba uma única linha com a quantidade de vírus que estarão vivos no fim do minuto solicitado pelo Chapolin Colorado.","input":"Haverá diversos casos de teste. Cada caso inicia com dois inteiros, X e Mf (1 ≤ X ≤ 105 , 1 ≤ Mf ≤ 105), representando respectivamente, a quantidade inicial de vírus inseridas no planeta Terra e o minuto em que Chapolin deseja saber a quantidade de vírus que estarão vivos no planeta.\n\n\t\t\t\t\tA entrada termina com X = Mf = 0, a qual não deverá ser processada.","level":8,"name":"Ajude o Chapolin Colorado!","has_images":true,"description":"Tripa Seca é um exímio programador de computadores, mas infelizmente ele faz parte de uma entidade formada pelos vilões mais cruéis do universo. Após dominar inúmeros planetas, o próximo alvo dessa entidade é o planeta Terra e o foco é de capturar toda a tecnologia dos terráqueos. A sede da entidade até alguns dias atrás nunca tinha sido avistada por nenhum ser do planeta Terra, mas o poderoso Chapolin Colorado com toda a sua astúcia, realizou esse feito e conseguiu entrar na sala de reuniões dos super vilões. E advinha? Estava tendo uma grande reunião!\n\n\t\t\t\t\tChapolin escutou toda a conversa dos vilões e acabou descobrindo que o plano para conquistar a terra, é a criação de um vírus super poderoso capaz de dominar qualquer aparelho que utilize algum tipo de tecnologia terrestre. Naquele exato momento Chapolin Colorado pegou o seu gravador de áudio e começou gravar Tripa Seca explicando o funcionamento do vírus. Abaixo está descrito uma parte da gravação:\n\n\t\t\t\t\t\"[..]Primeiramente o vírus que eu criei é capaz de se reproduzir, mas infelizmente eu errei em alguma parte do algoritmo e o vírus tem um tempo limitado de vida (Admitam, ninguém é perfeito!), por isso no fim do segundo minuto de vida o vírus morre, porém no início de cada minuto 1 vírus nasce de um outro vírus mais velho vivo, e esse é capaz de herdar as mesmas características do vírus pai, como por exemplo a capacidade de se reproduzir e também o tempo limitado de vida. Mesmo com o problema do tempo limitado de vida, tenho quase certeza que a devastação será gigantesca e nós dominaremos toda a tecnologia deste planeta fútil...Minha ideia é a seguinte: colocarei uma quantidade X de vírus no planeta dos terráqueos e depois deixarei que eles cumpram o resto do serviço! Por exemplo, se eu colocar de início somente 1 vírus, de acordo com meus cálculos já no fim do terceiro minuto terão 5 vírus![..]\"\n\n\t\t\t\t\tApesar de Chapolin ser um grande herói, ele não é muito bom para entender certas explicações e pediu que o professor Girafales explicasse para ele a capacidade de destruição daqueles vírus, para que ele tenha uma noção do quanto a Terra corre perigo. Após várias tentativas sem sucesso, o professor Girafales decidiu desenhar o processo e mostrar a Chapolin. Veja o desenho do professor Girafales abaixo:\n\n\t\t\t\t\t\n\n\t\t\t\t\tEntretanto Chapolin achou o desenho um grande insulto a sua capacidade mental e pediu para que você informasse a quantidade de vírus que terá em um determinado minuto, dado a quantidade de vírus inseridos inicialmente por Tripa Seca. Um detalhe importante, Chapolin odeia números quebrados ou restos, ele gosta de ver o número original sem nenhum tipo de corte!","id":"1917","category":"Ad-Hoc","statistics":{"level":"8 / 10","submissions":219,"solved":96,"ratio":"43.84%"}}