{"output":"Para cada caso de teste, se for possível chegar a Acapulco antes que a promoção finalize, imprima duas linhas. Na primeira linha a palavra “POSSIBLE” (sem aspas) e na segunda linha a menor data possível no seguinte formato: “DD/MM/AAAA – hh:mm:ss”. Caso não seja possível chegar até a data limite, imprima apenas uma linha com a palavra “IMPOSSIBLE” (sem aspas).","input":"A primeira linha de entrada contém um único inteiro QT (1 ≤ QT ≤ 100), indicando a quantidade de casos de teste que vem a seguir. A primeira linha de cada caso de teste é composta por 2 inteiros N (2 ≤ N ≤ 105) e M (1 ≤ M ≤ 3x105), representando respectivamente a quantidade de cidades e a quantidade de rotas que ligam essas cidades. A segunda linha de cada caso de teste é composta pela data e o horário que os moradores da vila pretendem sair e a terceira linha de cada caso é composta pela data e o horário limite que o hotel de Acapulco estará em promoção. As datas e os horários estão descritos na seguinte notação: “DD/MM/AAAA – hh:mm:ss”, onde DD (1 ≤ DD ≤ 31) representa o dias do mês, MM (1 ≤ MM ≤ 12) representa o mês do ano, AAAA (1970 ≤ AAAA ≤ 2100) representa o ano, hh (0 ≤ hh ≤ 23) representa as horas, mm (0 ≤ mm ≤ 59) representa os minutos, ss (0 ≤ ss ≤ 59) representa os segundos. Seguem M linhas, cada linha contêm 2 inteiros a e b e uma data, indicando que existe uma rota bidirecional entre a cidade a (0 ≤ a ≤ N-1) e b (0 ≤ b ≤ N-1), e a data no formato “DD-hh-mm-ss”, representando o tempo necessário para ir de a para b e vice-versa. Considere que a vila fica na cidade de número 0 e a cidade de Acapulco é a cidade de número N-1.","level":10,"name":"Viagem para Acapulco","has_images":false,"description":"Após terem realizado uma grande viagem para Acapulco há algum tempo atrás, o moradores da vila fizeram uma grande reunião e decidiram se unir para viajar novamente para aquela linda cidade. Apesar de Seu Madruga ter tido uma grande sorte e ganhado a viagem passada com todas as despesas pagas, o gasto geral entre todos os moradores da vila foi gigantesco e dessa vez eles estão querendo economizar o máximo possível, ainda mais porque ninguém da vila ganhou a viagem paga novamente.\n\n\t\t\t\t\tAcontece que eles foram informados por um desconhecido, que o melhor hotel da cidade (o mesmo que eles se hospedaram na viagem passada) estará com uma promoção por um tempo limitado, então como eles desejam economizar, estão querendo chegar a tempo de pegar a promoção.\n\n\t\t\t\t\tSeu Barriga responsável por administrar o dinheiro gasto é um homem que entende bem de números e agora quer utilizar o poder da tecnologia para conseguir algumas informações úteis antes de realizar a viagem. Como ele já conhece suas habilidades como matemático e programador, ele contratou você para desenvolver um programa que dado todas as informações sobre as cidades e rotas disponíveis, a data e o horário que eles pretendem sair da vila e a data e o horário limite da promoção do hotel em Acapulco, informe se é possível chegar a Acapulco antes que a promoção termine, e qual a menor data e horário possível, ou se não é possível chegar a tempo de pegar a promoção.","id":"1918","category":"Ad-Hoc","statistics":{"level":"10 / 10","submissions":129,"solved":25,"ratio":"19.38%"}}