{"output":"Imprima a quantidade máxima de criaturas que podem ser atingidas com no máximo m marteladas.","input":"A primeira linha da entrada será composta por dois inteiros 1 ≤ n ≤ 103 e 1 ≤ m ≤ 10, representando a quantidade de criaturas e a quantidade de marteladas disponíveis, respectivamente. Cada uma das próximas n linhas irá conter dois inteiros 2 ≤ di ≤ 500 e 2 ≤ kdi ≤ 103, representando o instante da primeira e da última aparição da criatura i, respectivamente. É garantido que di  ≤ kdi.","level":7,"name":"Diego e o Jogo do Martelo","has_images":false,"description":"Durante a festa do Padroeiro de Lagoa de Roça, diferentes jogos, brinquedos e parques de diversão se instalam no centro da pequena cidade do interior da Paraíba. Um deles é o não tão conhecido Jogo do Martelo. O jogo consiste de um tabuleiro esburacado e um martelo que cobre totalmente o tabuleiro. Além disso, há pequenas criaturas (bonecos) que vez por outra saem dos buracos do tabuleiro, ficam visíveis por um segundo e após isso voltam a se esconder no buraco por onde saíram. O objetivo do Jogo do Martelo é atingir a maior quantidade de criaturas com uma quantidade m de marteladas.\n\nApós ficar um tempo observando o jogo, Diego percebeu que cada uma das criaturas possuía um padrão de aparição, ou seja, se uma determinada criatura i, apareceu pela primeira vez no instante di, ela tornará a aparecer no instante 2di, depois no instante 3di e assim por diante até que o instante kdi chegasse, após isso essa criatura não apareceria mais. Diego anotou os instantes da primeira e da última aparição de cada uma das criaturas e agora ele precisa de você. Escreva um programa que com essas informações e com a quantidade m de marteladas disponíveis, informe qual a quantidade máxima de criaturas que podem ser marteladas.\n\nObs.: Quando uma criatura é martelada ela não aparece mais durante o jogo.","id":"1922","category":"Paradigmas","statistics":{"level":"7 / 10","submissions":130,"solved":59,"ratio":"45.38%"}}