{"output":"Imprima a linha e a coluna da cadeira que Ordan deve sentar separados por vírgula.","input":"A primeira linha da entrada irá conter dois inteiros 1 ≤ l, c ≤ 103, que representam o número de linhas e de colunas do salão, respectivamente. Cada uma das próximas l linhas irá conter c caracteres. Os caracteres podem ser ('n','b','*').","level":10,"name":"Ordan e as Novinhas","has_images":false,"description":"Ordan está no grandioso Shopping de Campina Grande, ele vai participar de um evento de games e animes. Hoje é o primeiro dia do evento e a abertura já está prestes a acontecer, ela será no salão de palestras do Shopping. Algumas pessoas já estão acomodadas no salão, há muitos boe e muitas novinhas também, para a alegria de Ordan.\n\n\t\t\t\t\tEle quer sentar em um lugar do salão em que haja o maior número de novinhas juntas, para ele poder aplicar nelas, é claro. O salão pode ser visto como um grid de 2 dimensões, e as cadeiras do salão são identificadas por um par de números inteiros, o número da linha e da coluna onde a mesma se encontra. Se houver ‘n’ na cadeira então é uma novinha que lá está sentada, se houver um ‘b’ então é um boe que lá está sentado, caso haja um ‘*’, então essa cadeira está vazia.\n\n\t\t\t\t\t    1 2 3 4\n\n\t\t\t\t\t1  n n n n\n\n\t\t\t\t\t2  b n * n\n\n\t\t\t\t\t3  n b * b\n\n\t\t\t\t\t4  b b n b\n\n\t\t\t\t\tNesse exemplo, há duas cadeiras vazias, caso Ordan sente na cadeira (2, 3) ele estará perto de 6 novinhas que estão juntas, caso ele sente na cadeira (3, 3) ele estará perto de apenas uma novinha. Dessa forma, ele deve sentar na cadeira (2, 3).\n\n\t\t\t\t\tSua tarefa é determinar qual a cadeira vazia que Ordan deve sentar para que ele esteja próximo do maior número de novinhas juntas, caso haja dois ou mais lugares que podem ser a resposta, escolha aquele que tem o menor número da linha, se ainda assim houver mais de uma cadeira que pode ser a resposta, escolha aquela que tenha o menor número da coluna.\n\n\t\t\t\t\tÉ garantido que sempre haverá pelo menos uma cadeira livre.","id":"1925","category":"Grafos","statistics":{"level":"10 / 10","submissions":736,"solved":129,"ratio":"17.53%"}}