{"output":"Para cada caso de teste imprima uma linha contendo um inteiro, indicando a menor distância possível de ser percorrida se o taxista iniciar no ponto 1, atender a todos os pedidos (um por vez), e voltar ao ponto 1.","input":"Cada caso de teste inicia com três inteiros N, M e K (2 ≤ N ≤ 104, N-1 ≤ M ≤ 105, 1 ≤ K ≤ 15).\n\n\t\t\t\t\tEm seguida haverá M linhas, cada uma com três inteiros A, B e C, indicando que há uma rua que interliga os pontos A e B, a qual pode ser percorrida em ambas as direções, de comprimento C (1 ≤ A, B ≤ N, 1 ≤ C ≤ 100, A <> B).\n\n\t\t\t\t\tEm seguida haverá K linhas, cada uma com dois inteiros O e D, indicando que há um turista no ponto O que deseja chegar no ponto D (1 ≤ O, D ≤ N, O <> D).","level":9,"name":"Rota do Taxista","has_images":false,"description":"Um evento importante acontecerá hoje na sua cidade, e com isso há muitos turistas perdidos. Para que todos consigam chegar a seus destinos nessa cidade desconhecida eles costumam chamar táxis. Você foi contratado para ajudar os taxistas, que estão sobrecarregados com tantas chamadas.\n\n\t\t\t\t\tA cidade pode ser representada por N pontos de referências, e M ruas que interligam estes pontos. Cada rua tem um determinado comprimento, e sempre haverá um caminho entre quaisquer dois pontos distintos da cidade.\n\n\t\t\t\t\tO objetivo do taxista o qual você vai ajudar é atender a K pedidos. Cada pedido consiste de dois pontos no mapa, O e D (origem e destino), sendo que o turista atualmente está no ponto O e deseja chegar no ponto D. O taxista está inicialmente no ponto 1, pretende atender a apenas um pedido por vez (na ordem em que desejar), e após o último pedido deve voltar ao ponto 1.\n\n\t\t\t\t\tPor exemplo, considere uma cidade com N = 5 pontos de referência e K = 2 turistas, onde o primeiro turista deseja ir do ponto 4 ao ponto 3, e o segundo deseja ir do ponto 2 ao ponto 4. O taxista então tem duas opções de trajeto: 1 -> 4 -> 3 -> 2 -> 4 -> 1; ou 1 -> 2 -> 4 -> 3 -> 1. Note que A -> B representa um caminho entre os pontos A e B, contendo uma ou mais ruas.\n\n\t\t\t\t\tConfuso com tantas opções de trajeto e querendo economizar combustível, o taxista pediu que você calculasse qual trajeto teria a menor distância percorrida.","id":"1947","category":"Ad-Hoc","statistics":{"level":"9 / 10","submissions":251,"solved":80,"ratio":"31.87%"}}