{"output":"A saída consistirá sempre de somente 1 linha:\n        \n        OK\n        \n        No caso de ser possível compilar.\n        \n        Compilation error\n        \n        No caso de não ser possível.","input":"Cada entrada consiste de um programa.\n        O programa só contem 2 tipos de instruções.\n        Uma para declarar o valor de uma variável e outra para executar uma soma.\n        \n        As instruções de declaração são no formato:\n        \n        A := B\n        \n        Onde A é um nome de variável válido e B é um inteiro positivo.\n        \n        As instruções de soma são no formato:\n        \n        A := B + C\n        \n        Onde A é um nome de variável válido e B ou C são ou um\n        nome de variável válido ou um inteiro positivo.\n        \n        Os tokens deste programa são sempre separados por espaço\n        e as instruções são separadas por uma quebra de linha.\n        \n        São nomes de variáveis válidos todas as combinações de até 8 letras minúsculas.\n        Os programas tem, no máximo, 2000 instruções.\n        Variáveis recebem uma atribuição, seja através de uma soma ou de uma declaração, no máximo, 1 vez.","level":9,"name":"Compilador","has_images":false,"description":"Depois do ataque dos alienígenas que acabou com \n        quase toda a tecnologia avançada da humanidade,\n        você foi designado a participar da força tarefa para reconstruir.\n        \n        Depois de muita tentativa e erro, foi descoberto que os\n        computadores que tinham apenas 2 registradores\n        fonte e um destino eram imunes as radiações alienígenas.\n        O problema agora é que nenhum programa escrito até então funcionava nestes\n        computadores, e muito menos um compilador adequado.\n        \n        Você está de posse de um dos últimos computadores\n        de verdade que ainda funcionam, e\n        sua tarefa será escrever o compilador. Mas como tempo é\n        dinheiro, e tempo de CPU é muito mais dinheiro,\n        antes de compilar o programa inteiro, você deve\n        apenas checar se é possível compilar\n        o programa desejado.","id":"1948","category":"Grafos","statistics":{"level":"9 / 10","submissions":103,"solved":13,"ratio":"12.62%"}}