{"output":"Imprima uma linha consistindo de um único valor representando a probabilidade de o robô ter conseguido sair do labirinto em no máximo T2 unidades de tempo contando a partir do início do experimento. A probabilidade deve ser exibida como uma porcentagem com duas casas decimais após o ponto decimal.","input":"A primeira linha da entrada consiste de quatro inteiros, N, M, T1 e T2 (1 ≤ N, M ≤ 30, 1 ≤ T1 < T2 ≤ 105), os quais representam respectivamente o número de linhas e o número de colunas do grid e os tempos programados no sistema conforme já explanado. As próximas N linhas descrevem a configuração inicial do labirinto e contêm exatamente M caracteres cada, sendo o j-ésimo (1 ≤ j ≤ M) caractere da i-ésima (1 ≤ i ≤ N) linha ., # ou R se a posição (i, j) do grid começou, respectivamente, livre, bloqueada ou contendo o robô. A linha seguinte da entrada consiste de um único inteiro K (0 ≤ K ≤ N × M), o qual representa o número de posições livres que foram bloqueadas T1 unidades de tempo após o início do experimento, e as K últimas linhas da entrada descrevem essas posições, cada uma consistindo de dois inteiros i e j (1 ≤ i ≤ N, 1 ≤ j ≤ M) para designar a posição (i, j).","level":4,"name":"Spöhndriger","has_images":false,"description":"— Taca-lhe pau, Marco véio!\n\nEstas palavras ficaram gravadas para sempre no coração do Dr. Marco Spohn, e é por isso que ele faz tudo com excelência e dedicação. Ultimamente, ele tem trabalhado num sistema operacional que gerencia um robô e um labirinto e que é capaz de fazer o robô encontrar a saída do labirinto. Por enquanto, o projeto está num estágio muito inicial, e na atual versão o robô apenas se move aleatoriamente no labirinto.\n\nO labirinto é uma caixa eletrônica cujas posições formam um grid N × M. Cada posição do grid pode estar bloqueada, quando uma parede de borracha está erigida na posição do fundo ao topo da caixa, ou livre. Assumindo que a indexação das linhas e colunas do grid começa em 1, a saída do labirinto se encontra sempre na posição (N, M) e nunca está bloqueada, sendo a única posição não coberta pela tampa da caixa. O robô do Dr. Spohn é esperto e consegue, através de suas câmeras e sensores, saber quais das posições adjacentes à posição em que se encontra estão livres ou bloqueadas. Destarte, a próxima posição para a qual vai é sempre tomada com distribuição uniforme dentre todas as posições livres adjacentes. As adjacências são sempre consideradas apenas nos sentidos horizontal e vertical. Se há posições livres adjacentes, o movimento da posição corrente para a próxima custa uma unidade de tempo constante. Do contrário, o robô fica parado.\n\nOntem o Dr. Spohn fez um experimento interessante. Primeiramente, ele configurou o labirinto deixando algumas posições livres e as outras bloqueadas. Em seguida, pôs o robô numa posição livre qualquer do labirinto, tampou a caixa, programou dois tempos T1 e T2 (T1 < T2) e iniciou o sistema. Uma vez iniciado o sistema, o robô, sem poder ser visto pelo Dr. Spohn, começou a se mover dentro do labirinto conforme descrito acima, até não conseguir mais se mover, até chegar na posição (N, M), ou até o tempo T2 ser excedido e o experimento ser abortado. Após T1 unidades de tempo a partir do início do experimento, o sistema sorteou K posições livres em que não estava o robô e as bloqueou, reportando num visor ao Dr. Spohn quais posições foram bloqueadas.\n\nDados os tempos T1 e T2, a configuração inicial do labirinto e as K posições livres que foram bloqueadas após T1 unidades de tempo, calcule a probabilidade de o robô ter conseguido sair do labirinto em no máximo T2 unidades de tempo contando a partir do início do experimento.","id":"1950","category":"Grafos","statistics":{"level":"undefined","submissions":-1,"solved":-1,"ratio":"undefined"}}