{"output":"Imprima uma linha contendo unicamente o.o se o circuito descrito na entrada é válido ou u.u caso contrário.","input":"A entrada contém a descrição de um circuito C, o qual se deseja validar. A primeira linha da entrada consiste de três inteiros, I, N e O (1 ≤ I, N, O ≤ 104), os quais representam respectivamente o número de entradas de C, o número de circuitos publicados pelo professor usados internamente na construção de C e o número de saídas de C, de modo que as entradas são identificadas pelos inteiros 1, …, I, os circuitos internos pelos inteiros I + 1, …, I + N, e as saídas identificadas pelos inteiros I + N + 1, …, I + N + O. Cada uma das próximas N linhas descreve como é alimentado cada um dos circuitos internos, seguindo a ordem I + 1, …, I + N, e consiste de um inteiro K (1 ≤ K ≤ 102), o qual representa o número de entradas no circuito interno, seguido por K inteiros, os quais identificam a origem do sinal alimentado em cada entrada. A última linha da entrada consiste de O inteiros, identificando a origem do sinal devolvido por cada saída de C, seguindo a ordem I + N + 1, …, I + N + O.\n\nA figura abaixo ilustra o circuito C descrito pelo primeiro exemplo de entrada.","level":5,"name":"Validador de Circuitos","has_images":true,"description":"O Prof. Padilha pediu um trabalho para a componente curricular de Circuitos Digitais e agora está todo mundo desesperado! Os calouros precisam construir um circuito combinacional usando apenas circuitos de uma lista de circuitos publicados pelo professor. No entanto, devido a alguns problemas com tamanho, eles mal estão conseguindo determinar se os circuitos que eles construíram são válidos, quanto mais decidir se estão corretos. Cabe agora a você, veterano, fazer um programa para validar os circuitos construídos pelos calouros. Você pode ajudá-los?\n\nA propósito, de acordo com o que o Prof. Padilha pediu, um circuito C é válido se:\n\n\n\tpara toda entrada de C e toda saída de um circuito menor usado internamente na construção de C existe ao menos um caminho até alguma saída de C;\n\tpara toda saída de C existe ao menos um caminho que vem de alguma entrada de C;\n\tnão há ciclos em C.\n\n\nTodos os circuitos publicados pelo professor possuem só uma saída cada, embora os circuitos construídos pelos calouros possam ter várias saídas. É óbvio que os circuitos publicados pelo professor são todos válidos.","id":"1951","category":"Grafos","statistics":{"level":"5 / 10","submissions":109,"solved":52,"ratio":"47.71%"}}