{"output":"Seu programa deve imprimir uma linha contendo um único número inteiro, o qual representa o número de caminhos evolucionários possíveis da espécie à qual pertence o indivíduo S para a espécie à qual pertence o indivíduo T. Como esse número pode ser muito grande, seu programa deve apenas imprimir o resto que esse número deixa quando dividido por 109 + 7.","input":"A primeira linha da entrada consiste de 4 inteiros, N, M, S e T (1 ≤ N ≤ 105, 0 ≤ M ≤ 106, 1 ≤ S, T ≤ N), sendo N o número de indivíduos fossilizados, designados pelos inteiros de 1 a N, cujos códigos genéticos foram obtidos por Laura. Cada uma das próximas M linhas consiste de 2 inteiros, A e B (1 ≤ A, B ≤ N), representando que o programa de Laura considera o indivíduo A um possível pai genético de B.","level":10,"name":"Caminhos Evolucionários Possíveis","has_images":true,"description":"— Já que a senhora é bióloga, poderia nos definir o conceito de ‘espécie’? — Senhora, senhora, volta aqui!\n\nLaura é uma bióloga muito interessada em Computação. Recentemente ela escreveu um programa que, dados os códigos genéticos de dois indivíduos A e B, decide se A é um possível pai genético de B, o que significa que não há nada nos códigos genéticos de ambos os indivíduos que nos permita afirmar com certeza que B não foi gerado por A. Note que, se A é um possível pai genético de B, isso não significa que B seja da mesma espécie que A, pois pode ter ocorrido uma mutação durante a geração de B. Naturalmente, dizemos que um indivíduo A é um possível ancestral genético de um indivíduo B se existe uma sequência de k indivíduos I1, I1, …, Ik tais que I1 = A, Ik = B e, para todo j ∈ {1, …, k - 1}, Ij é um possível pai genético de Ij + 1.\n\nLaura está estudando os fósseis encontrados mês passado em Chapecó para determinar, através dos códigos genéticos extraídos, as espécies que habitavam a região. Mas o conceito de ‘espécie’ é muito polêmico. Laura, que não quer viver situações como a da senhora da imagem acima, preferiu adotar a seguinte definição: dois indivíduos A e B pertencem à mesma espécie se e somente se A é um possível ancestral genético de B e B é um possível ancestral genético de A. O diagrama abaixo ilustra uma situação com 7 indivíduos fossilizados, em que um arco de um indivíduo A para um indivíduo B representa que A é um possível pai genético de B. No exemplo, podemos identificar 3 espécies: I, II e III.\n\n\n\nDados as informações fornecidas pelo programa de Laura, ajude-a a calcular o número de caminhos evolucionários possíveis da espécie de um indíviduo S para a espécie de um indivíduo T. Um caminho evolucionário possível de uma espécie E1 para uma espécie Ek é uma sequência de k espécies E1, E2, …, Ek tal que, para todo j ∈ {1, …, k - 1}, existe algum indivíduo B da espécie Ij + 1 que tem um possível pai genético da espécie Ij.","id":"1954","category":"Grafos","statistics":{"level":"10 / 10","submissions":342,"solved":67,"ratio":"19.59%"}}