{"output":"A linha da saída deve consistir apenas de dois valores, separados por um espaço em branco, de modo que o primeiro represente o número de famílias élficas que habitam a floresta de acácias e o segundo represente o custo mínimo necessário para reconstruir as pontes visando satisfazer a tradição antiga.","input":"A primeira linha da entrada consiste de um único inteiro N (1 ≤ N ≤ 104), o qual representa o número de habitações élficas na floresta de acácias, as quais são designadas pelos inteiros de 1 a N. Cada i-ésima (1 ≤ i ≤ N - 1) das N - 1 linhas seguintes consiste de um inteiro não-negativo k seguido por k pares de inteiros j e cij (i < j ≤ N, 1 ≤ cij ≤ 106), indicando que havia uma ponte entre as moradias i e j e que reconstruí-la custa cij metros de corda élfica. Cada ponte é descrita exatamente uma vez na entrada e não há mais de 106 pontes ao todo.","level":6,"name":"Acácias","has_images":false,"description":"Talvez você não saiba, mas nem todos os elfos foram embora para Valinor. Há lendas segundo as quais alguns noldor vivem numa floresta de acácias ao norte de Chapecó, embora mortal algum jamais os tenha visto, pois sobre suas habitações paira um encantamento de ocultação entoado pela Senhora Galadriel pouco antes de tomar o último barco para as Terras Imortais. Cada habitação está construída na copa de uma acácia, e há várias pontes de corda élfica conectando pares de habitações, satisfazendo a seguinte tradição antiga: se dois elfos pertencem à mesma família mas moram em casas diferentes, então é possível sair da habitação onde um mora e chegar na habitação onde o outro mora tomando um caminho composto apenas de pontes de corda élfica. Reciprocamente, se dois elfos não pertencem à mesma família, eles não moram na mesma casa, e qualquer modo de sair da casa de um e chegar na casa do outro precisa obrigatoriamente passar pelo chão.\n\nA Terra já enfrentou ameaças terrível, como as de Morgoth e de Sauron. Porém, nenhuma se compara com a ameaça que os próprios homens estão sendo para a Terra. Pois noutro dia um fumante descuidado jogou uma bituca de cigarro próximo à floresta de acácias e o fogo se alastrou. Os elfos conseguiram salvar suas habitações, mas todas as pontes foram destruídas. Agora, eles querem reconstruir as pontes, mas não todas, já que as cordas élficas dos antigos noldor lhes são muitíssimo preciosas. Eles querem reconstruir apenas as pontes que realmente são necessárias para que a tradição antiga mencionada seja novamente satisfeita, e utilizando o mínimo possível de corda élfica. A tarefa de decidir quais pontes devem ser reconstruídas foi designada a você. Se você não encontrar um meio, ninguém mais encontrará.","id":"1956","category":"Grafos","statistics":{"level":"6 / 10","submissions":921,"solved":313,"ratio":"33.98%"}}