{"output":"Imprima uma linha contendo unicamente o nome da moça que Khan convidou para sair.","input":"A única linha da entrada consiste de cinco inteiros, C, VA, VB, T e D:\n\n\n\tC (0 < C ≤ 1000) representa o comprimento da estrada que circunda o campus, em metros;\n\tVA e VB (0 < VA, VB ≤ 400) representam as velocidades constantes, em centímetros por segundo, a que correm respectivamente Ana e Bia;\n\tT (0 ≤ T ≤ 200) representa o tempo, em minutos, entre o início da corrida das moças e a chegada de Khan ao obelisco;\n\tD (0 ≤ D < C) representa a distância, em metros, no sentido horário do ponto onde Ana e Bia começaram a correr até o obelisco.","level":9,"name":"A Ira de Khan","has_images":true,"description":"Khan é um rapaz muito inteligente que estuda Ciência da Computação na Universidade Federal da Fronteira Sul (UFFS). Porém, ontem à tarde ele e sua namorada discutiram feio e acabaram terminando, o que o deixou muito irado. Como ele tinha aula à noite, resolveu ir a pé para a universidade, a fim de espairecer um pouco. Ao chegar no campus, parou em frente ao obelisco da UFFS e instantaneamente decidiu que não usaria sua ira para o ódio, mas para o amor: ficaria ali parado até que uma moça passasse por ele, com a qual, convidando-a para sair, tentaria reconstruir sua vida. Se mais de uma moça passasse por ele ao mesmo tempo, Khan escolheria a mais bonita.\n\nO campus da UFFS em Chapecó é circundado por uma estrada, à qual se chega através de um único acesso pela cidade de Guatambu, já que o acesso antigo foi desativado. Conforme ilustrado na figura acima, é bem na interseção entre o acesso e a estrada circundante que se encontra o obelisco da UFFS, representado na figura pelo símbolo *.\n\nAna e Bia são duas amigas que também estudam à noite na UFFS. Ambas são muito saudáveis, apesar de Ana ser mais bonita que Bia, e gostam de se exercitar correndo na estrada circundante antes da aula, sempre no sentido horário. Elas sempre começam a correr juntas em algum ponto da estrada circundante, mas, como correm a velocidades constantes não necessariamente iguais, podem se separar e se encontrar diversas vezes durante a atividade. Ontem elas começaram a correr não depois de Khan chegar ao obelisco, e não havia outras moças no campus.","id":"1964","category":"Ad-Hoc","statistics":{"level":"9 / 10","submissions":431,"solved":82,"ratio":"19.03%"}}