{"output":"Seu programa deve imprimir duas linhas, informando na primeira a quantidade de coxinhas de esquerda na embalagem e o preço de cada uma, e na segunda as mesmas informações, mas para as coxinhas de direita. A saída deve obedecer rigorosamente o formato esclarecido nos exemplos abaixo.","input":"Três linhas compõem a entrada. A primeira linha da entrada consiste de 3 valores, N, D e P, sendo o primeiro um inteiro e os outros fornecidos com dois dígitos após o ponto separador decimal: N (3 ≤ N ≤ 106) representa o número de medições reportadas pelo scanner, D (0.01 ≤ D ≤ 100.00) representa a diferença entre o preço de uma coxinha de esquerda e o preço de uma de direita, e P (0.01 ≤ P ≤ 10000000.00) representa o preço total das coxinhas na embalagem. A segunda linha da entrada consiste de N inteiros positivos não maiores que 30, os quais representam os resultados das medições reportadas. A última linha da entrada consiste unicamente: de uma coxinha de esquerda, representada por <), se as coxinhas de esquerda são mais caras que as de direita; ou de uma coxinha de direita, representada por (>, caso contrário.","level":10,"name":"A Procura por Spock","has_images":true,"description":"‘Coxinha’ é o nome dado a uma tradicional comida brasileira que consiste de carne de frango desfiada envolta numa massa e frita. Recentemente, o Sr. Spock, o chefe do Enterprise, um restaurante em Chapecó, ganhou um importante prêmio gastronômico por fazer as coxinhas mais gostosas do mundo. Você devia experimentar uma coxinha do Sr. Spock. Elas são tão maravilhosas que o sabor notoriamente levará você aonde nenhum homem jamais esteve. Mas não é fácil conseguir uma coxinha no Enterprise. A procura por Spock é tanta que é preciso encomendar o pedido com pelo menos 42 dias de antecedência.\n\nO Sr. Spock gosta de fazer coxinhas de diferentes tamanhos e formatos. Para moldar uma coxinha, ele primeiro seleciona ao menos duas formas circulares sem fundo de mesma altura mas diâmetros todos distintos. Em seguida, põe uma forma sobre a outra em ordem decrescente de diâmetro da base até o topo, amarrando-as com um barbante na lateral. Finalmente, usa as formas para dar forma à sua coxinha. A primeira e a segunda figuras exibem a estrutura de formas vista respectivamente de cima e de lado. A terceira e a quarta figuras exibem a coxinha resultante, também vista respectivamente de cima e de lado.\n\n\n\nVisando atender melhor seus clientes, o Enterprise também oferece o serviço de entrega a domicílio. Algo importante que o Sr. Spock descobriu é que, para não perderem seu sabor e crocância, as coxinhas devem ser colocadas na embalagem sequencialmente, uma ao lado da outra, sempre deitadas de modo que as bases fiquem perfeitamente perpendiculares ao fundo da embalagem. Ainda, coxinhas consecutivas na sequência devem sempre ter ou suas bases ou seus topos se tocando, e as partes que se tocam devem sempre ter o mesmo diâmetro. Coxinhas cujos topos apontam para a esquerda são chamadas de ‘coxinhas de esquerda’, aquelas cujos topos apontam para a direita são chamadas ‘coxinhas de direita’, e o Sr. Spock usa a orientação das coxinhas para que o cliente saiba o tipo de tempero no recheio de cada uma. Não importando o tamanho, duas coxinhas são vendidas pelo mesmo preço se e somente se são ambas de esquerda ou ambas de direita. Há sempre ao menos uma coxinha de esquerda e ao menos uma coxinha de direita numa embalagem. A figura abaixo ilustra uma embalagem (linha tracejada) contendo 4 coxinhas (linhas contínuas). Como se pode ver, as coxinhas sempre cabem perfeitamente na embalagem.\n\n\n\nVocê foi contratado para trabalhar na equipe de controle de qualidade do Enterprise. Sua função é pegar as embalagens já cheias, passar as embalagens por um scanner de raio-X e, com base nas medições reportadas pelo scanner, determinar quantas coxinhas de esquerda e quantas de direita há nas embalagens. As medições são feitas da esquerda para a direita, a um espaçamento idêntico à altura das formas usadas na modelagem das coxinhas. Em cada medição é reportada a altura da coxinha dentro da embalagem naquele ponto, mas apenas se o resultado da medição é diferente do resultado da última medição (senão, nada é reportado). Na figura acima, 14 medições são ilustradas pelas linhas pontilhadas. Note que apenas 10 delas são reportadas.\n\nComo você é novo na equipe, seus colegas esconderam de você os preços das coxinhas e querem não apenas que você calcule quantas coxinhas de esquerda e quantas coxinhas de direita há na embalagem, mas também que adivinhe o preço das coxinhas de esquerda e o preço das coxinhas de direita. Para tanto, eles apenas lhe contaram qual o preço total das coxinhas na embalagem, qual a diferença entre os preços e o tipo das coxinhas que são mais caras.","id":"1965","category":"Ad-Hoc","statistics":{"level":"10 / 10","submissions":207,"solved":37,"ratio":"17.87%"}}