{"output":"Imprima uma linha contendo unicamente o número de cubos de queijo que haverá na base da pirâmide de João.","input":"A primeira linha da entrada consiste de dois inteiros, N e B (1 ≤ N ≤ 105, 0 ≤ B ≤ 109), os quais representam respectivamente o número de peças de queijo na loja e o orçamento de João. A segunda linha da entrada consiste de N inteiros vi (1 ≤ vi ≤ 104, 1 ≤ i ≤ N), cada um representando o volume, em centímetros cúbicos, da i-ésima peça de queijo. A última linha da entrada consiste de N inteiros pi (0 ≤ pi ≤ 104, 1 ≤ i ≤ N), cada um representando o preço da i-ésima peça de queijo.","level":8,"name":"A Volta para Casa","has_images":true,"description":"Este problema é dedicado a todos nós que estudamos ou trabalhamos longe da cidade onde moram nossas famílias!\n\nJoão adora queijo. Muçarela, parmesão, provolone, não importa, ama-os todos. João gosta tanto de queijo que põe queijo em tudo o que cozinha, até mesmo em sobremesas. A família de João é tão louca por queijo quanto ele. Como neste fim de semana ele está indo visitar seus familiares, que moram longe, decidiu levar um pouco do famoso queijo chapecoense para eles. João pretende organizar uma festa assim que chegue à sua cidade natal. A ideia é cortar todo o queijo que levar em cubos de 1 cm de lado e montar uma pirâmide com eles como a pirâmide da figura, que possui 5 cubos de queijo na base. Talvez não seja possível utilizar todos os cubos de queijo na construção da pirâmide. Neste caso, João come todo o queijo que sobrar.\n\n\n\nNa loja de queijos de Chapecó, há queijos de vários tamanhos e preços, todos em forma de paralelepípedo. Não é necessário comprar uma peça inteira de queijo. Pode-se solicitar um volume específico, por exemplo:\n\n— Sr. Cleijon, poderia por favor cortar para mim um pedaço de 20 cm × 10 cm × 30 cm de queijo parmesão?\n\nJoão estava com um orçamento restrito para comprar os queijos para levar para sua família, mas mesmo assim comprou o maior volume de queijo possível respeitando o orçamento que destinou para isso.","id":"1966","category":"Ad-Hoc","statistics":{"level":"8 / 10","submissions":984,"solved":128,"ratio":"13.01%"}}