{"output":"Imprima G linhas contendo C inteiros cada, de modo que o j-ésimo inteiro da i-ésima linha represente a quantia de bitcoins que a Reitoria precisa transferir para o curso i do campus j. Siga rigorosamente as mesmas regras de espaçamento entre colunas da entrada.","input":"A primeira linha da entrada consiste de quatro inteiros positivos, G, A, M e C (G ≤ 600; A, C ≤ 100; M ≤ 2000), os quais representam respectivamente o número de cursos de graduação, o número total de tipos de atividade que podem ocorrer, o número total de tipos de material que podem ser necessários e o número de campi da UFFS. Os cursos são designados na entrada pelos inteiros de 1 a G, os tipos de atividade pelos inteiros de 1 a A, os tipos de material pelos inteiros de 1 a M e os campi pelos inteiros de 1 a C. Seguem, então, três tabelas de inteiros não-negativos. Cada tabela é precedida por uma linha em branco, entre duas colunas consecutivas de uma mesma tabela há uma coluna de espaços de largura 1, e espaços adicionais podem preceder cada inteiro duma tabela a fim de que todas as colunas daquela tabela fiquem alinhadas à direita e haja ao menos um inteiro por coluna que não seja precedido por espaços adicionais. A primeira tabela consiste de G linhas, cada uma contendo A inteiros não maiores que 10, de modo que o j-ésimo inteiro da i-ésima linha representa quantas atividades do tipo j um curso de graduação i precisa realizar no ano corrente. A segunda tabela consiste de A linhas, cada uma contendo M inteiros não maiores que 10, de modo que o j-ésimo inteiro da i-ésima linha representa de quantos materiais do tipo j a realização de uma atividade do tipo i precisa. A terceira e última tabela consiste de M linhas, cada uma contendo C inteiros não maiores que 100, de modo que o j-ésimo inteiro da i-ésima linha representa o preço, em bitcoins, de uma unidade do material do tipo i no planeta em que se situa o campus j.","level":8,"name":"A Fronteira Final","has_images":false,"description":"É o ano de 2.265, e a Universidade da Fronteira Final Sideral (UFFS) já conta com diversos campi espalhados pela galáxia, de modo que todos os cursos de graduação da UFFS são ofertados em todos os campi. Cada curso promove várias atividades por ano, e as atividades promovidas por um curso são as mesmas em todos os campi da UFFS. Para que cada atividade possa acontecer, a Universidade precisa comprar uma certa quantidade de materiais, mas os preços de cada material não são os mesmos para todos os campi. Um lápis, por exemplo, pode custar Ƀ2 (2 bitcoins) para o campus de Chapecó, no planeta Terra, e Ƀ7 (7 bitcoins) para o campus de ShiKahr, no planeta Vulcano. Apesar das diferenças de custo, nunca compensa comprar materiais num campus para enviá-los para outro campus, dados os elevadíssimos custos de transporte e taxas de importação e de exportação. Assim, a fim de que todas as atividades da Universidade possam ser realizadas, a Reitoria precisa transferir para cada curso de cada campus a quantia certa de bitcoins a fim de que os cursos possam eles próprios comprar os materiais.","id":"1967","category":"Matemática","statistics":{"level":"8 / 10","submissions":375,"solved":55,"ratio":"14.67%"}}