{"output":"Para cada evento da forma -> A B, imprima uma linha contendo um valor que represente o número de possibilidades para o arquivo com o qual se entrou na máquina. Após processar todos os eventos, imprima uma linha extra contendo um valor que represente o número de possibilidades para o arquivo com o qual A. K. M. entraria na máquina se desejasse enviar uma mensagem para todas as G gerações. Como os números de possibilidades representados em cada linha da saída podem ser muito grandes, imprima apenas o resto que eles deixam quando divididos por 109 + 7.","input":"A primeira linha da entrada consiste de dois inteiros, G e E (1 ≤ G, E ≤ 105), os quais representam respectivamente o número de gerações cadastradas na máquina e o número de eventos descritos na entrada. As gerações são identificadas na entrada pelos inteiros de 1 a G. A segunda linha da entrada consiste de G inteiros, de modo que o i-ésimo inteiro, Ci (2 ≤ Ci ≤ 1010, 1 ≤ i ≤ G), representa o comprimento de mensagem estabelecido pela geração i. Cada uma das E linhas seguintes representa um evento e obedece um dos formatos abaixo:\n\n                    \n                        \n                            -> A B\n                            indica que A. K. M. entrou com um arquivo na máquina para enviar uma mensagem para cada geração de A até B (1 ≤ A, B ≤ G);\n                        \n                        \n                            <- A C\n                            indica que o comprimento de mensagem estabelecido pela geração A deve ser atualizado para C (1 ≤ A ≤ G, 2 ≤ C ≤ 1010).","level":10,"name":"Generations","has_images":false,"description":"Ainda não é possível construir uma máquina que permita viagens no tempo a um corpo de matéria. No entanto, o físico Asdrubal Keyla Monteiro já conseguiu desenvolver uma máquina que consegue enviar mensagens através do tempo, comunicando-se com gerações do futuro. Teoricamente também seria possível utilizar essa máquina para enviar mensagens a gerações do passado, mas elas não teriam a tecnologia para receber essas mensagens. Cada mensagem é uma sequência binária de um comprimento fixo estabelecido pela geração com a qual A. K. M. está se comunicando. O fim de cada mensagem é sempre marcado por 11, padrão que obviamente não pode ocorrer em nenhum outro lugar da mensagem, senão a mensagem chegaria truncada ao seu destino. Por exemplo, se o comprimento de mensagem estabelecido pela geração com a qual A. K. M. está se comunicando é 6, há 5 possibilidades para a mensagem enviada para aquela geração:\n\n000011      001011      010011      100011      101011\n\nO interessante desse protocolo de comunicação é que, concatenando-se mensagens, é possível entrar com um único arquivo na máquina para que ela envie uma mensagem para cada uma dentre um conjunto de gerações especificadas. Por exemplo, se A. K. M. deseja se comunicar com as gerações cadastradas na máquina respectivamente como 1, 2 e 3, e se os comprimentos de mensagem estabelecidos pelas gerações são respectivamente 3, 5 e 3, são 3 possibilidades para o arquivo com o qual se pode entrar na máquina:\n\n01100011011      01101011011      01110011011\n\nA máquina que A. K. M. desenvolveu apenas envia mensagens. Por enquanto, ainda não é possível receber mensagens do futuro. A única coisa que é possível receber de uma geração do futuro é a informação do comprimento da mensagem. Frequentemente as gerações atualizam esse valor, e A. K. M. precisa estar atento.","id":"1969","category":"Matemática","statistics":{"level":"10 / 10","submissions":189,"solved":36,"ratio":"19.05%"}}