{"output":"Assuma que as matrizes em nomes A1, A2, ..., AN. Para cada caso de teste, seu programa deverá imprimir uma linha contendo a ordem das matrizes a serem multiplicadas (Seguindo o exemplo de saída), em caso de mais de uma solução possível seu programa deverá imprimir apenas a quantidade total de contas necessárias.","input":"A entrada contém vários casos de teste. A primeira linha de cada caso de teste contém um inteiro N (1 ≤ N ≤ 1000), indicando o número de matrizes a serem multiplicadas. Segue então N linhas cada uma contendo dois inteiros L e C (1 ≤ L, C ≤ 100), indicando o número de linhas e colunas de cada matriz. A entrada termina quando N = 0 e não deverá ser processada.","level":10,"name":"Matrizes","has_images":false,"description":"Gustavo em uma de suas aulas de pré-cálculo aprendeu a fazer multiplicações de matrizes, como ele é um aluno muito esperto, rapidamente percebeu que quando fazemos a multiplicação, a ordem com que as matrizes são multiplicadas pode influenciar na quantidade total de contas necessárias para encontrar a resposta.\n\n\t\t\t\t\tApesar de muito dedicado, Gustavo está com pouco tempo para realizar trabalhos da faculdade, pois atualmente está estudando muito para a maratona de programação, então ele pediu sua ajuda em um tarefa solicitada na aula de pré-cálculo.\n\t\t\t\t\tA professora passou como exercício diversas matrizes para que a turma treinasse a multiplicação, então Gustavo precisa de um programa que dado as dimensões das matrizes, o informe qual a melhor ordem de realizar as multiplicações levando em consideração a menor quantidade de contas necessárias para gerar a resposta.\n\n\t\t\t\t\tComo você é amigo de Gustavo e tem mais tempo do que ele, resolveu ajudá-lo, mas com algumas regras:\n\t\t\t\t    1ª Gustavo sempre terá que informar matrizes onde a multiplicação na ordem dada é sempre possível;\n\t\t\t\t    2ª Caso haja mais que uma solução ótima, seu programa irá informar somente a quantidade de contas necessárias para a multiplicação.","id":"1976","category":"Paradigmas","statistics":{"level":"10 / 10","submissions":614,"solved":70,"ratio":"11.40%"}}