{"output":"Seu programa deverá produzir duas linhas na saída. Uma contendo o horário de chegada a faculdade e outra contendo \"Ira se atrasar\" ou \"Nao ira se atrasar\".","input":"A entrada contém vários casos de teste. A primeira linha contém três inteiros separados por um espaço, X (1 ≤ X ≤ 50), N (1 ≤ N ≤ 90) e V (1 ≤ V ≤ 10), indicando o tempo que Anne levá para ir do trabalho ao ponto, a quantidade possíveis rotas e o número de pontos que ela poderá passar. Seguem-se, então, N linhas, cada uma com duas strings não-vazias e únicas contendo os locais das rotas que Anne pode passar e um inteiro separados por espaço, O, D e T (1 ≤ T ≤ 60), indicando que existe uma rota para ir do local O para o local D, e que tal trajeto levará T minutos. A entrada termina quando X = N = V = 0, e não deve ser processada.","level":8,"name":"Não Posso me Atrasar","has_images":false,"description":"Anne é uma aluna muito aplicada do curso de ciência da computação. Ela não gosta de chegar atrasada de forma alguma, sempre tenta chegar no máximo 18:00 em ponto que é o horário de início das aulas. Porém o trânsito na cidade de Teresópolis entre 16:30 e 19:00 é muito lento, então um trajeto que normalmente levaria 10 minutos, leva um tempo bem maior. Anne sai do seu trabalho às 17:00 e leva aproximadamente X minutos para chegar ao ponto, porém os ônibus em direção à faculdade passam exatamente as 17:30, nesse horário passam diversos ônibus com trajetos diferentes que levarão à faculdade, caso Anne os perca, terá de esperar até as 17:50 até passar mais ônibus. Do ponto de ônibus que ela geralmente espera, até a faculdade, levará facilmente mais de 30 minutos se não escolher o ônibus que tenha o melhor trajeto. Anne precisa saber que horas ela chegará a faculdade escolhendo o melhor trajeto e se chegará atrasada.  \n\t\t\t\t\t \n\t\t\t\t\tSua tarefa é, a partir de N rotas possíveis, dizer que horas Anne chegará na faculdade indo pelo melhor trajeto, sabendo que ela deve sair da varzea e chegar ao alto, com pesos T de tempo entre um local e outro, levando em consideração o trânsito (o T da varzea ao alto não é o mesmo que do alto a varzea, pois o transito no sentido contrário pode ser diferente) e informar se houve ou não atraso. Assuma que Anne sempre chegará no ponto antes de 17:50 e que sempre terá um caminho entre a Várzea e o Alto.","id":"1977","category":"Grafos","statistics":{"level":"8 / 10","submissions":862,"solved":177,"ratio":"20.53%"}}