{"output":"Para cada caso de teste, deverá ser impressa uma linha contendo a resposta \"SIM\", caso seja possível dispor os alunos \n\t\t\t\t\tde forma que não hajam dois amigos realizando a prova na mesma sala, e \"NAO\", caso contrário.","input":"A entrada é composta de diversos casos de teste. A primeira linha de cada caso de teste consiste em um inteiro N (2 ≤ N ≤ 100) indicando o número de alunos que irão realizar a prova.\n\t\t\t\t\tCada N par de linhas seguintes descreve as relações de amizade de cada participante, de forma que a primeira linha \n\t\t\t\t\tconsiste no identificador do participante, e a linha seguinte consiste em uma lista descrevendo uma quantidade M de \n\t\t\t\t\talunos (1 ≤ M < N) com os quais aquele participante possui uma relação de amizade.\n\t\t\t\t\tConsidere que não é relevante o número de pessoas dispostas em cada sala, e que, se existe uma relação de amizade entre \n\t\t\t\t\talunos x e y, existe uma relação de amizade entre y e x. A entrada termina quando N = 0, e não deve ser processada.","level":6,"name":"Salas Separadas","has_images":false,"description":"Luiz é um coordenador muito dedicado do curso de ciência da computação. Ele sabe a importância de incentivar seus alunos a esforçarem-se em algoritmos, por isso decidiu realizar uma competição de programação individual entre estes, com direito a premiação.\n\n\t\t\t\t\tLuiz gostaria de evitar ao máximo a possibilidade de fraude na competição, e por isso não gostaria que houvessem dois candidatos amigos na mesma sala durante a realização da prova.\n\n\t\t\t\t\tInfelizmente Luiz só dispõe de duas salas para a realização da prova, mas felizmente conhece muito bem seus alunos, e sabe dizer com facilidade quem é amigo de quem. Entretanto, ele precisa saber se será possível, apenas com as duas salas disponíveis, combinar os alunos da forma que deseja e para isso solicitou a você, aluno dedicado do curso,\n\t\t\t\t\tque crie um programa para ajudá-lo.","id":"1979","category":"Grafos","statistics":{"level":"6 / 10","submissions":1407,"solved":413,"ratio":"29.35%"}}