{"output":"Para cada caso de teste, imprima em uma única linha um inteiro que representa o número mínimo de vias aquáticas adicionais que devem ser construídas de modo que cada ilha pertença a pelo menos um circuito turístico.","input":"A entrada contém vários casos de teste. Cada teste é descrito em várias linhas. A primeira linha contém dois números inteiros N e M (3 <= N <= 100, 1 <= M <= 1000) que indicam o número de ilhas e o número de vias aquáticas, respectivamente. Cada ilha é identificada por um número entre 1 e N. Cada uma das M linhas seguintes contém dois inteiros U e V (1 <= U <V <= N), indicando que existe um percurso de ligação aquático ilhas U e V. Pode-se supor que em cada caso de teste existe no máximo um percurso aquático que liga o mesmo par de ilhas. A última linha da entrada contém o número -1 duas vezes e não deve ser processado como um caso de teste.","level":10,"name":"Circuitos Turísticos","has_images":false,"description":"Todo mundo está ciente da existência do bem conhecido arquipélago Nordenskjold, situado no Oceano Ártico e pertencente ao Krasnoyarsk Krai da Rússia. Este arquipélago é constituído por um grupos de ilhas N e M rotas aquáticas entre alguns pares de ilhas. Cada percurso liga um par de ilhas e para cada par, há no máximo um percurso ligando-os.\n\n                    Considerando a popularidade do Archipelago Nordenskjold, autoridades de Krasnoyarsk estão preocupadas com o seu valor turístico. O valor turístico do arquipélago é dado pelo número total de ilhas que pertencem a pelo menos um \"circuito turístico\". Um circuito turístico é um caminho que começa e termina na mesma ilha que visita pelo menos três diferentes ilhas, nunca visita a mesma ilha mais de uma vez e usa apenas as rotas aquáticas para ir de uma ilha para a próxima.\n\n                    Autoridades de Krasnoyarsk quer saber o número mínimo de rotas aquáticas adicionais que devem ser construídas de modo que cada ilha pertença a pelo menos um circuito turístico. Sua tarefa é escrever um programa que responde a esta pergunta.","id":"1988","category":"Grafos","statistics":{"level":"10 / 10","submissions":44,"solved":7,"ratio":"15.91%"}}