{"output":"Para cada caso de teste, imprima por linha um inteiro que representa o número total de diferentes conjuntos equilibrados que pode ser obtido através da adição de um número inteiro para o conjunto dado, tal como se explica na descrição do problema.","input":"A entrada contém vários casos de teste. Cada caso de teste é descrito em duas linhas. A primeira linha contém um único número inteiro positivo N que indica o número de elementos do conjunto equilibrado deve ter (3 <= N <= 499). A segunda linha contém N-1 inteiros distintos Z_i que representam os elementos dados do conjunto (-1014 <= Z_i <= 1014 para 1 <= i <= N-1). A última linha da entrada contém o número -1, e não deve ser processado como um caso de teste.","level":9,"name":"Equilíbrio","has_images":false,"description":"A média e a mediana geralmente confunde os alunos por causa de sua ortografia semelhante, mas eles são muito diferentes conceitos. Neste problema, vamos trabalhar com a média e a mediana de um conjunto constituído por N pares inteiros distintos, onde N é ímpar. A média de tal conjunto é definida, como é habitual, como a soma dos números divididos por N, enquanto que a mediana é o único elemento no conjunto que é maior do que (N-1) / 2 dos seus elementos, e menor do que o outro (N-1) / 2 elementos do conjunto. Por exemplo, se o conjunto é {0, 2, 6, 4, 13}, a média é 5 enquanto a mediana é 4.\n\n                    Nosso objetivo é tornar a vida do aluno mais fácil através da geração de conjuntos \"equilibrados\", isto é, conjuntos compostos por um número ímpar de inteiros, todos distintos entre si, onde a média e a mediana coincidem. Por exemplo, o conjunto {0, 2, 6, 4, -2} é equilibrado, uma vez que tem N = 5 inteiros diferentes, e a média e mediana, são ambos iguais a 2.\n\n                    O procedimento seguinte tem sido sugerido para a obtenção de conjuntos equilibrados. Um conjunto com um número par de inteiros distintos é escolhido, e um número inteiro adicional diferente de cada elemento do conjunto é adicionada a ele, de tal modo que o conjunto resultante é equilibrado. Nós queremos que você verifique se o procedimento indicado funciona. Por isso a sua tarefa é, dado N-1 inteiros distintos, com N ímpar, contar o número de conjuntos equilibrados que podem ser formados, seguindo o procedimento descrito.","id":"1990","category":"Matemática","statistics":{"level":"9 / 10","submissions":176,"solved":78,"ratio":"44.32%"}}