{"output":"Para cada caso de teste, imprima em uma única linha um inteiro representando o número de tendas diferentes válidas que podem ser configurados usando as varas dadas.","input":"A entrada contém vários casos de teste. Cada caso de teste é descrito em duas linhas consecutivas. A primeira linha contém um inteiro N que indica o número de varas (1 <= N <= 60). A segunda linha contém N inteiros H_i representando as alturas das varas em pés (1 <= H_i <=109 para 1 <= i <= N). A última linha da entrada contém um único -1 e não deve ser processado como um caso de teste.","level":9,"name":"Construção de Tendas","has_images":true,"description":"O Comitê Internacional de Preparação de Tendas (ICPC) tem um procedimento peculiar para a criação de suas tendas. O procedimento depende de uma visão bidimensional das tendas.\r\n\r\n                    Uma determinada tenda é criada utilizando N pólos de diferentes alturas. Para configurar as tendas, o ICPC usa o seguinte procedimento. Primeiro, N+2 pontos são marcadas no chão, todos na mesma linha, de modo que dois pontos consecutivos são sempre separados por uma distância de exatamente dois pés. Depois disso, uma vara é colocada verticalmente sobre cada um dos N pontos centrais. Finalmente, a tenda é estendida sobre as varas, juntando-se a extremidade superior de cada vara com a extremidade superior das varas vizinhas. As primeiras e últimas varas são unidas com os pontos livres no chão.\r\n\r\n                    A figura a seguir mostra três possíveis formas de criação de uma tenda usando as instruções mencionadas antes, com alturas das varas de 4, 5, 7, 8 e 9.\r\n\r\n                     \r\n                        \r\n\r\n                    Depois de anos de trabalho duro, o ICPC chegou à conclusão de que, a fim de obter tendas úteis e robustas, é necessário que o ângulo formado por duas lonas consecutivas na extremidade de uma vara, medido em seu interior, é estritamente inferior a 180 graus. Na figura, somente a tenda na esquerda satisfaz esta condição. A tenda no meio tem um ângulo superior a 180 graus nas varas de altura 4 e 7, enquanto a tenda da direita tem um ângulo de exatamente 180 graus na vara de altura 8. Dizemos umatenda é válida quando cumpre a recomendação da ICPC.\r\n\r\n                    É claro que, dado o número de varas e suas alturas, há um grande número de diferentes maneiras de colocá-los, alguns dos quais irão produzir telas válidas e alguns não. A tarefa é, através destes dados, contar o número de diferentes tendas válidas que podem ser criadas. Duas tendas válidas são consideradas diferentes se a sequência de alturas das varas em um deles, visto da esquerda para a direita, é diferente da sequência de alturas do outro, visto da mesma maneira.","id":"1996","category":"Paradigmas","statistics":{"level":"9 / 10","submissions":37,"solved":8,"ratio":"21.62%"}}