{"output":"A saída é uma linha com um número inteiro que representa a soma dos valores de todas as plantas que se encontram no exterior da vedação.","input":"A primeira linha contém dois inteiros P e V, que representam, respectivamente, o número de plantas e o número de vértices de cima do muro poligonal (1 ≤ P, V ≤ 105). Cada uma das linhas próximas a P descreve uma planta diferente, com dois inteiros Xp e Yp, indicando as coordenadas da planta (-109 ≤ Xp, Yp ≤ 109). O valor da planta p-th na entrada é P, para p = 1, 2,. . . , P. Cada uma das seguintes linhas V descreve um vértice da vedação com dois números inteiros Xv e Yv, indicando as coordenadas do vértice (-109 ≤ Xv, Yv ≤ 109).\nVértices são dadas na ordem anti-horário. Cada um destes pontos é um real vértice do polígono, isto é, ela não é colinear com os seus dois vértices adjacentes. O polígono é representado um polígono simples com cada lado paralelo a um eixo. Não há duas plantas estão na mesma posição, e nenhuma planta encontra-se no lado de uma cerca.","level":9,"name":"Falha Ao Cercar Legumes","has_images":false,"description":"Aos 40 anos, Alice e Bob decidiram se aposentar. Depois de mais de duas décadas de trabalho como exemplos de protocolos de rede, livros teóricos sobre jogos e vários outros textos, eles estavam cansados. Para permanecerem ativos, eles decidiram praticar a jardinagem.\n\nAlice e Bob plantaram vários vegetais em um enorme campo. Depois de terminado, eles perceberam que as plantas precisariam de proteção contra animais selvagens, então eles decidiram construir uma cerca para protegê-los. O campo é representado pelo plano XY e cada vegetal está em um ponto diferente. A cerca é representada como um polígono no plano. De qualquer forma, nem todo polígono é uma cerca válida. Ela deve ser uma cerca de um único polígono simples, com cada um dos seus lados paralelos a um dos eixos. Claro que, o polígono deve conter todos os pontos que representam as plantas. Uma cerca demasiado perto das plantas ou para si poderia tornar difícil para caminhar ao redor, de modo que cada lado do polígono precisa ser afastado de todas as plantas e todos os lados não adjacentes.\n\nInfelizmente, Alice e Bob contrataram uma multinacional desagradável para a construção da cerca. A empresa tinha um monte de advogados na folha de pagamento, mas não há bons designers da cerca, pois eles não cumpriram com todos os requisitos. Eles construíram uma cerca que é um polígono simples com lados paralelos aos eixos e cujos lados são longe de plantas e em si. No entanto, eles se esqueceram de fazer a cerca conter todas as plantas! Alice e Bob querem ajuda para avaliar a extensão do problema.\n\nUma vez que nem todas as plantas são igualmente valioso para eles, eles querem saber o valor total das plantas que foram deixados do lado de fora da cerca.","id":"2007","category":"Matemática","statistics":{"level":"9 / 10","submissions":323,"solved":103,"ratio":"31.89%"}}