{"output":"Para cada uma das Q consultas, mostre uma linha com a letra maiúscula \"Y\" se o grupo sanguíneo correspondente é possível na descendência dos pais dadas; caso contrário saída a letra maiúscula \"N\". Escreva os resultados na mesma ordem que as consultas aparecem na entrada.","input":"A primeira linha contém dois inteiros N e Q, representando respectivamente o número de pais (e alelos e tipos de antígenos) e o número de consultas (1 ≤ N ≤ 100 e 1 ≤ Q ≤ 40). Cada uma das N linhas seguintes descreve o grupo de sangue de um dos pais. Depois disso, cada uma das seguintes linhas Q descreve um grupo de sangue para testar. Tipos de antigenes são identificados com números inteiros distintos de 1 a N, não letras. Cada linha que descreve um grupo sanguíneo contém um número inteiro B que indica o número de tipos de antigenes do grupo sanguíneo (0 ≤ B ≤ N), seguido por B inteiros diferentes C1, C2, ..., CB representando os tipos de antigénios presentes no sangue grupo (1 ≤ Ci ≤ N para i = 1, 2, ..., B).","level":6,"name":"Grupos Sanguineos","has_images":true,"description":"Existem quatro grupos possíveis de sangue para os seres humanos: AB, A, B e O, o que significa que os glóbulos vermelhos têm antigenes de tipos, respectivamente, A e B, a apenas A, apenas B, e sem antigene em tudo. O nosso grupo de sangue é determinado por dois alelos no nosso DNA. Cada alelo é do tipo A, B ou O. A tabela a seguir lista os possíveis combinações de alelos que alguém pode ter para cada grupo sanguíneo:\n\n\t\t\t\t\t\n\n\t\t\t\t\tNós herdamos exatamente um alelo de cada um dos nossos dois pais. Assim, tendo em conta os grupos sanguíneos de ambos os pais, podemos dizer com certeza se algum grupo de sangue é possível, ou não, em sua prole. Por exemplo, se os grupos sanguíneos dos dois pais são AB e B, em seguida, as possíveis combinações de alelos para eles são, respectivamente, {AB} e {OB, BB}. Desde o fim dos alelos não importa, as possíveis combinações de alelos para a prole são {OA, AB, OB, BB}. Isso significa que os grupos sanguíneos AB, A e B são possíveis em sua prole, mas o grupo sanguíneo O não é. Muito bom de fato! Mas e se a vida na Terra evoluiu de modo que uma pessoa tinha três pais, três alelos, e três tipos de antígenos diferentes? As combinações de alelos ficaria assim:\n\n\t\t\t\t\t\n\n\t\t\t\t\tSe os grupos sanguíneos dos três pais são A, BC e O, em seguida, todos os grupos sanguíneos são possíveis em sua prole, exceto os grupos BC e ABC. O universo é vasto! Pode haver, lá fora, no espaço, alguma forma de vida cujos indivíduos têm pais N, N alelos, e N diferentes tipos de antígenos. Tendo em conta os grupos sanguíneos para os pais N, e uma lista de grupos sanguíneos Q para testar, o programa tem de determinar quais os que são possíveis, e quais não são, na descendência dos pais dadas.","id":"2014","category":"Ad-Hoc","statistics":{"level":"6 / 10","submissions":150,"solved":77,"ratio":"51.33%"}}