{"output":"Saída de uma linha com um inteiro representando o número total máximo de pontos extras que Daedalus poderia ter obtido, se ele tivesse escolhido o melhor cartão de possível em cada rodada, assumindo que as cartas escolhidas pelos outros jogadores permaneçam inalteradas.","input":"A primeira linha contém dois inteiros N e M, representando respectivamente o número de jogadores e o número de rodadas (1 ≤ N ≤ 20 e 1 ≤ M ≤ 50). Cada uma das M linhas seguintes descreve uma rodada com um número inteiro B, indicando o orçamento (1 ≤ B ≤ 106), seguido de N inteiros C1, C2, ..., CN representam que o jogador i-ésimo escolheu o cartão marcada com Ci pontos durante essa rodada (Ci ∈ {1, 10, 100, 1000, 10000} para i = 1, 2, ..., N). Daedalus é o primeiro jogador.","level":4,"name":"D como em Daedalus","has_images":true,"description":"Daedalus está jogando o jogo de \"Não seja ganancioso\", no qual os N jogadores sentam em torno de uma mesa tendo cada um deles cinco cartões rotulados 1, 10, 100, 1000 e 10000 pontos. Em \"Não seja ganancioso\" os jogadores não podem conversar entre si uma vez que o jogo começa, e existem M rodadas. Em cada rodada, o banco anuncia um orçamento B. Em seguida, cada jogador escolhe uma das cartas e coloca-a, de rosto para baixo, sobre a mesa. O banco então vira as cartas, de modo que todos os jogadores podem ver todos as N cartas. Se a soma dos pontos nas cartas escolhidas é menor ou igual a B, então o banco para cada jogador dá exatamente a quantidade de pontos na placa de que ele ou ela escolheu. Caso contrário, ninguém recebe nada. Cada jogador recebe a sua carta de volta antes da próxima rodada. Os jogadores estão muito racionais e gostariam de maximizar os seus pontos e minimizar os seus arrependimentos! O que você faria nesta situação? Cooperaria ou afundaria o jogo?\n\n\t\t\t\t\tTome a tabela a seguir como um exemplo. Daedalus ganhou um total de 10 pontos, no final, porque apenas o primeiro round foi bem sucedida. Mas, olhando para trás no jogo, ele vê que ele poderia ter ganho 110 pontos, se tivesse escolhido 100 pontos na primeira rodada e 10 pontos na terceira rodada. Ou seja, Daedalus poderia ter ganho 100 pontos extra! Isto somente, é claro, assumindo que as cartas escolhidas pelos outros jogadores permaneçam inalteradas.\n\n\t\t\t\t\t\n\n\t\t\t\t\tDado o orçamento e as cartas escolhidas em cada rodada, é preciso calcular o número total máximo de pontos extras que Daedalus poderia ter obtido, no final, se tivesse escolhido o melhor cartão de possível em cada rodada, assumindo as cartas escolhidas pelo outro jogadores permaneçam inalteradas.","id":"2016","category":"Ad-Hoc","statistics":{"level":"4 / 10","submissions":582,"solved":301,"ratio":"51.72%"}}