{"output":"Para cada caso de teste, imprima uma linha contendo o tamanho da menor sequência e o número de sequências que Cino pode escolher, separados por um único espaço. É garantido que um inteiro de 64 bits com sinal seja suficiente para armazenar a resposta.","input":"A entrada é constituída de múltiplos casos de teste. Cada caso de teste é constituído por 3 linhas. A primeira linha de cada caso de teste contém 3 inteiros, N (1 ≤ N ≤ 50), X e Y (1 ≤ X, Y ≤ 103), representando respectivamente a quantidade de pontos turísticos, o tamanho da sequência escolhida por Cici e o tamanho da sequência escolhida por Cini. A segunda linha contém X inteiros, representando a sequência escolhida por Cici. A terceira linha contém Y inteiros, representando a sequência escolhida por Cini. A entrada termina com final de arquivo (EOF).","level":9,"name":"Cici, Cini e Cino","has_images":false,"description":"Cici, Cini e Cino viajaram para o Polo Norte, e querem conhecer os principais pontos turísticos de lá. Para ajuda-los, o Papai Noel decidiu emprestar três renas para eles. As renas do Papai Noel tem capacidade de se teletransportarem, fazendo que as viagens entre os pontos turísticos sejam instantâneas.\n\nPapei Noel informou que existem N pontos turísticos, e que suas renas podem realizar dois tipos de passeios:\n\nPasseio tipo 1: Dada uma sequência de pontos turísticos que deseja visitar, a rena realiza um passeio parando durante um hora em cada ponto da sequência. Por exemplo: Dada a sequência <1, 2, 1>, a rena vai ficar durante uma hora no ponto 1, depois uma hora no ponto 2 e mais uma hora no ponto 1.\n\nPasseio tipo 2: Dada uma sequência de pontos turísticos que deseja visitar, a rena realiza um passeio do tipo 1 utilizando uma subsequência não vazia da sequência escolhida.  Por exemplo, se a sequência escolhida for <1, 2, 1>, a rena pode fazer qualquer um dos 6 passeios distintos, escolhido aleatoriamente por ela:  <1>, <2>, <1, 1>, <1, 2>, <2, 1>, <1,2,1>.\n\nCici e Cini gostaram do fator surpresa do passeio de tipo 2, porém, Cino optou pelo do tipo 1. Como Cici, Cini e Cino possuem preferências diferentes, cada um pode escolher uma sequência diferente de lugares. Sabendo as sequências escolhidas por Cici e Cini, Cino vai escolher a menor sequência em que seja garantido que em pelo menos um local não seja visitado pelos três amigos ao mesmo tempo.\n\nPor exemplo: O Papei Noel informou que o Polo Norte possui 3 pontos turísticos distintos. Cici escolhe a sequência <1, 2>. Cini escolhe <2, 3>. Logo, Cino pode escolher as sequências <1> e <3>, mas não pode escolher a sequência <2>, pois existe a chance de os três visitarem o ponto <2> ao mesmo tempo.","id":"2019","category":"Ad-Hoc","statistics":{"level":"9 / 10","submissions":74,"solved":17,"ratio":"22.97%"}}