{"output":"Para cada lista codificada por elfos, deve-se apresentar a mensagem “LISTA #X:”, onde X é o número da lista seguindo a sequência (1, 2, 3, ...), em seguida deve-se listar todos os presentes em ordem alfabética e maiúsculo, um em cada linha.  Imprimir uma linha em branco entre dois casos de teste consecutivos. No fim da saída não deve haver uma linha em branco.","input":"A primeira linha de cada caso de teste contém um inteiro N (1 ≤ N ≤ 10000), que corresponde ao número de linhas codificadas por elfos. As N  linhas seguintes contém um número indefinido de inteiros i (1 ≤ i ≤ 27), cada número inteiro i  representa a linha da matriz e se i for 27, um espaço. A entrada termina com final de arquivo (EOF).","level":8,"name":"Elfos e seus Códigos","has_images":true,"description":"Neste ano Papai Noel recebeu várias listas de presentes, com pedidos e mais pedidos. Para dificultar, todas as listas são codificadas por elfos. Como são milhares de listas e o Papai Noel é organizado, decidiu pedir a sua ajuda. Ele sabe que você é dedicado e conhece o padrão de decodificação dos elfos, e para isso disponibilizou 26 gnomos e 676 duendes. Cada lista é decodificada através da colaboração de gnomos e duendes ajudantes do Papai Noel. Os gnomos são enumerados de 1 a 26 e para cada gnomo, 26 duendes que correpondem a letras de A até Z (incluindo as letras K, W, Y). Quando a decodificação é iniciada, todas as N linhas são executadas. Cada N linha corresponde a um presente. Seguem os passos para decodificar uma determinada lista criada por elfos:\r\n\r\n                    \r\n                        1º Os gnomos e duendes são organizados, gnomos representam linhas e duendes representam as colunas.\r\n                        \r\n                        2º Para cada gnomo, é encontrado um duende. Por exemplo, se o número inteiro i for 2 (linha 2) o gnomo é 2 e obrigatoriamente o duende também é 2, correspondendo, portanto, ao caractere B.\r\n                        \r\n                        3º Todos os duendes, na posição gnomo devem ser movidos para o final.\r\n                        \r\n                        4º A linha correspondente ao gnomo é movida para a última posição válida.\r\n\t\t\t\t\t\t\r\n                         Após este primeiro movimento, se o próximo número da entrada para i for 2 (linha 2) o gnomo agora será 3 e consequentemente o duende também será 3, correspondendo portanto, ao caractere D.\r\n                    \r\n          \r\n\t\t\t\t\t\tO 1º passo é executado a cada nova lista codificada por elfos, o 2º, 3º e 4º passo são executados a cada número inteiro i que corresponde a linha da matriz. Papai Noel quer saber os presentes que contém na lista codificada por elfos.","id":"2020","category":"Estruturas e Bibliotecas","statistics":{"level":"8 / 10","submissions":452,"solved":117,"ratio":"25.88%"}}