{"output":"Deve ser impressa a lista ordenada, dentro das especificações descritas anteriormente, sendo mostrado primeiramente o nome do dono da lista antecedido de \"Lista de \" seguido por uma lista que mostra somente o nome do objeto seguido do seu preço em reais, definido com duas casas após o ponto decimal. Deve ser mostrada uma linha em branco após todas as saídas.","input":"A entrada consiste de vários casos de teste. A primeira linha de cada caso de teste contém o Nome (sem espaços) do respectivo dono da lista, junto com um inteiro Q, (1 < Q <100) que define a quantidade de presentes listados. As próximas Q*2 linhas consistem no nome O do objeto desejado descrito em uma linha e o P preço do mesmo (1< P < 100.000.000) e a escala de preferência E (1< E < 10) na linha seguinte.  A entrada termina em EOF.","level":4,"name":"Presentes de Natal","has_images":true,"description":"Ah o natal... época mágica, tempo de sentimentos bons, jantares cheios de pessoas legais e recheados de boas comidas e, é claro: muitos presentes. \n\t\t\t\t\t\n\t\t\t\t\tJucilena foi uma boa menina durante esse ano. Sabendo disso, está montando sua lista de desejos natalinos. \n\t\t\t\t\tPorém, Jucilena é uma menina muito indecisa (e seus desejos são muitos), o que acaba confundindo o seu Nicolau quanto ao presente que ela realmente quer ganhar. Em suas listas, ela elencou o nome do presente desejado, seu preço (campo este solicitado pela sua mãe) e a escala de preferência pelo mesmo, do menos preferido (1) ao mais desejado (10). Vendo essa ideia de Jucilena, seus amigos também fizeram o mesmo, pois todos tinham diversas opções de presentes. \n\t\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\tTodo esse emaranhado de listas e presentes deixaram o seu Nicolau maluco! Vendo isso, o espírito natalino lhe tocou e você decidiu que ajudará Noel, criando um programa que elencará a lista dos mais desejados presentes para Jucilena e seus amigos. Os presentes devem ser mostrados na ordem descrescente do valor de preferência. Caso a preferência entre um e outro presente seja a mesma, o presente que deverá ser mostrado antes é o de menor preço. Caso haja semelhança entre preferência e preço, eles deverão ser elencados em ordem alfabética.","id":"2022","category":"Estruturas e Bibliotecas","statistics":{"level":"4 / 10","submissions":1208,"solved":354,"ratio":"29.30%"}}