{"output":"Para cada caso de teste imprima uma linha contendo um inteiro, representando a altura máxima da pilha caso seja possível empilhar os N presentes, ou -1 caso contrário.","input":"Cada caso de teste inicia com um inteiro N, representando a quantidade de presentes (1 ≤ N ≤ 105).\n\nEm seguida haverá N linhas, cada uma contendo três inteiros cada, A, B e C, representando as medidas dos presentes, conforme especificado no enunciado (1 ≤ A, B, C ≤ 104).","level":8,"name":"Empilhando Presentes","has_images":true,"description":"Cansado de gerenciar a produção de presentes e calcular o caminho mínimo para entregá-los às crianças durante o natal, Papai Noel resolveu tirar um cochilo. Quando os duendes perceberam a ausência do Noel eles resolveram tirar uma folga do trabalho para jogar um jogo que vieram elaborando por um tempo.\n\nO jogo que os duendes inventaram envolve N presentes que eles tinham recentemente fabricado, os quais tem formato de cubo com dimensões AxBxC, ou seja, A centímetros de largura, B centímetros de altura e C centímetros de profundidade.\n\nO objetivo é simples: dados os N presentes, ganha o jogo aquele que conseguir colocar os N presentes um em cima do outro formando a pilha de maior altura possível. Os presentes devem ser empilhados em ordem, ou seja, primeiro posiciona-se o presente 1 no chão, em seguida empilha-se o presente 2 em cima do presente 1, e assim por diante.\n\nVale notar que é possível rotacionar o presente em qualquer eixo de forma que qualquer uma de suas 6 faces esteja paralela ao chão, porém o perímetro desta face deve estar completamente contido no perímetro da face superior do presente abaixo. No caso do primeiro presente é possível escolher qualquer face, pois o chão é grande o suficiente.\n\nPor exemplo, seja N = 2, onde o primeiro presente tem dimensões 5x2x2, e o segundo presente tem dimensões 1x3x4, é possível posicionar o primeiro presente com a face de dimensões 2x2 para baixo e alcançar uma altura igual a 5, porém desta maneira não será possível posicionar o segundo presente em cima deste. Uma possível solução seria posicionar o primeiro presente com a face de dimensões 5x2 para baixo, e posicionar o segundo presente com a face de dimensões 3x1 logo acima deste, alcançando uma solução válida com altura igual a 6, tal como exemplificado na Figura 1.\n\n\n\nApós um bom tempo jogando os duendes ficaram curiosos para saber se realmente chegaram ao melhor resultado, e para isso pediram sua ajuda. Dadas as dimensões dos N presentes, verifique se é possível formar uma pilha com os N presentes e qual seria a altura máxima alcançada.","id":"2024","category":"Paradigmas","statistics":{"level":"8 / 10","submissions":392,"solved":102,"ratio":"26.02%"}}