{"output":"Cada saída de um caso de teste deve conter a linha “Teste #i”, indicando o número do teste. Após isso uma nova linha deve ser impressa informando o menor tempo possível (soma do tempo de todas as voltas e dos atrasos de pit stops) para que um piloto possa completar a prova e o menor número de pit stops para que isto ocorra, separados por espaço. \n\n\t\t\t\t\tA cada caso de teste deve haver uma linha em branco.","input":"A entrada consiste de uma linha contendo um número N (1 ≤ N ≤ 1000) indicando a quantidade de casos de teste. As N linhas seguintes representam os casos de teste. Cada caso de teste é composto por cinco inteiros:\n\n\t\t\t\t\t\n\t\t\t\t\t\tT1 o tempo de volta em milésimos de segundo com o pneu novo (1 ≤ T1 ≤ 106).\n\t\t\t\t\t\tT2, o tempo de volta em milésimos de segundo com o pneu desgastado (1 ≤ T1 ≤ T2 ≤ 106).\n\t\t\t\t\t\tA, o atraso em milésimos de segundo do pit stop (1 ≤ A ≤ 106).\n\t\t\t\t\t\tV, o número de voltas que um pneu novo pode dar até ficar desgastado (1 ≤ V ≤ 100).\n\t\t\t\t\t\tR, o número de voltas totais do GP de Formosa (1 ≤ R ≤ 100).\n\t\t\t\t\t\n\n\t\t\t\t\tConsidere que os carros largam de pneus novos.","level":8,"name":"Pit Stop","has_images":true,"description":"“Grazie, grazie, bellissimo!” – dizia um engenheiro da Scuderia Ferrari após uma estratégia inusitada que os fez ganhar o GP de Formosa de 2016, famoso circuito de rua do calendário da Fórmula 1. \n\n\t\t\t\t\tFórmula 1 é um esporte meio maluco. Às vezes, quando o pneu está muito desgastado, compensa fazer uma paradinha, denominada de pit stop, para colocar pneus novos e fazer voltas mais rápidas do que se estava fazendo antes. \n\n\t\t\t\t\tNo entanto, nem sempre vale a pena trocar de pneu, dependendo da quantidade de voltas que faltam e do atraso de uma parada de pit stop. \n\n\t\t\t\t\tCada pneu tem uma determinada autonomia de algumas voltas, depois ele volta a ficar desgastado e possivelmente uma nova troca será necessária para conseguir bons tempos. \n\n\t\t\t\t\tSerá que você, como futuro engenheiro da Ferrari consegue calcular a melhor estratégia de pit stops?","id":"2030","category":"Ad-Hoc","statistics":{"level":"8 / 10","submissions":350,"solved":102,"ratio":"29.14%"}}