{"output":"A saída deve conter o seguinte:\n\n\t\t\t\t\t\n\t\t\t\t\t\t“Jogador 1 venceu”: se o Jogador Um tiver vencido a partida\n\t\t\t\t\t\t“Jogador 2 venceu”: se o Jogador Dois tiver vencido a partida\n\t\t\t\t\t\t“Ambos venceram”: se os dois jogadores tiverem vencido a partida\n\t\t\t\t\t\t“Sem ganhador”: se não houver ganhador\n\t\t\t\t\t\t“Aniquilacao mutua”: se ocorrer Aniquilação Mútua\n\t\t\t\t\t\n\n\t\t\t\t\tCada saída de um caso de teste deve estar em uma linha.","input":"A entrada consiste de N (1 ≤ N ≤ 1000) casos de teste. N deve ser lido na primeira linha da entrada. Cada caso de teste é composto por duas linhas, cada uma contendo uma string. A primeira string representa o sinal escolhido pelo jogador 1 e a segunda string representa o sinal escolhido pelo jogador 2. Essas strings podem ser:\n\n\t\t\t\t\t\n\t\t\t\t\t\t“ataque”: para representar o Ataque Aéreo\n\t\t\t\t\t\t“pedra”: para representar a Pedra\n\t\t\t\t\t\t“papel”: para representar o Papel","level":2,"name":"Pedra, Papel, Ataque Aéreo","has_images":true,"description":"Pedra, Papel, Ataque Aéreo é um jogo infantil muito popular, em que duas ou mais crianças formam um círculo e fazem gestos com a mão na tentativa de obter a vitória. As regras são surpreendentemente complexas para um jogo de crianças, mas mesmo assim é bastante popular por todo o mundo. \n\n\t\t\t\t\tAs partidas são muito simples. Os jogadores podem escolher entre o sinal de uma Pedra (o punho), o sinal de um Papel (a palma aberta), e o sinal para o Ataque Aéreo (igual o do Papel, mas com apenas o polegar e o mindinho estendidos). \n\n\t\t\t\t\t\n\n\t\t\t\t\tUma partida, com dois jogadores, possuem as seguintes regras para se definir um vencedor:\n\n\t\t\t\t\t\n\t\t\t\t\t\tAtaque Aéreo vs. Pedra: Neste caso, o jogador com o Ataque Aéreo derrota o jogador com a Pedra, por razões óbvias.\n\t\t\t\t\t\tPedra vs. Papel: Neste caso, o jogador com a Pedra derrota o com Papel, porque a Pedra machuca muito mais.\n\t\t\t\t\t\tPapel vs. Ataque Aéreo: Aqui o Ataque Aéreo ganha, porque Ataque Aéreo sempre ganha e o Papel é patético.\n\t\t\t\t\t\tPapel vs. Papel: Nesta variação, ambos os jogadores ganham, porque o Papel é inútil e ninguém que enfrenta o Papel pode perder.\n\t\t\t\t\t\tPedra vs. Pedra: Para este caso não há ganhador, porque depende do que os jogadores decidem fazer com a Pedra e normalmente não fazem nada.\n\t\t\t\t\t\tAtaque Aéreo vs. Ataque Aéreo: Quando isto acontece, todos os jogadores perdem, devido a Aniquilação Mútua.\n\t\t\t\t\t\n\n\t\t\t\t\tSua tarefa é escrever um programa que, dada as escolhas de dois jogadores, informe quem venceu o jogo.","id":"2031","category":"Iniciante","statistics":{"level":"2 / 10","submissions":6754,"solved":3937,"ratio":"58.29%"}}