{"output":"Para cada caso de teste imprima a mensagem \"Quantidade minima de passos = X\", onde X é o total necessário, seguido por todos os passos feitos para solucionar, cada passo deve ser separado por uma linha em branco, para melhor visualização de João. Caso não seja possível solucionar o problema imprima: \"Problema sem solucao\".","input":"A entrada é composta por vários casos de teste, cada caso terá 3 linhas cada uma com 3 números de 0 a 8, onde o número zero um representa o espaço em branco. Assuma que o brinquedo sempre estará embaralhado.\nA entrada termina com o final do arquivo.","level":9,"name":"Jogo dos Oito","has_images":true,"description":"João é um menino que adora brincar com jogos de lógica, ele passa diversas horas de seu dia solucionando puzzles.\nAtualmente o jogo que ele está gastando mais horas brincando é o Sliding puzzle, também conhecido como Jogo dos Oito, no qual ele tem em mãos um tabuleiro de 3 linhas e 3 colunas, onde cada elemento desse tabuleiro possui um número ou um espaço em branco.\n\nO objetivo desse jogo é simples, dado um tabuleiro embaralhado (Figura 1), João deve deixá-lo ordenado (Figura 2) e o único movimento possível para solucionar o problema é mover algum número para o espaço em branco.\nResolver o brinquedo não é um problema para João, ele já está fazendo isso sem dificuldades, porém ele ficou intrigado em saber qual é quantidade mínima de movimentos necessários para resolver.\n\n \nFigura 1 - Figura 2\n\nO que você precisa fazer para ajudar João na sua curiosidade é simples, ele te dará a configuração inicial do tabuleiro e você deverá mostrar, caso exista, a menor quantidade de passos possíveis para solucionar o brinquedo e quais passos são necessários para encontrar a solução.\nPorém há um detalhe, João é um garoto bem metódico, portanto quando ele está jogando e existem diversas possibilidades em um dado momento ele usa a seguinte prioridade para definir a jogada:\n1) Mover a peça que está em cima do espaço em branco\n2) Mover a peça que está embaixo do espaço em branco\n3) Mover a peça que está na direita do espaço em branco\n4) Mover a peça que está na esquerda do espaço em branco\nVocê deverá usar a mesma prioridade que ele.","id":"2032","category":"Grafos","statistics":{"level":"9 / 10","submissions":1051,"solved":253,"ratio":"24.07%"}}