{"output":"Para cada caso, a saída é composta por três linhas. A primeira contendo a mensagem “DIFERENCA DE VALOR = “, seguido do valor da diferença entre o valor final com juros simples e o valor final com juros composto. Na segunda linha será exibida a mensagem “JUROS SIMPLES = “, seguido do valor da diferença entre o valor a ser emprestado e o valor final com juros simples. E na terceira linha será mostrada a mensagem “JUROS COMPOSTO = “, seguido do valor da diferença entre o valor a ser emprestado e o valor final com juros composto.\n\n- Não esqueça de colocar os espaços existentes nas mensagens  e de por uma quebra de linha no final de cada saída.","input":"A entrada consiste de vários casos de teste e termina com EOF. Cada caso contém dois valores de ponto flutuante de dupla precisão, um C (0.01 ≤ C ≤ 20000.00) e outro i (0.01 ≤ i ≤ 1.00), representando, respectivamente, o valor do empréstimo e a taxa de juros, e um inteiro n (1 ≤ n ≤ 20) representando a quantidade de “meses” referente ao prazo para efetuar o pagamento desse empréstimo ao agiota, já com os juros aplicados.","level":7,"name":"Juros Sobre o Empréstimo","has_images":false,"description":"Sempre que pode, Danilo compra acessórios para o seu computador, pois trabalha como programador e procura sempre melhorar o desempenho de seu PC. Certa vez Danilo resolveu fazer um upgrade geral em seu computador, mas como estava sem dinheiro no momento, resolveu solicitar um empréstimo em dinheiro com seu amigo Maclaud que é agiota. Maclaud então resolveu emprestar o dinheiro ao seu amigo Danilo e o aconselhou a verificar qual seria sua dívida se fosse aplicado o regime de “Juros Simples” ou “Juros Composto”, pois assim saberia que o agiota não aumentaria o valor.\n\nDanilo ficou confuso e resolveu ir pra sua casa e calcular qual seriam os valores finais de acordo com cada regime de juros.  Mas Danilo não é muito bom de cálculo e resolveu pedir a ajuda de um programador que fosse capaz de criar um programa que informado o valor do empréstimo, a taxa de juros “mensal” e o prazo em “meses” que necessita para quitar o empréstimo com os juros, calcule e mostre:\n\n- A diferença entre o valor final com juros simples e o valor final com juros composto;\n\n- A diferença entre o valor a ser emprestado e o valor final com juros simples;\n\n- A diferença entre o valor a ser emprestado e o valor final com juros composto;","id":"2033","category":"Matemática","statistics":{"level":"7 / 10","submissions":939,"solved":234,"ratio":"24.92%"}}