{"output":"Para cada teste, você deve imprimir uma linha contendo um único número inteiro, que representa o número mínimo de peças que têm de ser deslocadas, de modo a manter a distância entre peças consecutivas sempre inferior ou igual a H. Note que a primeira e a última peça não podem ser movidas, e que a ordem relativa entre as peças não pode ser alterada. Se for impossível alcançar o resultado desejado, imprimir o número -1.","input":"Cada caso de teste é descrito usando duas linhas. A primeira linha contém dois números inteiros N e H, indicando, respectivamente, o número de peças na linha (3 ≤ N ≤ 1000) e sua altura (1 ≤ H ≤ 50). A segunda linha contém N-1 inteiros Di, que representam as distâncias entre pares de peças consecutivas de dominó, na ordem dada pela linha (1 ≤ Di ≤ 100 para i = 1, 2, ..., N-1).\n\n                    O fim da entrada é indicado por uma linha que contém duas vezes o número -1.","level":10,"name":"Efeito Dominó","has_images":false,"description":"O efeito dominó é um fenômeno que ocorre quando, em uma linha de peças de dominó, cada uma sobre o seu menor lado, a primeira peça a partir de uma das extremidades cai em direção à próxima peça. Por sua vez, esta segunda peça cai sobre a terceira na linha, e assim por diante até que a outra extremidade da linha seja atingida, e então todas as peças terão caído. Note que para que isso aconteça, a distância entre as peças consecutivas na linha deve ser menor ou igual à altura das peças.\n\n                    Emma encontrou recentemente sobre o efeito dominó e foi imediatamente surpreendida por ele. Ela passou toda a manhã formando uma linha com N peças de dominó que seu irmão Ezequiel deu a ela, mas pouco antes de fazer a primeira peça cair, sua avó foi a casa dela e levou-a para brincar no parque. Ezequiel sabe que Emma não levou em conta a distancia entre as peças consecutivas quando ela formou sua linha de dominó, e não quer vê-la frustrada se todas as peças não caírem depois que ela derrubar a primeira.\n\n                    Assim, Ezequiel quer mover algumas peças de dentro da linha para que a distância entre peças consecutivas é sempre menor ou igual à sua altura H. Para que Emma não descubra que ele moveu algumas peças, ele irá deixar a primeira e a ultima peça onde elas estão, e ele deseja também mover o mínimo possível de peças de dentro da fila. Qual é o numero mínimo de peças que ele deve mover?","id":"2036","category":"Paradigmas","statistics":{"level":"10 / 10","submissions":449,"solved":83,"ratio":"18.49%"}}