{"output":"Para cada caso de teste na entrada, seu programa deve produzir uma linha de saída, contendo caso o Sport seja o campeão: \"O Sport foi o campeao com X pontos :D\", sendo X a quantidade total de pontos. Caso contrário, o seu programa deve produzir a seguinte linha: \"O Sport nao foi o campeao. O time campeao foi o S com X pontos :(\", sendo S o nome do time vencedor e X a quantidade total de pontos. Deixe uma linha em branco depois de cada caso de teste.","input":"A entrada contém vários casos de teste. A primeira linha contém um inteiro N (2 ≤ N ≤ 100) representando a quantidade de times a seguir que estão participando do campeonato. Seguem Ni linhas contendo o nome do time S e a pontuação do time P até então (0 ≤ P ≤ 100). Logo após, seguem N/2 linhas contendo o placar de cada jogo da última rodada, no formato \"TimeA golsA-golsB TimeB\", conforme ilustrado no exemplo abaixo. A entrada termina com N = 0, na qual não deve ser processada.","level":7,"name":"O Campeão","has_images":true,"description":"Thyago é um torcedor fanático do Sport Clube de Recife e sempre acompanha as finais dos campeonatos em que seu time está jogando. Como os jogos são geralmente à noite e Thyago está ocupado nesse horário trabalhando ou ministrando aula, ele não está com tempo de ver os jogos do seu time de coração e nem acompanhar a pontuação total do campeonato ao longo do dia, no qual está na rodada final. Deoclécio, que é amigo de Thyago e também gosta muito de futebol, está assistindo o campeonato e anotou a pontuação de todos os times até então e também o placar dos jogos da rodada final.\n\nSua tarefa é ajudar Deoclécio fazendo um programa que, dado o nome dos times participantes do campeonato, a sua pontuação até então e o placar dos últimos jogos, determine qual foi o time campeão e a pontuação final desse time.\n\nRegras desse campeonato:\n\n\n\tCada gol marcado valerá 3 pontos;\n\tCaso os times empatem, será adicionado +1 ponto para cada time da partida;\n\tO time vencedor de uma partida ganhará +5 pontos.\n\n\nObservações:\n\n\n\tÉ garantido que sempre haverá um time vencedor do campeonato;\n\tO time Sport sempre aparece nas entradas do problema;\n\tNão haverá empates de pontuação final entre dois ou mais times após os placares dados;\n\tO nome do time da entrada sempre terá apenas uma palavra;\n\tOs nomes dos times não se repetem e não contém caracteres especiais;\n\tNenhum dos times joga mais de uma vez (mais de uma partida no mesmo caso de teste).","id":"2040","category":"Ad-Hoc","statistics":{"level":"7 / 10","submissions":509,"solved":167,"ratio":"32.81%"}}