{"output":"A saída de cada caso de teste é apenas uma linha contendo o enésimo número da sequência.","input":"A entrada é composta de vários casos de teste. Cada caso de teste é composto de uma linha contendo um número inteiro N, que representa o enésimo número da sequência que deve ser calculado, com 0<N< = 40.","level":5,"name":"Sequência de Gödelito","has_images":false,"description":"Gödelito é fascinado por questões lógicas e matemáticas e passa muito tempo brincando em tentar descobrir a semântica por traz das sequencias matemáticas. O mais divertido para Gödelito não é tanto encontrar o próximo número da sequência, mas entender os axiomas que determinam o formato das sequencias.\n\t\t\t\t\tMuitas sequencias são ditadas por regras matemáticas, por exemplo a sequência de Fibonacci cujo axioma é que cada número é a soma dos dois anteriores. Outras sequencias envolvem axiomas mais semânticos, por exemplo a sequência: 2, 10, 12, 16, 17, 18, 19, 200..., no qual axioma é: números cujo nome começa com a letra D.\n\t\t\t\t\tGödelito se deparou atualmente com uma sequência bem interessante. Depois de algum tempo ele descobriu que o axioma da sequência é semântico (ele tentou muitas contas matemáticas primeiro, o que só o deixou mais feliz quando descobriu o significado da sequência). A sequência é a mostrada abaixo:\n\n\t\t\t\t\t3\n\t\t\t\t\t13\n\t\t\t\t\t1113\n\t\t\t\t\t3113\n\t\t\t\t\t132113\n\t\t\t\t\t1113122113\n\t\t\t\t\t311311222113\n\t\t\t\t\t...\n\n\t\t\t\t\tGödelito ficou impressionado com o quanto essa sequência cresce rapidamente. E como não quer gastar as folhas do seu caderno para calcular todos os números que quer, pediu a sua ajuda para criar um algoritmo para encontrar os outros números da sequência. Mas ele te explicou o significado da sequência primeiro para facilitar a sua vida:\n\t\t\t\t\tCada número da sequência é gerado através da leitura do número anterior, por exemplo, o segundo número é 13 porque a linha de cima contém um (1) número três (3). O terceiro número é 1113, porque a linha de cima contém um (1) número um (1) e um (1) número três (3). O quarto número da sequência é 3113, pois a linha de cima contém três (3) números um (1) e um (1) número três (3). Acho que deu para entender a ideia, não é?","id":"2041","category":"Ad-Hoc","statistics":{"level":"5 / 10","submissions":597,"solved":317,"ratio":"53.10%"}}