{"output":"Para cada caso de teste, você deve imprimir uma única linha contendo um número racional, o que representa a área do perfil de montanha correspondente. Aproxime o resultado para o numero mais próximo de dois dígitos decimais. Em caso de empate, aproxime para cima. Note-se que você deve sempre usar exatamente dois dígitos depois do ponto decimal, mesmo que isso signifique que termine com um zero.","input":"Cada caso de teste é descrito usando várias linhas. A primeira linha contém um único número inteiro N, indicando o número de montanhas (1 ≤ N ≤ 1000). Cada uma das N linhas seguintes descreve uma montanha usando três números inteiros I, D e H, que representam, respectivamente, a coordenada X do ponto de extremidade esquerda da base, o mesmo para a extremidade direita da base, e a altura da montanha (1 ≤ I, D, H ≤ 105 com I <D). Em cada caso de teste não existem duas montanhas que são exatamente a mesma (ou seja, com valores iguais para os três parâmetros I, D e H). O final da entrada é indicado por uma linha contendo -1.","level":10,"name":"Montanha Alta","has_images":true,"description":"Para sair de férias, Horácio e Hernán sacrificaram sua participação em uma importante competição de programação. Enquanto você estiver nessa competição, eles estão perto do Andes dirigindo ao longo da estrada 40, na Argentina, desfrutando de uma vista agradável das montanhas no horizonte. Neste momento, o céu sobre a rodovia é limpo, azul, enquanto a parte visível das montanhas é um perfil apresentando texturas ricas e atraentes. Isso preocupa Horácio e Hernán, porque temem que as imagens que estão a fotografas vão ser muito caras para imprimir corretamente. Por esta razão, na próxima parada irão pegar os seus computadores portáteis e escrever um programa para calcular a área do perfil de montanha que tem de ser impresso em cada imagem. Você pode terminar este programa antes deles?\r\n\r\n                    Horácio e Hernán irão modelar o perfil da montanha da seguinte maneira. Cada montanha é representada por um triângulo isósceles cuja base esta sobre o eixo X do plano XY. Dois lados de igual comprimento conectam as extremidades da base ao vértice oposto do triângulo, que é a ponta da montanha correspondente. Para descrever a posição e a forma do triângulo, usámos as coordenadas ao longo do eixo X dos pontos de extremidade da base, juntamente com a altura da montanha.\r\n\r\n                    A figura abaixo é o modelo de um perfil formado por 4 montanha montanhas que são sobrepostas uma com a outra. A área da superfície do perfil da montanha que tem que se calcular é marcado com listras. A montanha menor da figura é descrita pelos valores I = 4 (o ponto de extremidade esquerda da base de montanha), D = 5 (a extremidade direita da base de montanha) e H = 1 (a altura da montanha)\r\n\r\n                    \r\n\r\n                    Neste problema, você terá a representação do perfil de montanha, e você tem que encontrar a área da união de todos os triângulos correspondentes, de tal forma que as partes sobrepostas são contadas apenas uma vez.","id":"2043","category":"Geometria Computacional","statistics":{"level":"10 / 10","submissions":108,"solved":27,"ratio":"25.00%"}}