{"output":"Para cada instância solucionada, você deverá imprimir um identificador Instancia h em que h é um número inteiro, sequencial e crescente a partir de 1. Nas M linhas seguintes, você deve imprimir soldado k (para k = 1, . . . ,M) seguido de defender ou espanhol respectivamente se o soldado estiver dentro ou fora do forte. Uma linha em branco deve separar a saída de cada instância.","input":"São dadas várias instâncias. Cada instância começa com um inteiro que é o número 0 ≤ N ≤ 1000 de vértices que a cerca do forte tem. O valor 0 indica o fim dos dados. Nas N linhas seguintes vêm as coordenadas dos postes da cerca do forte. Os postes são dados a partir do primeiro, seguindo a cerca em sentido horário. A seguir vem a posição da bandeira do Texas. Na próxima linha, vem o número 0 ≤ M ≤ 1000 de pessoas a serem verificadas. Nas M linhas seguintes vêm as coordenadas das posições de cada uma das pessoas. Todas as coordenadas fornecidas são números inteiros no intervalo [−100000; +100000].","level":10,"name":"Defendendo Alamo","has_images":false,"description":"O forte do Alamo, originalmente chamado de Misión San Antonio de Valero, foi fundado pelos missionários para abrigar os padres e os índios convertidos na região que era disputada pelos colonos americanos e espanhóis. Foi fundado no século XVIII e serviu de palco para a mais sangrenta batalha pela emancipação do Texas. A batalha do Alamo ocorreu em 23 de fevereiro de 1836 quando o exército do Gal. Antonio Lopes de Sant’Anna cercou o forte. Texanos e “tejanos” (chamados “defenders”) defenderam a posição por 13 dias.\n\n                    O forte do Alamo era uma fortificação de formato bastante intricado, cercado por uma alta cerca. Muitas vezes era difícil dizer se um soldado estava dentro ou fora dos limites do forte.\n\n                    Sua tarefa neste problema é dada uma instância de um forte, dado pelas coordenadas dos vértices da cerca, as coordenadas da bandeira do Texas e a posição de vários soldados, determinar quais deles são “defenders” e quais são espanhóis.","id":"2045","category":"Geometria Computacional","statistics":{"level":"10 / 10","submissions":334,"solved":39,"ratio":"11.68%"}}