{"output":"Para cada instância solucionada, você deverá imprimir um identificador Instancia  h, em que  h  é um número inteiro, sequencial e crescente a partir de 1. Na próxima linha, você deve imprimir (com cinco casas decimais) a probabilidade mínima de interferência calculada para tal instância. Uma linha em branco deve separar a saída de cada instância.","input":"Seu programa deve estar preparado para lidar com diversas instâncias. Cada instância possui o formato que segue. Na primeira linha, são especificados dois inteiros 0  ≤  n  ≤ 100 e 0  ≤  m  ≤  n(n-1)/2 que representam, respectivamente, o número de pontos na rede alternativa e o número de pares desses pontos para os quais as probabilidades de haver interferência foram medidas. Nas  m  linhas seguintes, são dados (em cada linha) dois inteiros 1  ≤  u,v  ≤  n  e um racional 0  ≤  puv  ≤ 1 representando que entre os dois pontos  u  e  v, a probabilidade de interferência é  puv. Um valor  n  = 0 indica o término das instâncias e não deve ser processado. Você pode supor que sempre será possível satisfazer a restrição (i).","level":7,"name":"Houston, Nós Temos Um Problema!","has_images":false,"description":"No dia primeiro de julho de 1947, um estranho objeto foi detectado por radares da força aérea americana instalados em Roswell, White Sands e Alamogordo. A tremenda velocidade e os movimentos erráticos do objeto indicaram que ele não era um avião ou meteorito. Quatro dias depois um pastor de ovelhas e um grupo de arqueólogos encontram restos de um objeto acidentado ao norte de Roswell. A partir daí, autoridades americadas entram em cena e transportam os restos de tal objeto para Fort Worth no Texas. Elas disseram que os destroços encontrados eram simplesmente restos de um balão meteorológico experimental. Muitas pessoas, no entanto, acharam que se tratavam dos restos de um objeto voador não identificado (UFO). Muitos anos se passaram desde então, e o caso continua atraindo atenção e gerando polêmica.\n\n                    Um grupo de ufólogos radicado em San Antonio, uma cidade texana situada a sul-sudoeste de Fort Worth, está convencido de que seres extraterrestres têm visitado a região com frequência desde então. Após muita pesquisa, os ufólogos descobriram que poderiam construir uma rede de comunicação alternativa para tentar contactar os ETs. Tal rede utilizaria resquícios do antigo sistema de telégrafos existentes no deserto do Texas e o fato de sua alternatividade advém da tentativa de evitar, segundo eles, a intromissão das autoridades supra citadas.\n\n                    Após um minucioso levantamento (que identificou postes, fiações, condensadores, transformadores, etc.), os ufólogos perceberam que informações transmitidas em certos trechos da antiga estrutura dos telégrafos apresentavam qualidade pior do que em outros. Baseados em amostras estatísticas, levantaram, para alguns pares de pontos u e  v da antiga rede, uma probabilidade  puv de haver interferência nas informações transmitidas entre u e v. Sabendo que você estaria na região em abril do ano que vem, eles pediram a você que construísse um programa para identificar o menor conjunto de trechos a serem utilizados, de forma que (i) todos os pontos por eles desejados estejam interligados (mesmo que indiretamente), e tal que (ii) a probabilidade total de interferência nas mensagens enviadas nesta rede alternativa seja mínima. Ávido de interesse em descobrir a verdade (que \"está lá fora...\"), você prontamente atendeu à solicitação.","id":"2048","category":"Grafos","statistics":{"level":"7 / 10","submissions":110,"solved":50,"ratio":"45.45%"}}