{"output":"Para cada instância, imprimir a mensagem \"Instance #H:\", onde H é o número da instância, sequêncial e crescente a partir de 01. Em seguida, para cada N linha da instância, o professor pediu para imprimir, o número de pares conectados, o número de pontos não conectados, seguido da mensagem \"->\". Após, listar todos os pares conectados em ordem ascendente, com um espaço entre dois pares conectados. Se não conseguir conectar nenhum ponto, imprimir a mensagem \"No connection found\". Imprimir uma linha em branco entre duas instâncias consecutivas.","input":"A primeira linha de cada instância contém um inteiro N ( 1 ≤ N ≤ 105 ), que corresponde ao número de exercícios presentes na lista do professor Jack. As N  linhas seguintes contém um número indefinido de inteiros E ( 1 ≤ E ≤ 16 ). Cada número inteiro E  indica que no Mapa de Karnaugh na posição E, é verdadeira, isto é contém 1, como mencionado acima. A entrada termina com final de arquivo (EOF).","level":5,"name":"Mapas de Karnaugh II","has_images":true,"description":"O professor Jack entregou uma lista de exercícios de revisão, afirmando que na próxima aula vai fazer uma avaliação. O conteúdo principal desta lista é Mapas de Karnaugh. John recebeu a lista, mas percebeu que faltou as aulas de Mapas de Karnaugh. John é esperto e conhece um amigo que sempre vai as aulas, e sabe como resolver Mapas de Karnaugh. Neste problema você é o amigo de John, será que você consegue ajudar John? Conectando a menor quantidade de pares possíveis? Seguindo as especificações do professor:\r\n                    \r\n                        1º Formar pares: Um par é conectado, quando encontrar o menor ponto adjacente presente.\r\n                        2º Formar termos isolados: Pares conectados não precisam ser conectados uma segunda vez.\r\n\t\t\t\t    \r\n\r\n\r\n\r\n\t\t\t\t\t \r\n\r\n                    \r\n                        No Mapa de Karnaugh acima é possível identificar os pontos conectados seguindo as especificações do professor. Pares conectados: O par [ 2-6 ] indica que o ponto 2 encontrou o menor ponto adjacente presente 6. Pares isolados: Note que o par [ 6-8 ] não é um par isolado. O ponto 6 está conectado com o ponto 2, e o ponto 8 está conectado com o ponto 7. Portanto não é um par válido. Um par é válido se, e somente se, um de seus pontos não estiver conectado a nenhum outro ponto. Cada par consiste de [ origem-destino ], os pares sempre começam a ser conectados do menor ponto presente na N linha da entrada, origem, com o menor ponto adjacente presente de destino, um determinado ponto de origem tem quatro pontos de destino, por exemplo o ponto de origem 16 tem os pontos [ 8, 12, 14, 15 ] de destino.\r\n                      \r\n\t\t\t\t\t\r\n                        Uma instância contém um número inteiro N. As próximas N linhas consistem em pontos verdadeiros no Mapa de Karnaugh. Estamos falando de Mapas de Karnaugh de quatro variáveis. Portanto no máximo 16 números. Como o professor mostrou um exemplo, tudo fica mais fácil. Na imagem acima é possível observar que são quatro pares conectados: [ 2-6 ] [ 7-8 ] [ 12-16 ] [ 13-14 ]. E todos os pontos estão conectados. Ajude John a resolver os exercícios da revisão.","id":"2052","category":"Paradigmas","statistics":{"level":"5 / 10","submissions":14,"solved":2,"ratio":"14.29%"}}