{"output":"Para cada labirinto, inicialmente imprima o número da instância, conforme mostra o exemplo de saída abaixo. Se for impossível levar a caixa até sua posição final, imprima \"Impossivel\" (sem aspas).\n\n                    Caso contrário, você deve imprimir dois inteiros x e y; x indica o número de movimentos (passos + empurrões) e y o número de empurrões de uma sequência que faz com que você leve a caixa até a posição final. O número de empurrões deve ser minimizado. Caso exista mais de uma sequência possível que utiliza um número mínimo de empurrões, o número total de movimentos deve ser minimizado. Imprima uma linha em branco após cada instância.","input":"O arquivo de entrada é composto por várias instâncias. Cada instância começa com uma linha contendo dois inteiros r e c (20 ≥ r,c) representando o número de linhas e colunas do labirinto.\n                    \n                    Em seguida, são fornecidas r linhas, cada uma contendo c caracteres. Cada caractere descreve uma célula do labirinto. Uma célula ocupada por uma pedra é indicada por # e uma célula vazia é representada por um \".\" (sem aspas). Sua posição inicial é indicada por S, a posição inicial da caixa é indicada por B e a posição final da caixa é indicada por T.\n\n                    A entrada termina quando r = c = 0.","level":9,"name":"O Cubo","has_images":false,"description":"Num futuro não muito distante as pessoas buscarão jogos cada vez mais perigosos para se divertir. Depois de ultra-leve e bungee-jump as pessoas precisarão de jogos em que suas habilidades mentais sejam também colocadas a prova. É o caso deste jogo, chamado \"O Cubo\", inventado na Nova Zelândia. Em alguns lugares o jogo também é conhecido pelo seu nome em japonês: \"Sokoban\".\n\n                    Considere um labirinto bi-dimensional composto por células quadradas. Cada uma delas ou está livre ou está sendo ocupada por uma pedra. A cada passo, você pode sair da célula em que está e se mover para outra célula vizinha livre (acima, abaixo, à direita ou à esquerda).\n\n                    Uma única célula do labirinto contém uma pilha de caixas. A pilha pode ser movida de uma célula i para uma célula k (por exemplo, k = i + 1), vizinha de i, apenas se você estiver numa célula j (no caso, j = i - 1), vizinha de i, e a direção ik é igual à direção ji (ou seja, você está empurrando a caixa para a próxima célula). A caixa não pode ser movida de qualquer outra maneira (você não pode puxá-la, por exemplo). Logo, se ela for parar em algum canto do labirinto, você não será capaz de movê-la novamente. Por fim, note que em cada empurrão você dá um passo, e que o contrário não é necessariamente verdade.\n\n                    Uma das células vazias é marcada como a célula final. Sua tarefa é trazer a caixa para essa célula final através de uma sequência de passos e de empurrões. Como a caixa é pesada, você quer realizar o menor número possível de empurrões.\n\n                    Observe que no jogo da vida real há a possibilidade de você se prender ou mesmo ser esmagado pela caixa, tornando tudo muito mais divertido.","id":"2056","category":"Grafos","statistics":{"level":"9 / 10","submissions":95,"solved":26,"ratio":"27.37%"}}