{"output":"Imprima o menor tempo em que todos os Digletts vão aparecer juntos na superfície.","input":"A primeira linha da entrada contém um inteiro N (2 ≤ N ≤ 100) que representa a quantidade de buracos. A linha seguinte contém N inteiros Bi (1 ≤ Bi ≤ N), onde o i-ésimo inteiro representa o i-ésimo buraco, e indica que existe um túnel unidirecional do i-ésimo buraco para o buraco Bi.","level":6,"name":"Caçando Digletts","has_images":true,"description":"Diglett é um Pokémom do tipo terra que fica no subsolo cavando túneis e quase nunca é visto. Ele aparece na superfície através de um buraco no solo de tempo em tempo, onde é possível visualizar apenas a sua cabeça.\n\t\t\t\t\t \n\t\t\t\t\tOs túneis construídos por eles são unidirecionais e sempre conectam um buraco de origem a um buraco de destino, por exemplo: se existe um túnel conectando o buraco A ao buraco B, então é possível ir de A para B e não o contrário. Cada Diglett possuí o seu próprio buraco, o que indica que se existir N buracos vão existir N Digletts. Cada buraco possuí exatamente dois túneis: o primeiro túnel, que sai a partir dele para outro buraco e o segundo túnel, que chega até ele a partir de outro buraco.  \n\t\t\t\t\tOs Digletts ficam andando de buraco em buraco a cada instante de tempo, por exemplo: considere um buraco A que tenha um túnel que o conecta a um buraco B, se um Diglett está no buraco A no tempo T, então no próximo instante de tempo T+1 ele vai estar no buraco B. Quando um Diglett chega no seu buraco, ele aparece imediatamente na superfície. Quando não está no seu buraco, ele simplesmente permanece no subsolo e espera o próximo instante de tempo para andar no túnel e ir a outro buraco. É garantido que cada Diglett sempre voltará ao seu buraco em alguns instantes de tempo.\n\t\t\t\t\tXisto é um Mestre Pokémom e está em busca de capturar a maior quantidade de Digletts com apenas uma pokebola, esta por sua vez é capaz de capturar todos os Digletts visíveis em uma determinada área. Ele precisa da sua ajuda para saber qual é o menor tempo em que todos os Digletts vão aparecer na superfície ao mesmo tempo, para assim poder lançar a pokebola e pegar todos eles.\n\t\t\t\t\tObs: No instante zero todos os Digletts estão no seu respectivo buraco e não aparecem na superfície.","id":"2063","category":"Matemática","statistics":{"level":"6 / 10","submissions":879,"solved":349,"ratio":"39.70%"}}