{"output":"Sendo M o menor tamanho de uma sequência Bolada para os dados de entrada. Imprima uma única linha contendo M e a quantidade de sequências Boladas de tamanho M.","input":"A primeira linha da entrada é constituída de 4 inteiros K, L1, L2 e L3, representando, respectivamente, o inteiro K e os tamanhos das sequências S1, S2 e S3 (1 ≤ K ≤ 20 e 1 ≤ L1, L2 e L3 ≤ 200). A segunda linha é constituída de L1 inteiros, representando os elementos da sequência S1. A terceira linha é constituída de L2 inteiros, representando os elementos da sequência S2. A quarta linha é constituída de L3 inteiros, representando os elementos da sequência S3. Considere que todos os elementos das sequências S1, S2 e S3 são inteiros positivos menores ou iguais a K.","level":9,"name":"Contando Sequências Boladas","has_images":false,"description":"Dado um inteiro K e 3 sequências S1, S2 e S3, chamamos de sequência Bolada, uma sequência constituída de inteiros positivos menores ou iguais a K e que não é subsequência de S1, S2 ou S3. Lembrando que uma subsequência é uma sequência que pode ser derivada de outra sequência por exclusão de alguns elementos, sem alterar a ordem dos elementos restantes.\n\nPor exemplo, para K = 3, S1 = <1, 2, 3, 1, 2>, S2 = <2, 3, 1, 2> e S3 = <3, 1, 2, 3, 1, 2>, todas as sequências possíveis de tamanho 1 (<1>, <2> e <3>) não são sequências Boladas, pois todas são subsequências de S1, S2 e S3.\n\nAnalisando todas as sequências possíveis de tamanho 2 para K = 3, temos 9 sequências:\n\n\n\t<1, 1> não é subsequência de S2, logo <1, 1> é uma sequência Bolada;\n\t<1, 2> é subsequência das 3 sequências;\n\t<1, 3> não é subsequência de S2, logo <1, 3> é uma sequência Bolada;\n\t<2, 1> é subsequência das 3 sequências;\n\t<2, 2> é subsequência das 3 sequências;\n\t<2, 3> é subsequência das 3 sequências;\n\t<3, 1> é subsequência das 3 sequências;\n\t<3, 2> é subsequência das 3 sequências;\n\t<3, 3> não é subsequência de S1 e S2, logo <3, 3> é uma sequência Bolada;\n\n\nAssim, o tamanho da menor sequência Bolada, para esse exemplo, é igual a 2. Também concluímos que existem 3 sequências Boladas de tamanho 2.","id":"2070","category":"Ad-Hoc","statistics":{"level":"9 / 10","submissions":153,"solved":62,"ratio":"40.52%"}}