{"output":"Para cada instância imprima uma linha contendo um único inteiro, o maior número de balas de canhão que Anúbis pode derrubar.","input":"A entrada é composta por diversas instâncias. A primeira linha da entrada contém um inteiro T indicando o número de instâncias.\n\n                    A primeira linha de cada instância contém um inteiro N, onde 1 ≤ N ≤ 50, indicando o número de balas de canhão. Cada uma das próximas N linhas contém três inteiros cada, xi, yi e zi, onde −1000 ≤ xi, yi, zi ≤ 1000, indicando as coordenadas da i-ésima bala de canhão no momento em que Anúbis pode invocar seus raios.\n\n                    Os franceses tem uma mira muito boa, assim eles as vezes atiram balas que vão grudar uma na outra para aumentar o dano. Logo, não se assuste se houverem pontos repetidos na entrada. Eles representam balas diferentes que estão juntas. Nesses casos cada bala é contada separadamente caso Anúbis decida acertá-las.","level":9,"name":"Canhões de Anúbis","has_images":false,"description":"Anúbis está preocupado, soldados franceses estão praticando tiro ao alvo com balas de canhão na esﬁnge novamente! Dessa vez ele vai tentar impedir que outras partes da esﬁnge tenham o mesmo destino do seu nariz favorito.\n\n                    Para parar os canhões, ele pode invocar raios, que destroem tudo em que tocam, inclusive as balas de canhões. Mas os deuses egípcios já não tem tantos seguidores, o que limita os seus poderes.\n\n                    Anúbis só pode invocar os raios em determinados instantes de tempo. Por sorte um desses condiz com um momento em que as balas estão no ar. Anúbis quer aproveitar essa chance para derrubar o maior número possível de balas.\n\n                    Acontece que para fazer a invocação, Anúbis precisa temporariamente passar para o nosso plano de existência. Assim ele só pode acertar alvos que estejam todos num mesmo plano.\n\n                    Ajude Anúbis a derrubar o maior número possível de balas de canhão.","id":"2072","category":"Paradigmas","statistics":{"level":"9 / 10","submissions":197,"solved":74,"ratio":"37.56%"}}