{"output":"Imprimir uma única linha contendo um número inteiro que representa o número de quantidades visíveis de palmeiras que existem ao longo da estrada.","input":"A primeira linha contém um número inteiro N que indica o número de palmeiras que existem no lado da estrada (1 ≤ N ≤ 1000). Cada uma das N linhas seguintes descreve uma palmeira diferente usando dois números inteiros X e Y, que representam as coordenadas da referida palmeira no plano XY (1 ≤ X, Y ≤ 105). Não há duas palmeiras que compartilham a mesma posição.","level":10,"name":"Beira da Estrada","has_images":true,"description":"No lado da estrada, há palmeiras, há um bar, há sombra, há algo mais. Neste problema, estamos particularmente interessados ​​nas palmeiras.\n\n                    Ana, Adam, Alan e Amanda organizou uma viagem: enquanto Ana e Adam vão lidar com coisas insignificantes como verificar o carro, preparar a bagagem e encontrar um lugar para ficar, Alan e Amanda se dedicaram para a parte mais importante: estudar as vistas das palmeiras que eles teriam acesso na estrada.\n\n                    A estrada onde eles estão dirigindo agora é completamente em linha reta, e neste problema vai ser representada pela reta Y = 0 do plano XY. No lado da estrada com coordenadas Y> 0 há palmeiras, que serão representadas por diferentes pontos do plano XY com Y positivo. Alan e Amanda notaram que a partir de cada ponto na estrada certas palmeiras são visíveis, e, em geral, estes variam ao longo da estrada. Uma palmeira é dito ser visível a partir de um ponto na estrada, se e somente se o segmento que une esses dois pontos não passa por qualquer outra palmeira.\n\n                    Na figura a seguir no primeiro exemplo os círculos vazios representam palmeiras , enquanto os cheios representam alguns pontos possíveis na estrada.\n\n                    \n\n                    Do ponto P as palmeiras que são visíveis são A, B e D, pois a palmeira C está escondida atrás da palmeira A. Do ponto Q as palmeiras visíveis são A, C e D, pois a palmeira B agora está escondida atrás da palmeira A. Do ponto R todas as palmeiras são visíveis, e do ponto S apenas as palmeiras A e D são visíveis, pois as palmeiras B e C estão escondidas atrás da palmeira D.\n\n                    Enquanto Ana e Adam se revezam para dirigir o carro, Alan e Amanda discutem os benefícios de saber quantas palmeiras visíveis existem. Dado um conjunto de palmeiras, um número inteiro M é o número visível de palmeiras se, e somente se, existir pelo menos um ponto na estrada (isto é, um ponto de coordenada Y = 0) a partir do qual exatamente M palmeiras são visíveis.\n\n                    No exemplo ilustrado acima, 2, 3 e 4 são quantidades visíveis de palmeiras que podem ser vistas dos pontos S, P e R na estrada, respectivamente. Por outro lado, 0 e 1 não são quantidades visíveis, porque a partir de qualquer ponto da estrada, pelo menos, 2 palmeiras são visíveis. Finalmente, nenhuma quantidade M > 4 é visível, uma vez que existem apenas 4 palmeiras no total. Portanto, neste exemplo, existem 3 quantidades visíveis de palmeiras. (Note que se M é uma quantidade visível de palmeiras, pode haver mais do que um ponto sobre a estrada que apresenta esta situação; no exemplo anterior, este é o caso dos pontos P e Q para a quantidade visível 3, bem como um número infinito de outros pontos juntamente com R para a quantidade visível 4.)\n\n                    Ana e Adam estão ficando cansados. Eles querem que Alan e Amanda deixem de lado as palmeiras e pelo menos preparem alguns sanduíches. Por essa razão, você precisa fazer um programa para calcular quantas diferentes quantidades visíveis de palmeiras existem ao longo da estrada.","id":"2083","category":"Geometria Computacional","statistics":{"level":"10 / 10","submissions":297,"solved":44,"ratio":"14.81%"}}