{"output":"Para cada consulta seu programa deverá imprimir uma linha com a maior distância, conforme explicado acima.\r\n ","input":"A entrada possui diversos casos de teste. Cada caso de teste começa com dois inteiros N (1 ≤ N ≤ 100) e M (1 ≤ M ≤ 4950), indicando respectivamente o número de interseções no mapa da cidade e quantas ciclofaixas serão criadas. Nas próximas M linhas serão fornecidos três inteiros U , V (1 ≤ U, V ≤ N ) e W (0 ≤ W ≤ 2000), que indicam que existe uma ciclofaixa entre a interseção U e V com uma distância W . Na próxima linha terá um inteiro Q (1 ≤ Q ≤ 50), que representa a quantidade de consultas que o candidato deseja fazer. Segue Q linhas com dois inteiros A, B (1 ≤ A, B ≤ N), indicando o par de interseções para o qual deve ser feita a consulta. A entrada termina quando N = M = 0 e não deve ser processada.","level":5,"name":"Ciclofaixa","has_images":false,"description":"Como todos já sabem, as eleições para prefeito estão chegando. Neste ano nossa cidade possui excelentes candidatos, todos com propostas incríveis de governo.\r\n\r\nUm dos candidatos pretende implementar um sistema de transporte revolucionário, onde as ruas serão removidas e trocadas por ciclofaixas. Esta ideia parece ser a solução de todos os problemas que nossa cidade vem enfrentando. Porém, há um falha: a desidratação quando andamos por muito tempo de bicicleta.\r\n\r\nPara solucionar esse problema, o candidato pretende fornecer água gelada para toda a população. Sua ideia é colocar pontos de distribuição em todas interseções das ciclofaixas. Porém como água é um recurso que está se esgotando, a quantidade que ele fornecerá será fixa, independente da distância percorrida pelo indivíduo.\r\n\r\nNa intenção de validar sua ideia, o candidato contratou você para o ajudar. Sua tarefa é simples: será fornecido o mapa da cidade com todas as interseções e as distâncias entre elas. Em seguida, você deverá responder várias consultas do candidato, onde ele irá informar duas interseções, A e B, e seu programa deverá mostrar qual a maior distância que será percorrida por uma pessoa sem água entre A e B. Com essas informações o candidato conseguirá ver se a quantidade que ele pretende fornecer será suficiente. Não esqueça que o candidato pretende diminuir essa distância, então o seu programa deve informar a maior distância no melhor trajeto.\r\n\r\nComo as ruas de nossa cidade são bem largas, todas as ciclofaixas serão de mão dupla.","id":"2086","category":"Grafos","statistics":{"level":"5 / 10","submissions":205,"solved":109,"ratio":"53.17%"}}