{"output":"Para cada entrada seu programa deverá imprimir uma linha, contendo sim, caso seja possível realizar o pagamento da forma que seu amigo deseja ou nao, caso contrário.","input":"A entrada possui diversos casos de teste. Cada caso inicia com dois inteiros V (1 ≤ V ≤ 10^5) e N (1 ≤ N ≤ 10^3), representando respectivamente, o valor do lanche que seu amigo deseja comprar e a quantidade de moedas que seu amigo possui. Na próxima linha terá N inteiros, onde Xi (1 ≤ Xi ≤ 10^5) representa o valor da i-ésima moeda. A entrada termina com V = N = 0 e não deve ser processada.","level":8,"name":"Lanchonete","has_images":false,"description":"Todos os dias nos intervalos da faculdade você e seu amigo vão para a lanchonete da faculdade o mais rápido possível para poder comprar um lanche. Apesar de vocês serem bem rápidos no trajeto entre o prédio do curso e a lanchonete, sempre vocês acabam enfrentando uma fila enorme.\r\n\r\nSeu amigo é muito metódico, então todos os dias ao chegar na fila ele retira do bolso todas as suas moedas e verifica se ele consegue pagar o lanche inteiramente com o dinheiro que ele tem, sem necessitar que a funcionária da cantina dê algum troco, afinal o troco dado sempre é em moedas e seu amigo não gosta nem um pouco de ter moedas, então caso ele não consiga pagar dessa forma, ele realiza o pagamento no cartão. Como a fila é sempre muito grande e na maioria das vezes vocês estão entre os últimos, seu amigo realiza a contagem com muita calma para que não ocorra nenhum erro.\r\n\r\nHoje foi um dia diferente, ao chegar na lanchonete, você e seu amigo se depararam com algo muito estranho: a fila estava pequena. Seu amigo ficou muito preocupado e nervoso de não conseguir a tempo verificar suas moedas e ter que fazer as pessoas que estão atrás de vocês esperarem. Tentando o acalmar, você explica para ele que o problema de verificar as moedas é muito simples e que você é capaz de escrever um programa no celular rapidamente que, dado todas as moedas com seus valores e o preço do lanche, informe se é possível pagar usando apenas as moedas o valor total do lanche.\r\n\r\nComo vocês são uns dos primeiros da fila, escreva esse programa o mais rápido possível, para que seu amigo tome a decisão antes de chegar no caixa.","id":"2089","category":"Paradigmas","statistics":{"level":"8 / 10","submissions":924,"solved":252,"ratio":"27.27%"}}