{"output":"Para cada caso de teste você deverá imprimir qual será o K-ésimo produto que será dito.","input":"A entrada contém vários casos de teste. A primeira linha de cada caso de teste terá dois inteiro N e K (1 ≤ N ≤ 10⁵, 1 ≤ K ≤ min(2 * 10⁹, N * (N + 1) / 2)), representando a quantidade de crianças na brincadeira e qual o produto que seus amigos desejam saber, veja o exemplo para mais detalhes. Na próxima linha terá a sequência s1, s2, s3, ..., sn, onde si representa qual o produto a i-ésima criança irá dizer, cada palavra conterá no máximo 20 letras minúsculas. A entrada termina quando N = 0 e não deve ser processada.","level":6,"name":"Fui ao Mercado e Comprei...","has_images":false,"description":"Uma brincadeira muito comum entre crianças é \"Fui ao mercado e comprei...\", nela várias crianças formam uma fila e cada uma deve falar um item que compraria no mercado, porém para aumentar a dificuldade é necessário que cada criança repita todos os produtos que já foram ditos desde o inicio da brincadeira. O jogo termina quando alguém erra a ordem dos produtos ou quando a última criança da fila acerta a sequência.\r\n\r\nVamos imaginar que Maria, Pedro e Amanda começaram a brincar e já decidiram quem irá dizer qual produto, Maria irá dizer Pão, Pedro gosta de Queijo e Amanda irá falar Maçã.\r\nSupondo que a fila esteja organizada em ordem alfabética o jogo deveria seguir da seguinte forma:\r\n    1º Amanda diz: \"Fui ao mercado e comprei Pão\"\r\n    2º Maria  diz: \"Fui ao mercado e comprei Pão e Maçã\"\r\n    3º Pedro  diz: \"Fui ao mercado e comprei Pão, Maçã e Queijo\"\r\nPortanto a ordem dos produtos foi: Pão, Pão, Maçã, Pão, Maçã e Queijo.\r\n\r\nSeus amigos de colégio decidiram realizar essa brincadeira para passar o tempo. Depois de algum tempo de jogo a lista de produtos que cada um deveria dizer estava ficando muito grande, dessa forma, verificar se alguém errou não é uma tarefa simples. Foi quando seus amigos lembraram que você é programador e poderia resolver facilmente esse problema.\r\n\r\nDado a quantidade de pessoas na fila e qual produto cada um irá dizer, eles necessitam de um programa que informe qual é o K-ésimo produto que será dito. Assim ficará mais fácil de determinar se alguém errou ou não.\r\nVocê conseguirá ajudar seus amigos ?","id":"2090","category":"Ad-Hoc","statistics":{"level":"6 / 10","submissions":377,"solved":152,"ratio":"40.32%"}}