{"output":"Imprimir na saída uma linha contendo o número que representa o raio mínimo de um círculo que abrange pelo menos P plantas. Imprima o resultado usando exatamente 4 dígitos após o ponto decimal, arredondando, se necessário.","input":"A primeira linha contém dois inteiros N e P, indicando, respectivamente, a quantidade de plantas no jardim e a quantidade mínima de plantas que Florêncio quer cortar (1 ≤ P ≤ N ≤ 500). Cada uma das N linhas seguintes descreve uma planta diferente usando dois inteiros X e Y, que representam as coordenadas da planta no plano XY (1 ≤ X, Y ≤ 105). Não há duas plantas na mesma posição (que têm as mesmas coordenadas).","level":10,"name":"Flores","has_images":false,"description":"Na Babilônia crescem algumas plantas com flores que são valorizados entre os habitantes. Florêncio é um habitante da Babilônia que tem um jardim com N plantas destas espécies e quer coletar algumas de suas flores. Como Florêncio é muito preguiçoso, não quer trabalhar duro para recolher as flores. Portando, ele decidiu andar ate algum ponto do seu jardim, e então, com um movimento circular de sua foice, ele deve cortar uma boa quantidade de plantas para depois coletar suas flores. Florêncio é muito habilidoso usando a foice, então ele irá alcançar com ela um círculo perfeito centrado onde ele está, o que irá permitir a ele cortar todas as plantas dentro do círculo, incluindo sua borda. Quanto mais alto Florêncio levantar sua foice, maior será o raio do círculo que ele irá alcançar. Ele quer cortar pelo menos P plantas, mas a sua preguiça é tanta que ele quer fazer isso levantando sua foice o mínimo possível.\n\n                Florêncio conseguiu uma imagem de satélite do seu jardim, onde todas as suas plantas aparecem, e além disso conseguiu alguém para converter essa imagem em uma lista onde cada planta é representada por suas coordenadas em um plano XY. Agora ele está sentado do lado de fora, com sua foice na mão, esperando o seu time dizer a ele o raio mínimo de um círculo que cobre pelo menos P plantas.","id":"2094","category":"Geometria Computacional","statistics":{"level":"10 / 10","submissions":318,"solved":29,"ratio":"9.12%"}}