{"output":"Para cada instância na entrada, imprima uma linha com N inteiros p1, p2, ... , pN, onde pk é a probabilidade (em porcentagem) de, após infinitas rodadas, o jogador parar na casa k. Os números devem estar separados por espaços e ter 3 casas decimais.","input":"A entrada contém várias instâncias. Cada instância é composta por duas linhas. Na primeira linha, serão dados dois números inteiros N (3 ≤ N ≤ 1000) e D (3 ≤ D ≤ 20), separados por um espaço em branco, indicando respectivamente a quantidade de casas no tabuleiro e o número de lados no dado.\n\n                    Na segunda linha serão dados N números inteiros a1, a2, ... aN (-1 ≤ ai ≤ N-1) separados por espaços em branco, que é a descrição do tabuleiro como explicado no enunciado.\n\n                    A entrada termina quando N = D = 0.","level":9,"name":"Monopólio","has_images":false,"description":"A Maratona de Programação é um evento que acontece todos os anos com a ajuda de organizações e pessoas que são entusiastas da idéia de competições científicas. Dentre as motivações para participar dela, estão o aumento dos conhecimentos relacionados a algoritmos (e todas as àreas da matemática em geral), a melhora na estrutura de raciocínio, a melhora na velocidade de digitação e também a rede social criada com pessoas de alto nível na área de computação. Para os competidores da Unicamp, no entanto, a motivação é outra. O que leva essas pessoas a participarem da maratona é a oportunidade de viajar para ficar num hotel jogando jogos de tabuleiro.\n                        \n                        Na última maratona houve competições acirradas de várias modalidades de jogos, entre eles um chamado Banco Imobiliário. O objetivo desse jogo é garantir o maior acúmulo de capital possível através de especulação imobiliária.\n\n                        André foi um dos participantes do jogo, e acabou perdendo todas as partidas para seu colega de time Felipe, que foi acusado de bruxaria pela magnitude das vitórias obtidas, num jogo que teoricamente depende apenas de sorte e persuasão.\n\n                        Uma das coisas que mais indignou André foi ele não ter conseguido comprar os terrenos mais caros, enquanto Felipe sempre os comprava. Felipe tentou convencer André de que não praticava mais bruxaria há anos, e que ele não caiu nos territorios caros porque a probabilidade era muito pequena.\n\n                        Para ajudar Felipe a convencer André das probabilidades no tabuleiro, você escreverá um programa que, dada a descrição de um tabuleiro, calcule qual é a probabilidade de se cair numa determinada casa do tabuleiro após infinitas rodadas.\n\n                        O tabuleiro é descrito como uma sequencia de N casas. O tabuleiro é circular, ou seja, após a N-ésima casa, você vai para a primeira casa. Algumas casas são especiais, e te mandam imediatamente para outra casa. No início do jogo, todos estão na casa número 1, e a cada rodada os jogadores lançam um dado de D lados, que vai dizer quantas casas o jogador deve avançar.\n\n                        A descrição do tabuleiro é uma sequência de N inteiros, cada inteiro é:\n\n                        -1 se é uma casa normal;\n\n                        K se for uma casa especial, onde K é um inteiro representando o índice da casa para onde o jogador será imediatamente enviado (o índice da primeira casa é 0). A K-ésima casa é uma casa normal.\n\n                        Por exemplo, se o tabuleiro for descrito como -1 -1 0 1 -1 0, temos um tabuleiro com 6 casas, sendo que a primeira, a segunda e a quinta casa são normais. Se o jogador cai na terceira ou sexta casa, é enviado imediatamente (na mesma rodada) para a casa de índice 0 (a primeira). Se cai na quarta casa, é enviado para a casa de índice 1 (a segunda).\n\n                        Além disso, será dada a quantidade de lados do dado usado, que podem ter de 3 a 20 lados.","id":"2105","category":"Paradigmas","statistics":{"level":"undefined","submissions":-1,"solved":-1,"ratio":"undefined"}}