{"output":"Para cada instância na entrada, imprima uma linha com um inteiro representando a quantidade mínima de dinheiro que deverá ser gasto para a contratação dos N jogadores.","input":"A entrada contém várias instâncias.\n\n                    A primeira linha contém um número inteiro N (2 ≤ N ≤ 18), representando a quantidade de jogadores a serem contratados. Cada uma das próximas N linhas representa um jogador. Cada uma possui N inteiros c0 , c1 , c2 , ... cN−1 (1 ≤ ci ≤ 1000, para todo 0 ≤ i < N) separados por espaços, onde c k representa o custo para se contratar o jogador c se já tiverem sido contratados k jogadores.\n\n                    A entrada termina quando N = 0.","level":7,"name":"Montagem","has_images":false,"description":"Estamos no ano de 2931. Cientistas detectaram um meteoro que, em 15 meses, irá colidir com a Terra e extinguir a vida no planeta. Não há mais tempo para preparar ofensivas contra o meteoro, então só nos resta realizar nossos últimos desejos e esperar a colisão.\n\n                    Um grupo de pessoas resolve se unir e realizar o último sonho de centenas de milhares de pessoas: ver a Portuguesa campeã da Copa Libertadores da América. Para tal, será necessário a contratação de jogadores de grande habilidade, que também são muito caros.\n\n                    Para conseguir fazer isso, eles estudaram a personalidade dos melhores jogadores do mundo, e chegaram à conclusão que alguns aceitariam jogar na Portuguesa mais facilmente (isto é, seria contratado por um preço menor) se percebessem que seriam as únicas \"estrelas\"do time. Já outros, viriam mais facilmente caso percebessem que na Portuguesa já existem outras estrelas.\n\n                    Assim, através de um estudo mais detalhado das personalidades, conseguiram definir, para cada jogador, qual seria o preço para contratá-los em vários cenários.\n\n                    Por exemplo, o jogador X poderia ser contratado por $3 se fosse a única estrela do time ou por $5 se já houvesse 1 estrela no time antes dele entrar. Já o jogador Y seria contratado por $4 se fosse a única estrela do time, ou $2 se já houvesse uma estrela no time.\n\n                    Nesse cenário, a melhor maneira de contratar X e Y seria contratar primeiro o jogador X por $3 e depois Y por $2, gastando $5 no total.\n\n                    Você receberá os dados dos custos de contratação dos jogadores em cada cenário, e deverá dizer quanto os torcedores da Lusa deverão economizar para montar o time dos sonhos e conquistar a tão sonhada Libertadores.","id":"2106","category":"Paradigmas","statistics":{"level":"7 / 10","submissions":379,"solved":186,"ratio":"49.08%"}}