{"output":"Para cada instância, imprima uma linha com um único ponto flutuante arredondado para 3 casas decimais, indicando a probabilidade que o Alexey vença o duelo, sendo que ele que começa atacando.","input":"A entrada é composta por diversas instâncias e termina com final de arquivo (EOF).\n\n                    A primeira linha de cada instância contém quatro inteiros, VA, VB (1 ≤ VA , VB ≤ 300), NA and NB (1 ≤ NA, NB ≤ 10). Cada uma das próximas NA linhas descrevem um ataque do Alexey, elas começam com um inteiro D (1 ≤ D ≤ 3) e são seguidas por outros D inteiros L1 , . . . , LD (1 ≤ Li ≤ 12), indicando que nesse ataque Alexey lança D dados, com L1 , L2 , . . . , LD faces. As próximas NB linhas descrevem os ataques do Boris de maneira análoga.","level":10,"name":"Duelo de Espiões","has_images":false,"description":"Alexey e Boris eram dois agentes da KGB que moravam em Ecaterimburgo nos anos 70. A cidade era um tanto parada, e como nada acontecia,  os dois decidiram inventar um jogo de dados para não morrerem de tédio. Nesse jogo cada um deles começa com A e B pontos de vida respectivamente. Cada um têm à sua disposição um número de ataques possíveis, e eles se alternam atacando um ao outro. Cada ataque é descrito por uma quantidade de dados. Para saber o dano do ataque rodamos essa quantidade de dados e a soma dos valores é igual ao dano causado.\n\n                    Para jogar, eles têm disponível dados honestos com um número de faces entre 1 e 12. Dessa forma, se um dado com L faces for jogado ele vai mostrar um valor inteiro entre 1 e L, com igual probabilidade e de maneira independente de qualquer outro lançamento no jogo.\n\n                    Ambos os jogadores conhecem todos os seus ataques e os do seu oponente e escolhem como atacar em cada turno de forma a maximizar a sua própria probabilidade de vitória.\n\n                    Sua tarefa nesse problema é determinar qual a probabilidade de vitória de cada jogador.","id":"2109","category":"Paradigmas","statistics":{"level":"10 / 10","submissions":39,"solved":4,"ratio":"10.26%"}}