{"output":"Para cada instância imprima a representação do número N (0 ≤ N < 109) no sorobov com o seguinte formato.\n\n                    As duas primeiras linhas correspondem às pedras que valem 5, na linha seguinte imprima --------- (nove hífens) e as próximas cinco linhas correpondem às pedras que valem 1. Cada linha de pedras deve conter nove caracteres, onde '0' corresponde a um espaço vazio e '1' a uma pedra. Imprima uma linha em branco ao final de cada instância (inclusive a última).","input":"A entrada é composta por diversas instâncias e termina com final de arquivo (EOF). Cada instância corresponde a uma única linha contendo o número N a ser inserido no sorobov. A entrada deve ser lida da entrada padrão.","level":4,"name":"Entendendo o Sorobov","has_images":true,"description":"Instrumentos de ajuda a calcular existem há séculos. Muito antes do surgimento das máquinas de calcular no século XVII, chineses e japoneses faziam uso de ábacos com os quais podem fazer operações matemáticas sofisticadas em velocidade estonteante. Um instrumento semelhante foi recentemente descoberto em escavações nas imediações da cidade de Ecaterimburgo. Acredita-se ser um ábaco similar ao japonês, chamado, em russo, sorobov (copoбob).\n\n                    O sorobov tem nove colunas, onde cada coluna corresponde a um dígito. A coluna mais à direita representa a unidade, a segunda mais à direita representa as dezenas e assim por diante. Existem 7 linhas, sendo as duas primeiras separadas, por uma barra, das 5 últimas. Na parte de cima (duas primeiras linhas) cada coluna possui uma única pedra, que se encostada na barra separadora soma 5 ao valor do dígito correspondente. Na parte de baixo cada coluna possui 4 pedras e um espaço vazio e a quantidade de pedras entre a barra separadora e o espaço vazio é somado ao valor do dígito correspondente. Dessa forma, dizemos que as pedras de cima valem 5 e as de baixo valem 1.\n\n                    \n\n                    Figura 1: Ilustração de como representar os números de 0 a 9.\n\n                    Sua tarefa neste problema será, dado um número N imprimir uma representação da configuração do sorobov correspondente ao número.","id":"2111","category":"Estruturas e Bibliotecas","statistics":{"level":"4 / 10","submissions":240,"solved":113,"ratio":"47.08%"}}