{"output":"Seu programa deve gerar uma única linha que contêm um único inteiro: o maior número de amigos que o Mestre pode conseguir.","input":"A primeira linha da entrada contêm dois inteiros: N e M (3 ≤ N, M ≤ 1000), o número de comentários na lista que mestre recebeu e o número de pessoas que são amigos de amigos do Mestre, respectivamente. As próximas N linhas irão conter cada um dos comentários da lista que Mestre recebeu. Cada linha representa um comentário. Por restrição do FariasBook, cada comentário só pode conter no máximo 140 caracteres, que devem ser letras (minúsculas ou maiúsculas) ou espaços. As próxima M linhas contêm cada uma, uma letra maiúscula Ci e um inteiro Ki, que representam, respectivamente, a letra favorita da pessoa i e quantas vezese ela deve aparecer em um comentário para que a pessoa aceite a solicitação de amizade do Mestre.","level":10,"name":"Mestre Me Ajude","has_images":false,"description":"Mestre Pátio Zero é um coordenador do Farias Brito que usa de sua extensa rede de amigos no FB (FariasBook) para auxiliar jovens alunos que desejam estudar na organização. Recentemente, ele decidiu ampliar ainda mais seu número de amigos, e fará isso comentando fotos avulsas de pessoas que são amigas de seus amigos.\n\nBaseado em um recente estudo do renomado instituto de pesquisa FBideias, Mestre sabe que uma determinada pessoa i aceitará sua solicitação de amizade após ele deixar um comentário S em uma de suas fotos se a letra favorita da pessoa i aparecer pelo menos Ki vezes em S, não importando se a letra aparece em sua forma maiúscula ou minúscula.\n\nPor carregar consigo o nome da Organização, Mestre enviou para o FBideias todos os seus possíveis comentários, e recebeu uma lista com os N que foram aprovadas como politicamente corretos, mas como o FariasBook tem uma política contra SPAM muito rígida, ele não pode repetir o mesmo comentário em duas fotos distintas.\n\nJogério Rúnior estuda para olimpíadas de informática no colégio, e por isso Mestre decidiu pedir a ajuda dele em duas tarefas: consertar sua impressora e escolher o que comentar em cada foto de modo que seu número de amigos aumente o máximo possível. Ele percebeu que a impressora apenas estava com um cabo solto, resolveu esse problema e passou para você, a novata Fia Breire, a missão de comentar as fotos. Ajude o Mestre!","id":"2117","category":"Grafos","statistics":{"level":"10 / 10","submissions":261,"solved":62,"ratio":"23.75%"}}