{"output":"Para cada localização de um aluno que deseja se matricular no Farias Brito, imprima o identificador da melhor sede que o aluno deve se matricular. Caso não exista sede que seja acessível pelo aluno utilizando as ruas de Fortaleza, imprima “Noic”.","input":"A entrada é composta por múltiplas linhas. A primeira linha da entrada contém quatro inteiros L, S, Q (1 ≤ L, S, Q ≤ 105) e A (1 ≤ A ≤ 106), representando o número de locais, o número de sedes, o números de estudantes e o número de ruas. Cada uma das próximas S linhas contém três inteiros Pi, Mi e Ti (1 ≤ Mi, Ti ≤ 109), representando o local onde a sede está localizada, o número de medalhas da sede e o número de dias que a sede foi construída. Cada uma das próximas A linhas contém dois inteiros X e Y cada, representando que existe uma rua que conecta os locais X e Y. Cada uma das próximas Q linhas contém a localização de cada aluno que deseja se matricular no Farias Brito.\n\nÉ garantido que para quaisquer duas sedes distintas, elas não foram construídas no mesmo dia.","level":10,"name":"Qual a Sede?","has_images":false,"description":"Em Fortaleza, todos os estudantes pretendem estudar em alguma sede do Colégio Farias Brito, porém como existem muitas sedes na cidade, alguns estudantes ficam em dúvida em qual sede se matricular.\n\nUm estudante opta por estudar na sede mais próxima de onde ele mora. Caso existam sedes com mesma distância de onde ele mora, o estudante opta por estudar na sede que obteve mais medalhas em olimpíadas. Caso ainda permaneça o empate, o estudante opta pela sede mais antiga.\n\nO mapa de Fortaleza pode ser desenhado como um grafo, em que os vértices representam os locais, e as arestas representam as ruas (Conectando dois locais). A distância entre dois locais X e Y é determinada pelo número mínimo de ruas que se deve utilizar para chegar em Y a partir de X.\n\nO grande chefe Parcelo Mena ordenou que o estagiário Nhalyson Tepomuceno fizesse um programa que indique qual a melhor sede para os alunos.","id":"2118","category":"Grafos","statistics":{"level":"10 / 10","submissions":344,"solved":53,"ratio":"15.41%"}}