{"output":"A saída consiste em Q inteiros. Os inteiros representam, em ordem, a matrícula dos tutores de cada aluno na ordem que foi pedida.","input":"A entrada consiste de quatro linhas. A primeira contém um inteiro N (2 ≤ N ≤ 100 000), o número de estudantes do Farias Brito. A segunda linha contém n inteiros distintos Xi (1 ≤ Xi ≤ 109), representando a matrícula de cada um dos n alunos na ordem em que eles foram adicionados ao sistema. A terceira linha contém Q (1 ≤ Q ≤ 99 999). A quarta linha contém os Q alunos representados por números de 1 a N que se quer informação (não será pedida informação sobre o primeiro aluno).","level":10,"name":"Tutores","has_images":true,"description":"Cada vez que um novo aluno entra da Organização Educacional Farias Brito, ele recebe um tutor para ajudá-lo a conhecer a todos e tudo na escola.\n\nO sistema da escola para determinar o tutor de cada novo aluno foi criado por um louco chamado Succa Liaudzionis. Succa decidiu usar o número de matrícula de cada aluno para seguir o padrão de uma árvore binaria de busca (porque sim), desta maneira:\n\n\n\tO primeiro aluno, com matrícula X1 vira a raíz da árvore e então não possui tutor.\n\tOs números X2, X3, …, Xn são adicionados um a um a árvore. Para adicionar um número Xi, você deve percorrer a árvore partindo da raíz e usando as seguintes regras:\n\n\n\n\tO ponteiro está inicialmente apontando para a raíz da árvore.\n\tSe Xi é menor que o número do nó atual, o filho da esquerda passar a ser o nó atual. Senão, o filho da direita vira.\n\tSe, em algum momento, o filho desejado não existir, cria-se um novo nó contendo o valor de Xi. A matrícula do tutor do estudante atual é o pai de Xi na árvore.\n\n\nPor exemplo, se a ordem na qual os números forem adicionados for (3, 1, 4, 2, 5), a árvore fica desta maneira:\n\n\n\n\n\nSucca precisava de espaço extra em seu computador e decidiu apagar toda informação envolvendo os tutores dos alunos. Agora, seu chefe, Jeixeira Túnior, pediu a mesma informação sobre Q alunos que ele acabou de deletar! Succa considerou perguntar a cada estudante quem é seu tutor, mas isso demoraria tempo demais.\n\nPor outro lado, Succa ainda sabe a ordem na qual os estudantes foram adicionados a árvore. Como Succa não é tão brilhante quanto louco, ele precisa da sua ajuda para usar essa informação e determinar o tutor de cada aluno.","id":"2120","category":"Estruturas e Bibliotecas","statistics":{"level":"10 / 10","submissions":248,"solved":55,"ratio":"22.18%"}}