{"output":"Para cada caso, você deverá imprimir um identificador \"Instancia K\", onde K é o número da caso atual. Na linha seguinte você deve imprimir \"sim\" se for possível atender pelo menos um desejo de cada convidado e \"nao\" caso contrário. Após cada caso, seu programa deve imprimir uma linha em branco.","input":"A entrada é composta de diversas casos. Cada caso começa com um inteiro N (1 ≤ N ≤ 1000), indicando a quantidade de questionários recebidos pela Sra. Montagny. Cada uma das próximas N linhas contém dois nomes de comida indicando a preferência de cada convidado. Um nome de comida é uma sequencia de letras [a-z] com no máximo 20 letras. Quando o nome de uma comida é iniciado por ‘‘!’’ significa que o convidado deseja vetar a comida, caso contrário ele deseja selecionar.","level":6,"name":"Cardápio da Sra. Montagny!","has_images":false,"description":"Sra. Montagny é uma socialite de Quebec, que passa as férias em Banff, na sua mansão à beira do Lake Louise. Seus jantares são famosos porque ela com antecedência passa um questionário aos convidados onde os mesmos participam da escolha do cardápio. No questionário, a famosa magnata lista todos os pratos que poderá fazer no jantar, oferecendo uma coluna para o convidado selecionar o prato e outra para vetá-lo.\n\n                    É permitido fazer apenas duas escolhas no questionário, ou seja, cada convidado pode selecionar um prato e vetar outro, vetar dois pratos ou selecionar dois pratos. A Sra. Montagny garante que todos os convidados terão pelo menos um de seus desejos atendidos.\n\n                    Antigamente ela mesma dava conta de montar o cardápio e atender o que prometia, mas com o crescimento de suas festas isso tem se tornado impossível. Assim, ela resolveu contratar vocês para fazer um programa que recebe os pedidos dos convidados e responde se é possível montar o cardápio para a festa.","id":"2124","category":"Paradigmas","statistics":{"level":"6 / 10","submissions":132,"solved":68,"ratio":"51.52%"}}