{"output":"Para cada instância, você deverá imprimir um identificador Instancia k, em que k é o número da instância atual. Imprima a lista de todas ocorrências linha coluna (o canto superior esquerdo é a posição 0 0) do quadrado m × m no quadrado n × n. A saída deve estar ordenada primeiro pelas colunas e em seguida pelas linhas. Caso não tenha nenhuma ocorrência, imprima uma linha com nenhuma ocorrência.","input":"A entrada é composta de diversas instâncias. A primeira linha de cada instância consiste em dois inteiros n (1 ≤ n ≤1000) e m (1 ≤ m ≤ 60 e m < n), indicando os tamanhos dos quadrados. Nas n linhas seguintes temos n caracteres \"|\" ou \"_\" que representam os caracteres do quadrado n × n. Nas m linhas seguintes temos m caracteres \"|\" ou \"_\" que representam os caracteres do quadrado m × m.","level":10,"name":"Construtores de Totens","has_images":false,"description":"Várias civilizações pré-colombianas habitaram a região de Alberta, Canadá. Pouco restou destas culturas, dizimadas pelo frio intenso, pelos ursos e, finalmente, pelos invasores ingleses e franceses que chegaram depois do descobrimento. Hoje, pesquisadores da Universidade de Alberta tentam desvendar os mistérios destes povos, estudando os totens produzidos na região.\n\n                    Estudos do departamento de artes da universidade mostraram que os construtores de totens gostavam de marcá-los com várias cópias de suas assinaturas. A assinatura do artista era feita com sulcos verticais “|” e horizontais “_”. Estudiosos imaginam que o símbolo era uma representação do mal na cultura primitiva e, portanto, tabu, construindo um padrão quadrado. Já foram identificadas várias assinaturas de artistas daquela época.\n\n                    Sua tarefa neste problema é fazer um programa que recebe o desenho de um totem, através de um padrão quadrado de tamanho n × n de sulcos verticais e horizontais, e uma assinatura quadrada de tamanho m × m com um padrão do mesmo tipo, e encontrar todas as ocorrências da assinatura no totem.","id":"2125","category":"Ad-Hoc","statistics":{"level":"10 / 10","submissions":147,"solved":25,"ratio":"17.01%"}}