{"output":"Para cada instância, você deverá imprimir um identiﬁcador \"Instancia K\", onde K é o número da instância atual. Na linha seguinte imprima o custo de um sistema que atenda os requisitos descritos acima.\n\n                    Após cada instância imprima uma linha em branco.","input":"A entrada é composta de diversas instâncias. A primeira linha de cada instância contém dois inteiros N (1 ≤ N ≤ 1000) e M (1 ≤ M ≤ 2000000), onde N é o número de \"pontos de cipó\" e M é o número de cipós. Cada uma das M linhas seguintes contém três inteiros U, V e C indicando que existe um cipó que vai do ponto U e até o ponto V com custo C, onde 1 ≤ U, V ≤ N e C ∈ {1235,8977,10923}. A entrada termina com ﬁnal de arquivo.","level":7,"name":"Sistema Cipoviário","has_images":false,"description":"Os pesquisadores do departamento de pesquisa operacional da Universidade da Columbia Britânica foram contratados para uma estranha tarefa. Vários países da África resolveram se unir e utilizar oﬁcialmente o meio de transporte que ﬁcou mundialmente conhecido nos ﬁlmes do Tarzan: o cipó. Há milhões de cipós na África e é surpreendente com que velocidade e eﬁciência uma pessoa pode se deslocar na selva utilizando esse meio de transporte. Só surgiu um pequeno problema. Os cipós são dominados por três grandes tribos: os makelelês, os malouhdás e os abedis. As tribos exigem ser pagas por cipó usado no sistema de transporte. Como eles ainda não sabem o signiﬁcado de palavras como cartel, cada uma fez o seu preço, e divergiram bastante. Enquanto os makelelês exigem 1235 bongôs por cipó usado, os malouhdás exigem 8977 e os abedis 10923 (a Jane ainda está viva, e ajudou a intermediar a negociação para esta tribo).\n\n                    Os pesquisadores foram contratados para escolher os cipós que comporão o primeiro sistema cipoviário do mundo. Os contratantes construíram milhões de “pontos de cipó” pela selva africana e desejam que os cipós sejam escolhidos de tal forma que seja possível ir de qualquer ponto a qualquer outro usando os cipós contratados (você pode ter de trocar de cipó algumas vezes, como fazia o Tarzan). Você deve dizer qual o custo de um sistema que atenda estes requisitos e seja o mais barato possível.\n\n                    Você pode supor que existam cipós suﬁcientes na selva para que sempre exista um sistema cipoviário que atenda os requisitos.","id":"2127","category":"Grafos","statistics":{"level":"7 / 10","submissions":563,"solved":201,"ratio":"35.70%"}}