{"output":"Assim que o HP do combatente X chegar a 0 ou ficar abaixo de 0, imprima \"X is dead.\" e na linha seguinte, o HP, MP, ATK, MAG e DEF do sobrevivente.","input":"Haverá somente um caso de teste. A primeira linha deve conter o nome do combatente 1 e a segunda linha, seu respectivo nível (inteiro: 1 ≤ N ≤ 99), HP, MP (ponto flutuante: 1 ≤ HP, MP ≤ 999), ATK, MAG e DEF (ponto flutuante: 1 ≤ ATK, MAG, DEF ≤ 40). A terceira e a quarta linha deverá conter o mesmo que a primeira e a segunda, mas para o combatente 2. O primeiro a atacar é o combatente 1, ou seja, no primeiro turno, o combatente 1 é o atacante atual e o combatente 2 é o defensor atual. No segundo turno, o atacante é o combatente 2 e o defensor é o combatente 1. A mesma lógica se aplica nos turnos seguintes.","level":7,"name":"P4 Simplificado","has_images":true,"description":"Você, fã da franquia de jogos eletrônicos \"A Verdadeira Reencarnação da Deusa\", foi contratado pela empresa desenvolvedora ATULS para ajudar na criação de uma versão simplificada do jogo Personalidade 4, um spin-off dessa franquia. Você será responsável pela implementação do sistema de batalha. A tabela a seguir contém as habilidades possíveis e suas respectivas características:\n\n\n\n\t\n\t\n\t\tHabilidade\n\t\tTipo\n\t\tPoder\n\t\tCusto HP\n\t\tCusto MP\n\t\tEfeito\n\t\n\t\n\t\n\t\n\t\tMightySwing\n\t\tFísico\n\t\t270\n\t\t14%\n\t\t-\n\t\t-\n\t\n\t\n\t\tGiganticFist\n\t\tFísico\n\t\t560\n\t\t16%\n\t\t-\n\t\t-\n\t\n\t\n\t\tRainyDeath\n\t\tFísico\n\t\t350\n\t\t20%\n\t\t-\n\t\t-\n\t\n\t\n\t\tAgilao\n\t\tMágico - Fogo\n\t\t200\n\t\t-\n\t\t8\n\t\t-\n\t\n\t\n\t\tAgidyne\n\t\tMágico - Fogo\n\t\t320\n\t\t-\n\t\t12\n\t\t-\n\t\n\t\n\t\tBufula\n\t\tMágico - Gelo\n\t\t200\n\t\t-\n\t\t8\n\t\t-\n\t\n\t\n\t\tBufudyne\n\t\tMágico - Gelo\n\t\t320\n\t\t-\n\t\t12\n\t\t-\n\t\n\t\n\t\tMegidola\n\t\tMágico\n\t\t360\n\t\t-\n\t\t32\n\t\t-\n\t\n\t\n\t\tMegidolaon\n\t\tMágico\n\t\t420\n\t\t-\n\t\t60\n\t\t-\n\t\n\t\n\t\tBlackViper\n\t\tMágico\n\t\t440\n\t\t-\n\t\t64\n\t\t-\n\t\n\t\n\t\tTarukaja\n\t\tSuporte\n\t\t-\n\t\t-\n\t\t12\n\t\tAtaque Físico atual do atacante aumenta em 25% e fica ativo até que ele use um atk físico\n\t\n\t\n\t\tRakukaja\n\t\tSuporte\n\t\t-\n\t\t-\n\t\t12\n\t\tDefesa atual do atacante aumenta em 25% e fica ativo até que ele sofra um atk qualquer\n\t\n\t\n\t\tTarunda\n\t\tSuporte\n\t\t-\n\t\t-\n\t\t12\n\t\tAtaque Físico atual do defensor diminui em 25% e fica ativo até que ele use um atk físico\n\t\n\t\n\t\tRakunda\n\t\tSuporte\n\t\t-\n\t\t-\n\t\t12\n\t\tDefesa atual do defensor diminui em 25% e fica ativo até que ele sofra um atk qualquer\n\t\n\t\n\n\nOBS.: As habilidades do tipo Suporte não acumulam e sempre consomem MP, mesmo não tendo mais efeito. Por exemplo, se o jogador usa a habilidade Rakunda 5 vezes seguida, a DEF do defensor ainda será 25% menor e o consumo de MP terá sido 60. Para testar a funcionalidade desse sistema, você deverá considerar uma batalha 1 vs. 1. Cada combatente terá nível, HP (pontos de vida), MP (pontos de magia) e os atributos ATK (ataque físico), MAG (ataque mágico) e DEF (defesa geral). A fórmula de dano é a seguinte:\n\n\n\nAT = Ataque do atacante atual. Se ataque físico, substitua por ATK, se ataque mágico, substitua por MAG.\nDF = Defesa geral do defensor atual, isto é, o atributo DEF.\nP = Poder do ataque.\nDIFF = Diferença entre o nível do atacante atual e o nível do defensor atual. Este valor não será menor do que -10 e nem maior do que 10.","id":"2141","category":"Ad-Hoc","statistics":{"level":"7 / 10","submissions":49,"solved":16,"ratio":"32.65%"}}