{"output":"Para cada caso de teste imprima a palavra Caso, seguida por um espaço, o número do caso e dois pontos. Na linha seguinte, imprima o percurso feito, saindo de casa e voltando para lá, de modo que tenha obtido o menor caminho, separando cada local visitado por um hífen e um sinal de maior, dando uma ideia de seta, seguido de dois pontos, um espaço, e a distância do percurso total, com cinco casas decimais. Caso o menor caminho tenha mais de uma possibilidade, imprima o caminho lexicograficamente menor. Ou seja, se tem um percurso saindo de casa e indo para o icosaedro de uma estrela, e outro indo para o de duas estrelas, opte por ir na de uma estrela primeiro, desde que ambos os caminhos tenham a mesma distância.","input":"A primeira linha terá um valor inteiro C indicando o número de casos de teste. Para cada caso de teste, haverá uma linha com dois inteiros, X e Y, indicando as coordenadas da casa de Kogu, de posse do icosaedro de quatro estrelas. Depois haverá mais seis linhas, cada uma com três inteiros, N, XN e YN, representando o icosaedro de N estrelas, e as coordenadas onde tal icosaedro se encontra.","level":9,"name":"Os Icosaedros do Lagarto","has_images":true,"description":"Reza a lenda que os Icosaedros do Lagarto são cristalinos e podem invocar o Lagarto Shen Long Int, que tem a habilidade de conceder desejos para quem conseguir juntar os sete icosaedros. Os icosaedros vêm em conjuntos de sete com cada mostrando o número de estrelas. Estes são difíceis de encontrar porque eles se dispersam ao redor do planeta, e se desativam por um ano a cada desejo, se transformando em pedras. Para ter a oportunidade de invocar o Lagarto, um tem que viajar ao redor do globo para encontrá-las. Certo dia, Kogu ganha o icosaedro de quatro estrelas de seu avô, Hogan. Ao saber da lenda, Kogu resolve ir atrás dos outros icosaedros, para que possa perder o medo de injeção. Como a tecnologia progrediu, isso ficou mais fácil, e bem simples com a invenção de sua amiga Mulba, o Radar do Lagarto. Só que, para ganharem tempo, precisam saber qual ordem de busca dos icosaedros eles devem seguir, de modo que percorram a menor distância possível, com a sua nuvem voadora.\n\n\n\n\nEscreva um programa que, dadas as coordenadas dos icosaedros, informe o caminho de menor distância, saindo de sua casa, capture todos os icosaedros e volte para casa, além de informar a distância de tal caminho.","id":"2155","category":"Grafos","statistics":{"level":"9 / 10","submissions":143,"solved":41,"ratio":"28.67%"}}