{"output":"Para cada caso de teste imprima se Leon conseguirá ou não completar a missão. Mostre conforme o exemplo de saída.","input":"A entrada é composta por diversos casos de teste, cada caso inicia com um valor QA, (1 <= QA <= 7), indicando a quantidade de armas. Em seguida são lidos QA valores e suas respectivas quantidades de munição. É lido então um valor QM (1 <= QM <= 10), indicando a quantidade de monstros, e seguem QM linhas indicando o monstro e a quantidade de cada um. E por ultimo, é recebido um valor QB (1 < QB < 104), indicando a quantidade máxima de balas que ele poderá utilizar, pois dessa forma ele não sairá sem balas do galpão... se sair.","level":8,"name":"Ajude o Leonardo!","has_images":true,"description":"\"Leonardo Silva Kennedy era apenas um policial novato quando presenciou o tenebroso evento que aconteceu em 1998, na cidade de Raccoon City. Muito tempo se passou e Leonardo finalmente conseguiu deixar para trás as imagens daquele dia. Seis anos depois, ele é um agente do serviço secreto norte-americano, responsável pela proteção da família presidencial.\n\nA filha do presidente é sequestrada na saída de sua universidade por uma organização desconhecida. A única pista é que ela teria sido vista em uma remota ilha do continente europeu. Agora, cabe a Leonardo resgatá-la. Mal sabia ele que isso significava uma nova imersão em um pesadelo que ele acreditava ter acabado.\"\n\n\n\nEm um determinado momento, Leonardo descobre um mapa de um galpão onde ele deverá entrar para buscar uma relíquia. Através do mapa ele pode ver quantos e que tipo de monstros existem no local. Ele dispõe de N armas e um valor Y de munição. Para a sorte dele, ali próximo existe um mercador de armas. Então Leonardo solicita a sua ajuda(o mercador) para que diga se ele conseguirá, com a quantidade de balas e as armas que ele dispõe, matar os monstros ou se será morto.\n\n\n\nSeguem as armas que Leonardo dispõe no momento e a potência de cada uma:\n\n\n\nE os monstros que pode haver no galpão:\n\n\n\nObs: Ao escolher uma arma, Leonardo utiliza todas as balas que ela possui.","id":"2169","category":"Paradigmas","statistics":{"level":"8 / 10","submissions":364,"solved":82,"ratio":"22.53%"}}