{"output":"Imprima uma única linha contendo a quantidade mínima de voltas completas na lagoa que Bino deve realizar para capturar todas as aves.","input":"A primeira linha contém dois inteiros A (1 < A ≤ 103) e P (1 < P ≤ 109), representando respectivamente o número de aves e o número de locais. Em seguida serão apresentadas A linhas. Cada linha iniciará com um inteiro Ni (1 ≤ Ni ≤ 103), representando a quantidade de locais que a ave i vai tentar fugir, em seguida, serão apresentados Ni inteiros, representando a lista de locais par onde a ave vai fugir.","level":7,"name":"Lagoa Azul","has_images":true,"description":"A Lagoa Azul é uma lagoa redonda, onde várias aves vivem tranquilamente (ou nem tanto). Bino, um garoto malino, quer capturar todas as aves que vivem na Lagoa Azul. Existem P locais na lagoa onde alguma ave pode ficar, como ilustrado na figura abaixo para P = 8.\n\n\n\nBino sabe que as aves se cansam, e não querem sair da lagoa em nenhum momento. Cada ave pode realizar um determinado número de voos, após isso ficara cansada demais para voar novamente. Bino vai iniciar na posição 0, e seguir sempre na direção horária, até conseguir capturar todas as aves.\n\nCada ave tem uma lista ordenada de locais para onde ela prefere fugir caso Bino chegue ao local onde ela está. Por exemplo, para o primeiro caso de teste, existe apenas uma ave que começa no local 1, quando Bino chega em 1, ela foge para 2, quando Bino chega em 2, ela foge para 3, e quando Bino chega em 3, ela já está cansada e é capturada.\n\nSua tarefa é descobrir qual a quantidade mínima de voltas completas na lagoa que Bino deve realizar para capturar todas as aves. Em uma volta completa, Bino visita todos os locais, e retorna para a posição 0 (revisitando a posição 0).\n\nÉ garantido que nenhuma ave comece na posição 0, e também que nenhuma ave tente fugir para o mesmo local onde ela está.","id":"2178","category":"Ad-Hoc","statistics":{"level":"7 / 10","submissions":741,"solved":228,"ratio":"30.77%"}}