{"output":"Imprima uma única linha contendo três valores, os quais representem, nesta ordem, o número de públicos em Valinor, o número máximo de elfos num público em Valinor e a soma máxima das rendas dos elfos de um mesmo público em Valinor. Imprima o último valor com exatamente dois dígitos após o ponto separador decimal.","input":"A entrada consiste de três linhas. A primeira linha consiste de dois inteiros positivos N e D (N ≤ 105, D ≤ 107), os quais representam respectivamente o número de elfos em Valinor e o parâmetro que define o conceito de faixa etária adotado. A segunda linha consiste de N inteiros ai (1 ≤ i ≤ N, 0 ≤ ai ≤ 107), os quais representam as idades de cada um dos elfos. Por fim, a terceira linha consiste de N valores ci (1 ≤ i ≤ N, 0.00 ≤ ci ≤ 10000.00), fornecidos com exatamente dois dígitos após o ponto separador decimal, os quais representam as rendas correspondentes dos elfos, segundo a ordem em que os elfos foram fornecidos na linha anterior.","level":9,"name":"URI - Uireb Rhom uin Iavas","has_images":false,"description":"A Uireb Rhom uin Iavas (traduzindo: Eterna Trombeta do Outono), uma importante empresa de Valinor, está fazendo uma pesquisa sobre os diversos públicos do reino abençoado. Para a URI, um público é um conjunto não-vazio maximal de elfos S tal que quaisquer dois elfos tomados de S são da mesma faixa etária. A propósito, a URI considera que dois elfos são da mesma faixa etária se e só se a diferença entre suas idades não excede um determinado parâmetro D. Por exemplo, sob D = 500, se Aegnor, Beleg e Celeborn têm respectivamente 1300, 500 e 1000 anos de idade, Aegnor e Celeborn são considerados da mesma faixa etária, assim como Beleg e Celeborn, mas não Aegnor e Beleg. Ainda, se os únicos elfos em Valinor fossem Aegnor, Beleg, Celeborn e Daeron, este de 700 anos de idade, os dois públicos seriam {Aegnor, Celeborn} e {Beleg, Celeborn, Daeron}. Note que o conjunto {Beleg, Celeborn}, apesar de conter dois elfos de mesma faixa etária, não é considerado um público por não ser maximal.\n\nA URI quer saber o que é melhor para o lançamento de um produto: focar num público com o maior número de elfos possível, ou focar num público talvez mais restrito, mas com maior poder aquisitivo? Portanto, as informações que a URI precisa levantar são cruciais para que a empresa faça a escolha certa!","id":"2181","category":"Paradigmas","statistics":{"level":"9 / 10","submissions":490,"solved":70,"ratio":"14.29%"}}