{"output":"Imprima uma única linha, a menor quantidade inicial de pontos de vida para que Bia consiga vencer o desafio. Caso seja impossível chegar a sala final, imprima ‘-1’.","input":"A primeira linha contêm dois inteiros N, K, indicando, respectivamente, a dimensão da matriz e a quantidade de salas imunes que Bia fica quando junta todos os itens mágicos. (2 ≤ N ≤ 100, 1 ≤ K ≤ 10).\n\nA seguir temos N linhas que descrevem a matriz, cada uma dessas linhas conterá a informação de N salas, sendo os caracteres: ‘I’, ‘F’, ‘#’, ‘P’, ‘O’, ‘W’, ‘E’, ‘R’ ou um número inteiro D, todos descritos acima. (1 ≤ D ≤ 9).","level":10,"name":"Batalha Final","has_images":false,"description":"Bia está jogando um jogo de Zumbi e está prestes a começar o último desafio. Modelaremos esse desafio como uma matriz NxN, onde o objetivo de Bia é sair da sala situada na posição [1, 1] e chegar na sala da posição [N, N]. Porém, como nada nessa vida é tão simples, existem salas que contêm zumbis, salas que são bloqueadas e salas que contêm itens mágicos para serem pegos que, quando fundidos, dão a Bia um grande poder.\n\n\n\tA sala [1, 1] contém sempre uma letra ‘I’ e a sala [N, N] a letra ‘F’ significando, respectivamente, o início e fim do desafio.\n\tAs salas bloqueadas conterão o símbolo ‘#’, sendo assim impossível passar por elas.\n\tSalas com um número inteiro D significam que existem zumbis e, ao passar por elas, Bia perderá D pontos de vida.\n\tAs outras salas conterão uma das seguintes letras: ‘P’, ‘O’, ‘W’, ‘E’ ou ‘R’, significando a inicial de cada um dos cinco itens mágicos. Quando Bia passa por uma sala com algum desses itens, ela pega e guarda em sua mochila, e no exato momento que junta todos eles, Bia se torna imune aos zumbis nas próximas K salas que entrar. É possível ter apenas um item de cada ao mesmo tempo na mochila e, quando usado, todos serão perdidos e poderão ser coletados novamente ao decorrer da batalha. Se Bia juntar todos os itens em um momento que ainda estiver sob o efeito de uma junção anterior, a quantidade de sala imune não será acumulada, e sim voltará ao valor máximo de K.\n\n\nSua tarefa é descobrir qual a menor quantidade inicial de pontos de vida para que Bia consiga vencer o desafio, dado que ela sempre escolhe o melhor caminho possível. Bia vence o desafio se chegar a sala [N, N] com pelo menos 1 ponto de vida.\n\nSe Bia está no momento na sala [X, Y], ela pode andar apenas para as salas [X+1, Y] ou [X, Y+1].","id":"2183","category":"Paradigmas","statistics":{"level":"10 / 10","submissions":273,"solved":66,"ratio":"24.18%"}}