{"output":"Imprima uma única linha, a maior soma das forças dos pomekons capturados que Geraldinho pode conseguir, respeitando as condições dadas. Caso não consiga capturar nenhum pomekon, imprima -1.","input":"A primeira linha contêm dois inteiros N, K, indicando, respectivamente, o número de pontos mapeados na cidade e a quantidade máxima de pontos em que Geraldinho pode passar. (2 ≤ N ≤ 105,  2 ≤ K ≤ 103). \n\nSegue então N-1 linhas, contendo três inteiros X, Y, F, indicando que existe uma ligação bidirecional entre o ponto X e Y contendo um pomekon de força F. (1 ≤ X, Y ≤ N, X != Y, 1 ≤ F ≤ 1000). \n\nApós isso, há uma linha com um inteiro Q, indicando o número de rotas. Q linhas seguem com dois inteiros A, B, indicando que existe uma rota partindo do ponto A até o ponto B. (1 ≤ Q ≤ 5*103,  1 ≤ A, B ≤ N, A ≠ B).","level":9,"name":"Pomekons","has_images":false,"description":"Pomekon GO foi lançado e já é uma febre entre as pessoas. Após vários dias andando em sua cidade procurando por um padrão de onde os pomekons aparecem, Geraldinho tirou algumas conclusões e deseja usar suas habilidades em programação para sair na frente na captura dos pomekons. Geraldinho mapeou sua cidade em vários pontos. Entre cada par de pontos que se conectam diretamente, ele sabe a força do pomekon que aparece por lá.\n\nAgora, Geraldinho quer expandir sua jornada pomekon por todo o mundo e, para isso, ele necessita de sua ajuda.\n\nExistem Q possíveis rotas no formato [A, B]. Isso significa que você deve andar do ponto A até o ponto B. (Observe que existe apenas um caminho entre quaisquer pares de pontos). Cada rota pode ser usada uma única vez e é possível capturar apenas um pomekon por rota, já que as pobekolas estão caras. Outro fato importante é que Geraldinho pode visitar no máximo K pontos em sua jornada.\n\n\n\tSe existir duas rotas que passam por um ponto P, ele será contado duas vezes.\n\tSe existir duas rotas que passam pela mesma ligação, é possível capturar o pomekon nas duas passadas.\n\n\nGeraldinho quer maximizar a soma das forças dos pomekons que poderá capturar, ajude-o nessa jornada!","id":"2184","category":"Grafos","statistics":{"level":"9 / 10","submissions":318,"solved":107,"ratio":"33.65%"}}