{"output":"Para cada operação 1, imprima uma única linha contendo a quantidade de ocorrências do caractere C no intervalo entre as posições A e B.\n\nPara cada operação 2, imprima a primeira e a última ocorrência do caractere C no intervalo entre as posições A e B. Caso não exista o caractere C no intervalo, imprima -1.\n\nAo final das N operações, imprima a string resultante das operações.","input":"A primeira linha da entrada consiste de dois inteiros L ( 1 ≤ L ≤  106) e N ( 1 ≤ N ≤  105), representando a quantidade de letras que formam inicialmente o nome S, e a quantidade de rodas, respectivamente. A segunda linha contém uma string S, representando o nome inicial do cachorro de Prant. Então, seguiram N linhas, representando as N operações realizadas.\n\nÉ garantido que a string S contém apenas letras minúsculas do alfabeto.","level":10,"name":"Bino, Prant e a Indecisao","has_images":false,"description":"Como você já deve saber, Prant é um garoto muito indeciso, de tal modo que foi muito difícil escolher o nome do seu cachorro. Depois de Prant escolher o nome S para seu cachorro, Bino propôs um desafio.  O desafio de Bino consiste em N rodadas, e em cada rodada pode ser realizada uma das seguintes operações sobre o nome S:\n\n1 A B C: Retornar a quantidade de ocorrências de um caractere C no intervalo entre as posições A e B. Por exemplo, para S = “abcda”, A = 1, B = 5 e C = ‘a’, a resposta é 2.\n\n2 A B C: Encontrar a primeira e a última ocorrência de um caractere C no intervalo entre as posições A e B. Por exemplo, para S = “abcda”, A = 1, B = 5 e C = ‘a’, a primeira ocorrência de C é na posição 1, e a última é na posição 5.\n\n3 A B: Inverter todas as letras no intervalo entre as posições A e B. Por exemplo, para S = “abcd”, A = 2 e B = 4, após a operação, S = “adcb”.\n\n4 A C: Adicionar um caractere C antes o caractere da posição A. Por exemplo, para S = “abcd”, A = 2 e C = ‘z’, após a operação, S = “azbcd”.","id":"2186","category":"Estruturas e Bibliotecas","statistics":{"level":"10 / 10","submissions":339,"solved":42,"ratio":"12.39%"}}