{"output":"For each test case, display its case number followed by the largest number of dollars that ACM can have at the end of day D + 1.\n\n\t\t\t\t\tFollow the format of the sample output.","input":"The input consists of several test cases. Each test case starts with a line containing three positive integers N, C, and D. N is the number of machines for sale (N ≤ 105 ), C is the number of dollars with which the company begins the restructuring (C ≤ 109 ), and D is the number of days that the restructuring lasts (D ≤ 109 ).\n\n\t\t\t\t\tEach of the next N lines describes a single machine for sale. Each line contains four integers Di , Pi , Ri and Gi , denoting (respectively) the day on which the machine is for sale, the dollar price for which it may be bought, the dollar price for which it may be resold and the daily profit generated by operating the machine. These numbers satisfy 1 ≤ Di ≤ D, 1 ≤ Ri < Pi ≤ 109 and 1 ≤ Gi ≤ 109.\n\n\t\t\t\t\tThe last test case is followed by a line containing three zeros.","level":1,"name":"Machine Works","has_images":false,"description":"You are the director of Arbitrarily Complex Machines (ACM for short), a company producing advanced machinery using even more advanced machinery. The old production machinery has broken down, so you need to buy new production machines for the company. Your goal is to make as much money as possible during the restructuring period. During this period you will be able to buy and sell machines and operate them for profit while ACM owns them. Due to space restrictions, ACM can own at most one machine at a time.\n\n\t\t\t\t\tDuring the restructuring period, there will be several machines for sale. Being an expert in the advanced machines market, you already know the price Pi and the availability day Di for each machines Mi. Note that if you do not buy machine Mi on day Di, then somebody else will buy it and it will not be available later. Needless to say, you cannot buy a machine if ACM has less money than the price of the machine.\n\n\t\t\t\t\tIf you buy a machine Mi on day Di , then ACM can operate it starting on day Di + 1. Each day that the machine operates, it produces a profit of Gi dollars for the company.\n\n\t\t\t\t\tYou may decide to sell a machine to reclaim a part of its purchase price any day after you’ve bought it. Each machine has a resale price Ri for which it may be resold to the market. You cannot operate a machine on the day that you sell it, but you may sell a machine and use the proceeds to buy a new machine on the same day.\n\n\t\t\t\t\tOnce the restructuring period ends, ACM will sell any machine that it still owns. Your task is to maximize the amount of money that ACM makes during the restructuring.","id":"2197","category":"Ad-Hoc","statistics":{"level":"1 / 10","submissions":4,"solved":4,"ratio":"100.00%"}}