{"output":"Para cada instância na entrada, imprima uma única linha contendo o\n            maior valor inteiro i, tal que Bi é subsequência\n            de A. Caso B não seja subsequencia de A, imprima 0 (zero).","input":"A entrada é composta por\n            diversas instâncias. A primeira linha da entrada contém um inteiro T\n            indicando o número de instâncias.\n\n          Cada instância é composta de duas linhas. A primeira linha\n            de cada instância contêm uma sequência de letras que\n            representa A (|A| ≤ 105) e a segunda linha\n            ontêm uma sequência de letras que representa B (|B| ≤ 104).","level":8,"name":"Ajudando Gust-Avô","has_images":false,"description":"K-rina é uma jovem mestre pokemon que gosta de ajudar pokemons\n          anciãos. Em uma de suas últimas caçadas, ela capiturou um velho,\n          dislexo e gago pokemon escritor, chamado Gust-Avô. Por causa de\n          sua gagueira e dislexia, Gust-Avô quando escreve uma palavra, as\n          vezes repete letras e/ou adiciona caracteres não pertencentes a \n          palavra que deseja escrever. K-rina quer ajudá-lo interpretando\n          seus textos. Para isso precisa resolver o problema descrito abaixo.\n\n        Dados, A e B duas sequências de letras, nós dizemos\n          que B é uma\n          subsequência de A se nós podemos encontrar todas as\n          letras de B em A, na mesma ordem em que elas aparecem em B, não\n          necessariamente adjacentes. Por exemplo, abc é subsequência de\n            xaywbzc, enquanto xyz não é subsequência de xabzcy.\n\n          Dado uma sequência B, nós definimos Bi como sendo\n            uma sequência onde cada caractere de B aparece i\n            vezes. Por exemplo, se B=xyzzx, então\n            B3=xxxyyyzzzzzzxxx.\n\n          Para ajudar K-rina e Gust-Avô, sua tarefa é, dado duas sequências\n            A e B, encontrar o maior valor i, tal que\n            Bi é uma subsequência de A.","id":"2220","category":"Paradigmas","statistics":{"level":"8 / 10","submissions":649,"solved":172,"ratio":"26.50%"}}