{"output":"Para cada caso de teste seu programa deve imprimir uma linha contendo o numero de pacotes que não poderão ser comercializados","input":"A entrada é composta de diversos casos de teste. Cada caso de teste começa com uma linha com os inteiros N (0 ≤ N ≤ 1018 ) que representa o código do ultimo pacote produzido. A linha seguinte contem um inteiro M ( 0 ≤ M ≤ 5000 ) que representa a quantidade de números tidos como mal agouro, segue então M inteiros Ci ( 0 ≤ Ci ≤ 1018 ) representando o i-ésimo numero que não pode aparecer em qualquer código. O final da entrada é representado pelo caso onde N = 0 e não deve ser processado.","level":10,"name":"Fabrica de Balões","has_images":false,"description":"Dâmião acabou de ser contratado como gerente da linha de produção de uma fabrica que produz os balões comercializados em Nlogonia. Dâmião quer mostrar serviço, e para isso aumentou e muito a produção da fabrica. Os balões produzidos por tal fabrica são empacotados e cada pacote recebe um código de identificação de até 18 dígitos, no processo de otimização da produção Dâmião fez com que o código do primeiro pacote fosse o numero 0, e para cada pacote produzido a partir de então, seu código seria o valor do ultimo pacote somado de uma unidade. Porém um imprevisto aconteceu, Dâmião não é natural da Nlogonia, por tanto não conhecia as superstições locais, e somente depois que vários pacotes foram produzidos foi alertado de que existem alguns números que são tidos com mal agouro para os habitantes de Nlogonia, e por este motivo nenhum pacote em que o numero aparece em seu código pode ser comercializado, independente do numero ser todo o código do produto ou apenas uma sub string do mesmo. Por exemplo, supondo que o numero 13 é tido como mal agouro, e ultimo pacote produzido foi o de código 130, somente os pacotes 13 e 130 não podem ser comercializados. Agora Dâmião quer saber o prejuízo que ele causou a empresa, e para isso ele precisa de sua ajuda","id":"2226","category":"Paradigmas","statistics":{"level":"10 / 10","submissions":283,"solved":46,"ratio":"16.25%"}}