{"output":"Seu programa deve produzir uma única linha na saída contendo três inteiros positivos, em hexadecimal com letras minúsculas, representando o total mínimo, o total máximo e o somatório dos totais considerando todas as permutações possíveis dos 16 dígitos hexadecimais.","input":"A primeira linha da entrada contém um inteiro N, 1 ≤ N ≤ 3f, representando o tamanho da sequência. As N linhas seguintes contêm, cada uma, um inteiro positivo P, 0 ≤ P ≤ fffffffff, definindo a sequência inicial S de inteiros. Todos os números na entrada estão em hexadecimal, com letras minúsculas.","level":8,"name":"Estatística Hexa","has_images":false,"description":"Dada uma sequência de inteiros positivos em hexadecimal, por exemplo, S = [9af47c0b, 2545557, ff6447979], definimos soma(S) como sendo a soma de todos os elementos de S. Considere agora uma certa permutação dos 16 dígitos hexadecimais, por exemplo, p = [4, 9, 5, a, 0, c, f, 3, d, 7, 8, b, 1, 2, 6, e]. A partir da sequência base S, podemos definir uma sequência transformada S[4] , que é obtida pela remoção de todas as ocorrêcias do dígito hexadecimal 4 de todos os inteiros em S, S[4] = [9af7c0b, 255557, ff67979]. Em seguida, podemos remover o dígito 9 e obter S[4,9] = [af7c0b, 255557, ff677]. Seguindo a ordem dos dígitos na permutação p, podemos definir dessa forma 16 sequências: S[4] , S[4,9] , S[4,9,5] ,...,S[4,9,5,a,0,c,f,3,d,7,8,b,1,2,6,e] . Estamos interessados em somar todos os elementos dessas 16 sequências:\n\ntotal(S, p) = soma(S[4]) + soma(S[4,9]) + soma(S[4,9,5]) + ··· + soma(S[4,9,5,a,0,c,f,3,d,7,8,b,1,2,6,e])\n\nClaramente, esse total depende da permutação p usada na remoção sucessiva. Dada uma sequência de N inteiros positivos em hexadecimal, seu programa deve computar, considerando todas as possíveis permutações dos 16 dígitos hexadecimais: o total mínimo, o total máximo e o somatório dos totais de todas as permutações. Para o somatório dos totais de todas as permutações, imprima o resultado módulo 3b9aca07 (109 + 7 na base 10).","id":"2239","category":"Estruturas e Bibliotecas","statistics":{"level":"8 / 10","submissions":324,"solved":107,"ratio":"33.02%"}}