{"output":"Seu programa deve imprimir, na saída padrão, uma única linha, contendo o número de vezes que Marlene terá que descartar as cartas durante o jogo.","input":"A entrada contém um único conjunto de testes, que deve ser lido do dispositivo de entrada padrão (normalmente o teclado). A primeira linha da entrada contém um inteiro N que indica quantas cartas existem no baralho (1 ≤ N ≤ 100000). A segunda linha contém N inteiros, representando as cartas do baralho, na sequência em que serão tiradas por Marlene da pilha Compras.","level":10,"name":"Jogo de Cartas","has_images":true,"description":"Marlene está jogando um passatempo de sua autoria. Ela possui um baralho com N cartas, numeradas de 1 a N, tal que não existem duas cartas com o mesmo número. O jogo consiste de várias rodadas, e são utilizadas três pilhas denominadas Compra, Descarte e Morto. Inicialmente, as cartas são embaralhadas e colocadas com a face para cima, constituindo a pilha Compra (as pilhas Descarte e Morto est˜ao inicialmente vazias). Marlene então tira as cartas da pilha Compra, uma a uma, e as coloca na pilha Descarte, com as faces para baixo, na mesma ordem, até encontrar a carta com o número 1. Quando a encontra, Marlene a coloca na pilha Morto e recomeça o processo de retirar cartas da pilha Compra, agora procurando a próxima carta na sequência (2), e o processo é repetido para as outras cartas na sequência (3, 4, ...).\r\n\r\n\t\t\t\t\tQuando as cartas da pilha Compra terminam, encerra-se uma rodada. Nesse momento, Marlene vira a pilha Descarte de modo que as cartas fiquem com a face para cima (sem reembaralhar) e a coloca no lugar da pilha Compra. Inicia-se uma nova rodada, e processo recomeça, com Marlene procurando a próxima carta na sequência.\r\n\r\n\t\t\t\t\tRepete-se esse processo até que a carta removida do baralho seja a de número N, quando o jogo acaba. O resultado do jogo é o número de rodadas.\r\n\r\n\t\t\t\t\t\r\n\r\n\t\t\t\t\tEscreva um programa que, dada a ordem em que as cartas estÃo na pilha Compra no inÍcio do jogo, determine o resultado do jogo (ou seja, o número de rodadas).","id":"2307","category":"Ad-Hoc","statistics":{"level":"10 / 10","submissions":547,"solved":70,"ratio":"12.80%"}}