{"output":"A saída deverá seguir a indentação (feita com quatro pontos \"....\",representando uma tabulação a direita) segundo os padrões de Nishi, o último ‘}’ de todo bloco é finalizado com uma quebra de linha, conforme o modelo abaixo.","input":"A entrada contém várias linhas e termina com EOF. Cada linha poderá ter até 2000 caracteres (0 < C < 2000). As entradas obedecem aos padrões exigidos por Nishi, como citados anteriormente","level":8,"name":"Indentador","has_images":true,"description":"Nishi é um aluno do 1º semestre de uma faculdade na área de computação, um amante da linguagem C e possui a certa mania de programar tudo em uma só linha de código. Lúcius, seu professor, manda quinzenalmente um EP (Exercício projeto) e desconta 10% da nota a cada indentação errada. Com medo da reprovação na matéria de LP(Linguagem de Programação), Nishi pediu a sua ajuda com um programa que indente o código automaticamente, já que ele tem que montar seu EP e não terá tempo de fazer um programa para indentar o seu próprio código.\n\n\n\nNishi possui certos padrões na hora de programar: \n\n- A sintaxe utilizada será baseada na linguagem C;\n\n- As “bibliotecas” e “defines” são postas normalmente, com uma quebra de linha;\n\nExemplo:\n\n#include<stdio.h>\n\n#define MAX 1000001\n\n- Fora as bibliotecas e defines, o restante do código se encontra em apenas uma linha;\n\nExemplo:\n\n#include<stdio.h>\n\nint main(void){printf(“Hello World\\n”);return 0;}\n\n- Ele utiliza somente os comandos de operações aprendidos até o momento (if,else,for,while,switch), funções, defines, printf, scanf, ;\n\n- Não é usada nenhuma variável com nomes semelhantes a comandos;\n\n- É garantida a presença de ‘;’ somente no comando “for” e nos finais de comandos, conforme a sintaxe da linguagem C;\n\nExemplo de comando que não será utilizado:\n\nprintf(“;”);\n\nExemplo de comando válido:\n\n for(i=0;i<10;i++){printf(“Hello World”);}\n\n- Não será utilizado operadores ternários, considere somente os comandos citados anteriormente;\n\nOs padrões de indentação:\n\n- Todo comando (if,else,for,while,switch) é iniciado com ‘{‘ na linha seguinte, e finalizado com ‘}’ na linha seguinte, mesmo se tiver uma única instrução; (Note que existe uma quebra de linha após o ‘}’)\n\nExemplo:\n\nif(1)\n\n{\n\n....printf(“Hello World\\n”);\n\n}\n\n- Todo conteúdo dentro das chaves de abertura e de fechamento deverá ter uma tabulação a direita, a regra vale para as sub-chaves também;","id":"2314","category":"Strings","statistics":{"level":"8 / 10","submissions":396,"solved":71,"ratio":"17.93%"}}