{"output":"Para cada caso de teste, imprima a maior medida inteira do menor ângulo interno do triângulo retângulo, respeitando as condições acima. Se o triângulo do ângulo em questão não existir, imprima a mensagem “Nao existe tal triangulo.”.","input":"A entrada é composta de vários casos de teste. Cada caso corresponde a uma linha que contém os valores dos lados dos quadrados interno e externo, L1 e L2 (1 <= L1, L2 <= 105), não necessariamente nesta ordem.","level":9,"name":"O Desafio de Arquibaldo","has_images":true,"description":"Arquibaldo é um menino muito inteligente conhecido por ser o “bam-bam-bam” das questões matemáticas relacionadas a figuras geométricas. Cálculo de áreas, perímetros, medidas de lados, Arquibaldo já estava cansado de pequenos desafios. Para ele, era tudo muito fácil. Sua tia Helena, no entanto, sendo professora de matemática, resolveu passar um desafio ao seu sobrinho, um pouco acima dos com que ele estava acostumado a lidar. Helena lhe mostrou quatro triângulos retângulos idênticos e formou com eles um quadrado tal que seus lados eram as medidas das hipotenusas dos triângulos escolhidos. Então ela disse ao sobrinho que dependendo das medidas dos triângulos retângulos, pode ou não haver um segundo quadrado menor no centro do maior. As ilustrações abaixo mostram com clareza estes casos:\n\n                                      \n\nEla então o desafiou: “Se eu te der os lados dos quadrados interno e externo, l1 e l2, por exemplo, você consegue me dizer qual a medida, em graus, do menor ângulo interno do triângulo retângulo que formaria com outros três triângulos idênticos um quadrado de lado l1 e outro de lado l2?”. Arquibaldo, começou a tentar resolver o desafio. Como ele não poderia usar calculadora, sua tia foi boazinha e permitiu que apenas a resposta inteira fosse apresentada, ou seja, sem casas decimais. Assim, Arquibaldo teria agora que encontrar a maior medida inteira do menor ângulo do triângulo retângulo tal que o lado do\nquadrado interno formado por esse novo triângulo (com medidas de ângulos internos inteiras) seja maior ou igual ao lado do quadrado interno dado, ou seja, este deveria “caber” no novo quadrado interno. Por exemplo: se os lados dos quadrados interno e externo tiverem medidas 1 e 5, respectivamente, então, o menor ângulo terá medida aproximada de 36,87º, porém, a maior medida inteira é 36º, pois um conjunto de quatro triângulos retângulos de angulação 36º e 54º(complemento) formam quadrados de lado 5 e 1,10 unidades de medida, ou seja, o quadrado fornecido de lado 1 “caberia” em um quadrado de lado 1,10, com esta angulação.\n“Atente também para a existência do triângulo! Lembre-se: agora as medidas dos ângulos só podem ser inteiras!”, alertou Helena a Arquibaldo para possíveis erros porque ela é brother. No exemplo acima, o triângulo existe, pois tem ângulos de 36º, 54º e 90º. Sabendo, que você é um programador (não foi informado à Helena se você era bom ou não), Helena pediu a você que faça um programa que informe o gabarito dos valores fornecidos por ela ao seu sobrinho, para saber se ele realmente soube resolver o desafio.","id":"2335","category":"Matemática","statistics":{"level":"9 / 10","submissions":371,"solved":76,"ratio":"20.49%"}}