{"output":"Uma string por linha para cada caso teste que representa o DNA da bactéria final. Caso haja mais de uma solução, imprima a menor lexicograficamente.","input":"A entrada é composta por diversos casos teste. Cada caso contém uma linha com o número N que representa a quantidade de bactérias (1 ≤ N ≤ 20). Em seguida N linhas contendo uma string Si (1 ≤ |Si| ≤ 10000) que representa o código genético de cada bactéria. A N+2 linha contém uma string R (1 ≤ |R| ≤ 1000) que é o RNA do vírus infeccioso. Todas as strings são compostas apenas pelos caracteres: A, C, G, T.","level":10,"name":"Bactéria II","has_images":false,"description":"Recentemente contratado pelo ICPC (Instituto Computacional de Pesquisas Científicas), Doutor Henrique está precisando de sua ajuda novamente! Chefiando um projeto super secreto para o Reino de Sildávia, Dr. Henrique enfrenta um grande problema. As bactérias envolvidas no projeto estão sendo destruídas após serem contaminadas por um tipo de vírus muito raro. Este vírus é capaz de destruir qualquer trecho de código genético das bactérias que seja igual ao seu RNA (código genético do vírus). Sabendo disso, Dr. Henrique quer criar um tipo de bactéria que seja resistente a este tipo de vírus, porém, quer preservar a maior quantidade de código genético das bactérias originais.\n\nO seu objetivo é encontrar a maior substring genética (contém apenas as proteínas A, C, G, T) entre um grupo de bactérias contaminadas. Acompanhemos um exemplo:\n\nSuponhamos que o RNA do vírus é a sequência TCGA. E supomos também que Dr. Henrique possua 3 bactérias de DNA's:\n\n\tBactéria 1: GCTTTCGACGAT\n\tBactéria 2: GATCGAGCTTCGAA\n\tBactéria 3: GGTCTAGCTAAT\n\n\nApós a infecção, o vírus irá procurar o primeiro trecho de código a partir do início do DNA da bactéria que seja igual ao seu RNA e irá destruí-lo. E irá repetir o processo até que não haja mais código para ser destruído.\n\n\n\tBactéria 1: GCTTTCGACGAT ⇒ GCTTCGAT ⇒ GCTT\n\tBactéria 2: GATCGAGCTTCGAA ⇒ GAGCTTCGAA ⇒ GAGCTA\n\tBactéria 3: GGTCTAGCTAAT\n\n\nAgora que todas as bactérias estão infectadas, iremos encontrar a maior substring comum a todas, que será o DNA da bactéria que Dr. Henrique tanto procura:\n\n\n\tBactéria 1: GCTT\n\tBactéria 3: GAGCTA\n\tBactéria 3: GGTCTAGCTAAT\n\n\nDNA resultante: GCT\n\nObservações\n\nÉ importante ressaltar que o vírus sempre avalia o DNA da bactéria infectada a partir do início. Sempre haverá pelo menos uma resposta.","id":"2358","category":"Strings","statistics":{"level":"10 / 10","submissions":534,"solved":42,"ratio":"7.87%"}}