{"output":"Para cada caso de teste, imprima uma linha contendo uma sequência de N inteiros separados por espaço. Essa sequência deve representar a numeração do componente mais a direita que faz com que a resposta do problema criado seja K. Caso existam várias soluções possíveis, imprima a menor lexicograficamente.","input":"A entrada contém dois inteiros, N e K (1 ≤ K ≤ N ≤ 106), indicando o número de pinos e a resposta desejada. O final da entrada é indicado por N=K=0.","level":7,"name":"Entradas e Saídas","has_images":true,"description":"Alexandre, Dilson, Filipe e Lucas precisavam elaborar questões para a Seletiva da UFMG para a Maratona de 2014 e pensaram no seguinte problema.\n\nLuiz é o mais novo estagiário de uma empresa que desenvolve equipamentos eletrônicos. Uma de suas primeiras tarefas é ligar os pinos de dois componentes, usando ligações em linha reta. Cada um dos dois compoentes possui N pinos, numerados de 1 a N. Os pinos de mesmo número devem ser ligados por uma linha reta. A figura abaixo mostra um exemplo.\n\n\n\n\n\n\n\nOs pinos do componente a esquerda sempre são numerados de cima para baixo. Infelizmente, o mesmo não acontece com os pinos do componente da direita e é necessário que ligações se cruzem. Luiz precisa computar qual é a maior quantidade de ligações que podem ser feitas, de forma que duas ligações não se cruzem, que é 3 no exemplo. Luiz não sabe programar e pediu a sua ajuda para realizar essa tarefa. A entrada consiste no número de pinos, N, e na sequência de numeração dos pinos do segundo componente.\n\nOs ilustríssimos criadores desse problema andam muito ocupados ultimamente e não tiveram tempo de gerar casos de teste. Por isso, sua tarefa é gerar casos de teste com N pinos em que a resposta do problema seja K. Assim, na próxima seletiva, seu gerador de casos de teste pode ser usado e o problema poderá ser utilizado.","id":"2361","category":"Paradigmas","statistics":{"level":"7 / 10","submissions":679,"solved":226,"ratio":"33.28%"}}