{"output":"Para cada caso de teste, imprima um inteiro indicando o maior número de alienígenas que podem ser destruídos por um único disparo, sem que nenhum ser humano seja destruído.","input":"A entrada contém vários casos de teste. Cada caso de teste começa com uma linha contendo dois inteiros, N e M (1 ≤ N, M ≤ 100), descrevendo o número de alienígenas e de humanos, respectivamente. Cada uma das N linhas seguintes contém dois inteiros, Xi e Yi (-106 ≤ Xi, Yi ≤ 106), representado as coordenadas de um dos alienígenas. Da mesma forma, cada uma das M linhas seguintes contém dois inteiros, Xi e Yi (-106 ≤ Xi, Yi ≤ 106), representado as coodenadas de um dos seres humanos. Mesmo se tratando de alienígenas, é claro que dois indivíduos não podem ocupar o mesmo lugar. O final da entada é indicado por N=M=0.","level":10,"name":"Invasão Alienígena","has_images":false,"description":"Os alienígenas invadiram a terra e vão aniquilar a raça humana, a não ser que você consiga detê-los. Recentemente, o S.B.C. (Sistema Brasileiro de Combate) foi equipado com uma arma laser muito poderosa, que será usada para destruir os inimigos alienígenas. Essa arma é poderosa a ponto de poder destruir tudo dentro de qualquer região circular. Felizmente, é possível controlar milimétricamente os disparos dessa arma, de forma que é possível escolher o centro e o raio da região circular que será destruída.\n\nIsso mesmo, é possível realizar um disparo com raio de destruição grande o suficiente para destruir todos os alienígenas. Infelizmente, não é tão simples assim. Ao fazer isso, é possível que toda a humanidade também seja destruída. Decidiu-se, então, que nenhuma vida humana deveria ser tirada por essa arma laser. É claro que ainda queremos destruir os inimigos alienígenas, oras. Por isso, você foi contratado pela S.B.C.. Seu trabalho é determinar qual é o maior número de alienígenas que podem ser destruídos por um único disparo da arma laser, de forma que nenhum ser humano seja destruído.\n\nObservações\n\nIndivíduos na borda da região de destruição da arma laser também são destruídos. É improvável que meio ser humano consiga sobreviver. Esperamos que seja assim com alienígenas também.","id":"2362","category":"Geometria Computacional","statistics":{"level":"10 / 10","submissions":95,"solved":1,"ratio":"1.05%"}}