{"output":"A saida é descrita em P linhas. Cada linha deve conter uma string Si indicando o nome do jogador e um inteiro Ki, indicando quantos pontos o jogador i marcou, separados por um espaço. Essas linhas devem estar ordenadas de acordo com os valores Ki e o critério de desempate.","input":"Existem múltiplos casos de teste. A primeira linha de cada caso de teste  é composta por 2 inteiros P (1 ≤ P ≤ 10) e N (1 ≤ N ≤ 10) indicando, respectivamente, o número de participantes do bolão e o número de partidas disputadas. As linhas seguintes descreverão os palpites dos participantes.\n\nOs palpites do i-ésimo participante serão descritos em N+1 linhas. A primeira linha possui apenas uma string Si, que é o nome do participante i. As N linhas seguintes descrevem os palpites de cada partida j. Esses palpites são descritos por Aj GAi,j Bj GBi,j, onde Aj e Bj são strings indicando os times que irão se enfrentar na j-ésima partida, GAi,j e GBi,j ( 0 ≤ GAi,j , GBi,j ≤ 100 ) são inteiros  que representam, respectivamente, a quantidade de gols que o participante i espera que os times Aj e Bj marquem na partida j. Os participantes sempre palpitam seguindo a mesma ordem. Logo, Aj e Bj será o mesmo para todos os participantes.\n\nPor fim, existem N linhas que descrevem o resultado real das partidas. Cada linha possui Aj RAj Bj RBj, onde RAj e RBj ( 0 ≤ RAj , RBj ≤ 100 ) são inteiros  que representam a quantidade de gols marcados pelos times Aj e Bj nesta partida.\n\nA entrada termina quando P = N = 0.","level":5,"name":"Bolão do Brasileirão","has_images":false,"description":"Muitos irão dizer que é sorte, mas Dilson possui uma incrível habilidade em bolões de campeonatos de futebol. Sua última façanha foi ganhar o bolão da computação da Copa do Mundo acertando, inclusive, os surpreendentes placares de Brasil X Alemanha e Espanha X Holanda. Pensando em se tornar um profissional do bolão, ele pede a você para criar um programa que irá computar o ranking final de um bolão. \n\nEm um bolão, competidores palpitam em placares de partidas de futebol antes do início de um torneio. Após a realização de cada partida, são atribuídos pontos ao participantes de acordo com as seguintes regras:\n\n\n\t10 pontos - Se o participante acertou o resultado\\footnote{Por resultado compreende-se o time vencedor ou empate} e os gols marcados por cada time.\n\t7 pontos - Se o participante acertou o resultado e os gols marcados por um time.\n\t5 pontos - Se o participante acertou apenas resultado.\n\t2 pontos - Se o participante acertou os gols marcados por um time.\n\t0 pontos - Se o participante não acertou nada.\n\n\nAo final do torneio, o participante que tiver mais pontos é o campeão. Neste problema, você deve retornar o ranking final do bolão. A ordem lexicográfica do nome do participante é o único critério de desempate (mais uma vantagem para Dilson).","id":"2365","category":"Ad-Hoc","statistics":{"level":"5 / 10","submissions":155,"solved":79,"ratio":"50.97%"}}