{"output":"Seu programa deve imprimir, na saída padrão, uma sequência de números inteiros, um em cada linha, indicando a saída gerada pelo Faíska.","input":"A entrada contém um único conjunto de testes, que deve ser lido do dispositivo de entrada padrão (normalmente o teclado).\n\n\t\t\t\t\tA primeira linha da entrada contém dois números inteiros N e M, representando respectivamente o número palavras na memória (1 ≤ N ≤ 109) e o número de instruções do programa (1 ≤ M ≤ 1000). Cada uma das M linhas seguintes contém uma instrução do Faíska. Cada instrução é composta de um caratere descrevendo a instrução (‘I’ para inversão e ‘S’ para soma), seguido de um espaço, seguido de dois inteiros indicando os argumentos da instrução.\n\n\t\t\t\t\tInicialmente a configuração da memória é tal que cada palavra tem como conteúdo o seu próprio endereço. Em outras palavras, o conteúdo inicial da memória é [1,2,3,. . .,N]. Há pelo menos uma instrução soma em cada caso de teste.","level":10,"name":"Simulador","has_images":false,"description":"Um novo processador, denominado Faíska, está sendo desenvolvido para a empresa SBC. Este novo processador tem apenas duas instruções: inversão e soma, descritas a seguir.\n\n\t\t\t\t\t\n\t\t\t\t\t\tInversão: dados dois endereços de memória X e Y , a operação inverte(X,Y) inverte a posição de palavras da memória de forma que\n\t\t\t\t\t\n\n\t\t\t\t\t\n\t\t\t\t\t\ta palavra no endereço X troca de posição com a palavra de memória da posição Y;\n\t\t\t\t\t\ta palavra no endereço X + 1 troca de posição com a palavra de memória da posição Y − 1;\n\t\t\t\t\t\ta palavra no endereço X + 2 troca de posição com a palavra de memória da posição Y − 2;\n\t\t\t\t\t\te assim por diante, até que X ≥ Y.\n\t\t\t\t\t\n\n\t\t\t\t\t\n\t\t\t\t\t\tSoma: dados dois endereços de memória X e Y, a operação soma(X,Y) imprime a soma das palavras de memória entre os endereços X e Y (inclusive).\n\t\t\t\t\t\n\n\t\t\t\t\tPor exemplo, se a memória contém inicialmente, a partir da primeira posição de memória (endereço igual a 1) os valores [1,2,3,4,5,6,7,8], a operação inverte(3,7) deixa a memória igual a [1,2,7,6,5,4,3,8]. Então, nesse estado, a execução de soma(1,3) produz a saída 10.\n\n\t\t\t\t\tSua tarefa é escever um programa que, dada uma sequência de instruções do Faíska, simule a execução e produza o mesmo resultado que o Faíska produziria.","id":"2368","category":"Ad-Hoc","statistics":{"level":"10 / 10","submissions":188,"solved":21,"ratio":"11.17%"}}