{"output":"Seu programa deve imprimir uma única linha contendo um único inteiro indicando o número de disposições iniciais que forçam Juquinha a perder na K-ésima rodada (ou ganhar o torneio, se K = N + 1). Como este número pode ser muito grande, imprima o resto que este número deixa quando dividido por 1.000.000.007 (109 + 7).","input":"A primeira linha contém dois inteiros N (1 ≤ N ≤ 16) e K(1 ≤ K ≤ N + 1). Cada uma das próximas 2N linhas seguintes contêm um único inteiro representando o coeficiente de habilidade de um jogador. O coeficiente de Juquinha é representado pelo primeiro desses inteiros.","level":7,"name":"Torneio","has_images":true,"description":"Juquinha foi convidado para participar do prestigiado torneio de tênis de Rolando Barros, na Nlogônia. O torneio é composto de N rodadas no estilo mata-mata: todo jogador que perde uma partida é eliminado do torneio, e o vencedor desta partida avança para a próxima rodada. Como o número de jogadores ativos cai pela metade a cada rodada, é necessário que o número de jogadores participantes seja uma potência de 2.\n\n\t\t\t\t\t  \n\t\t\t\t\tOs jogadores são inicialmente dispostos na chave por sorteio. Em uma disposição é atribuido a cada jogador um valor de 1 a 2N , que corresponde a sua posição na chave do torneio. Jogadores vencedores avançam para a direita da chave, e disputam com o vencedor da sub-chave vizinha. Na imagem acima, caso os jogadores das posições 1 e 3 vençam suas partidas na primeira rodada, estes se enfrentarão na segunda rodada.\n\n\t\t\t\t\tJuquinha não quer perder a chance de tornar-se um jogador mundialmente famoso, e para isso contratou você para ajudá-lo em suas análises estatísticas. Ele atribuiu a cada jogador um coeficiente de habilidade Hi (0 ≤ Hi ≤ 109), e sabe que se dois jogadores disputarem uma partida, aquele com maior coeficiente de habilidade certamente será o vencedor. Seu papel é calcular quantas disposições iniciais dos jogadores forçam Juquinha perder na K-ésima rodada (ou vencer o torneio, caso K = N + 1). Duas disposições são consideradas distintas se para algum jogador foi atribuido um valor diferente nas duas disposições.","id":"2447","category":"Ad-Hoc","statistics":{"level":"7 / 10","submissions":48,"solved":20,"ratio":"41.67%"}}