{"output":"Seu programa deve produzir uma única linha contendo um único inteiro, a quantidade máxima de comida que o Pacman pode levar para casa.","input":"A primeira linha contém um inteiro N (2 ≤ N ≤ 100), o tamanho do tabuleiro do jogo, que é quadrado. Cada uma das N linhas seguintes contém N caracteres, que podem ser (aspas para melhor clareza):\r\n\r\n\t\t\t\t\t\r\n\t\t\t\t\t\t‘.’ um espaço vazio;\r\n\t\t\t\t\t\t‘o’ uma comida;\r\n\t\t\t\t\t\t‘A’ um fantasma.\r\n\t\t\t\t\t\n\n\t\t\t\t\tNão há um fantasma e uma comida na mesma posição.\n\t\t\t\t\tNão há fantasma nem comida na posição inicial do Pacman (ou seja, o primeiro caractere da primeira linha do tabuleiro é ‘.’).","level":2,"name":"PacMan","has_images":false,"description":"Pacman é um jogo muito conhecido, onde o personagem tenta comer a maior quantidade possível de bolinhas, tendo ao mesmo tempo que fugir de vários fantasmas. Dessa vez, nosso personagem quer carregar a comida coletada para casa, mas o encontro com um fantasma, ao invés de terminar o jogo, faz com que toda a comida coletada seja roubada.\r\n\r\n\t\t\t\t\tNeste problema os fantasmas não se movem, e o jogador sempre faz o Pacman percorrer o seguinte caminho:\r\n\r\n\t\t\t\t\t\r\n\t\t\t\t\t\tO Pacman começa no canto superior esquerdo do tabuleiro.\r\n\t\t\t\t\t\tO Pacman percorre toda a linha, da esquerda para direita, até chegar ao lado direito do tabuleiro.\r\n\t\t\t\t\t\tO jogador desce uma posição, e percorre toda a linha, desta vez da direita para a esquerda.\r\n\t\t\t\t\t\tAs etapas 2 e 3 se repetem até que todo o tabuleiro tenha sido percorrido.\r\n\t\t\t\t\t\r\n\r\n\t\t\t\t\tInfelizmente, Pacman não pode ignorar os comandos do usuário para fugir dos fantasmas ou pegar mais comida, mas ele pode, a qualquer momento, se aproveitar de um bug de implementação e interromper o jogo, levando consigo toda a comida que estiver carregando.\r\n\r\n\t\t\t\t\tVocê deve escrever um programa que determine a maior quantidade de comida que o Pacman pode levar, se escolher a melhor hora possível para sair. Note que o jogador também tem a opção de não sair antes do final do jogo.","id":"2451","category":"Ad-Hoc","statistics":{"level":"2 / 10","submissions":880,"solved":528,"ratio":"60.00%"}}