{"output":"A saída consiste de uma linha, informando a duração do voo em minutos e quantas horas B está à frente de A, em termos de fusos horários. Os dois valores devem ser separados por um espaço em branco.","input":"A entrada é composta de apenas uma linha, com 4 horários, separados por um espaço em branco. Esses horários envolvem voos entre duas cidades, A e B e são, respectivamente, pA, cB, pB e cA. O horário pA indica a hora da partida de um voo de A para B, hora local de A. O horário cB indica a hora de chegada do mesmo voo na cidade B, hora local de B. O horário pB é a hora de partidado voo de volta, de B para A, hora local de B. O horário cA é a hora de chegada do voo de volta, hora local de A.","level":9,"name":"Voo","has_images":false,"description":"João estava navegando na internet, olhando horários de voos de várias companhias aéreas entre diferentes cidades, e notou que em alguns casos voos diretos entre duas cidades tinham tempos diferentes, dependendo se eram voos de ida ou de volta.\r\n\r\nA única explicação possível era a de voos ligando cidades localizadas em diferentes fusos horários. João então chegou à conclusão que seria possível determinar a diferença entre os fusos horários, com base apenas nos horários fornecidos pelas companhias aéreas.\r\n\r\nPor exemplo, um voo sai da Haquérnia às 10:00 horas e chega na Nerdínia às 22:00 horas, ao passo que outro voo sai da Nerdínia às 10:00 horas e chega na Haquérnia às 18:00 horas. Qual a explicação? Note que ambos os voos utilizam aeronaves idênticas, na mesma rota, um de ida, outro de volta. Na realidade, o voo dura 10 horas e Nerdínia fica em um fuso horário +2 horas à frentedo fuso horário da Haquérnia (portanto o fuso horário de Haquérnia fica −2 horas à frente do fuso horário de Nerdínia).\r\n\r\nJoão anotou então a tabela de horários de várias companhias aéreas, porém cometeu um engano. Esqueceu-se de anotar datas de partida e chegada. Por exemplo, se a partida de um voo é às 18:00 e a chegada é às 14:00, João não sabe dizer se a data de chegada é a seguinte à da partida, em voo que dura 20 horas, entre cidades no mesmo fuso horário, ou se a data de chegada é a mesma da de partida, com uma duração de voo de uma hora, em que a cidade destino está em fuso horário com cinco horas a menos do fuso horário da cidade origem.\r\n\r\nSua tarefa é ajudar João a determinar a duração do voo e a diferença entre os fusos horários de chegada e de partida de cada par de voos da tabela, um de ida outro de volta, mesmo sem saber as datas dos voos.","id":"2462","category":"Ad-Hoc","statistics":{"level":"9 / 10","submissions":778,"solved":133,"ratio":"17.10%"}}