{"output":"Para cada pergunta de Noel, você deverá imprimir a quantidade distinta de presentes que serão entregues.","input":"A primeira linha contêm dois inteiros N e M (2 ≤ N ≤ 10⁵, 1 ≤ M ≤ 10⁵), indicando respectivamente o total de casas e o total de perguntas que Noel irá fazer.\n\nNa próxima linha terá a descrição de cada presente que será entregue nas casas. Cada presente será uma palavra com letras minúsculas contendo no máximo 20 caracteres. O presente na posição i, indica o que a criança na casa i deseja ganhar.\n\nSegue então N - 1 linhas, contendo dois inteiros A e B (1 ≤ A, B ≤ N, A != B), indicando que existe uma ligação entre as casas A e B.\n\nM linhas seguem com dois inteiros A e B, representando a pergunta de Noel.","level":10,"name":"Entregas do Noel","has_images":false,"description":"Por incrível que pareça, Papai Noel ainda não começou a fabricar os presentes que serão entregues no natal. Para ele não se atrasar foi bolado um plano para agilizar as entregas e a fabricação.\n\nO plano de Noel consiste em escolher duas crianças (A e B), para serem as primeiras a receberem os presentes, mas o que ele reparou é que no caminho entre a casa da criança A até a casa da criança B, ele acabará passando por outras crianças que também enviaram suas cartinhas com o que gostariam de ganhar. Portanto Noel decidiu que irá entregar todos os presentes das crianças que estão entre as casas A e B em apenas uma viagem.\n\nA parte da entrega é muito simples para o Noel, mas ele precisa otimizar a compra de matérias-primas para a confecção de todos os presentes, e é aqui que você entra para o auxiliar.\n\nSerá dado a você o mapa com todas as casas onde ocorrerá entregas, que consiste em N casas, com N - 1 ligações, tendo exatamente um caminho entre cada uma delas, como Noel sempre viaja de trenó, todas as ligações podem ser usadas nos dois sentidos. Após isto Noel irá fazer diversas perguntas do tipo A B, e você deverá responder quantos presentes distintos ele terá que entregar no caminho entre a casa A e a casa B.","id":"2476","category":"Grafos","statistics":{"level":"10 / 10","submissions":404,"solved":108,"ratio":"26.73%"}}