{"output":"Para cada instância, seu programa deverá imprimir a mensagem \"Instance #H:\", onde H é o número da instância, sequencial e crescente (de 01 a 99). Em seguida imprimir o tamanho da unidade central, o caminho mínimo para chegar em todos os pontos de decoração e quantas luzes a cidade precisa. Se por acaso os fios não puderem alcançar todos os pontos de decoração o seu programa deverá imprimir a mensagem  \"Network Error\".  Seu programa deverá imprimir uma linha em branco entre duas instâncias consecutivas.","input":"A entrada consiste de várias instâncias. A primeira linha de cada instância contém dois inteiros N e  M (1 ≤ N, M ≤ 103), que correspondem ao número de linhas e colunas do mapa entregue por Jack. As N  linhas seguintes contém M  caracteres, definidos como ( . ), ( + ) ou ( # ), representando respectivamente a unidade central e seus pontos de decoração, um ponto válido a ser explorado e uma barreira que impede a passagem dos fios. A entrada termina com final de arquivo (EOF).","level":10,"name":"Rede de Distribuição","has_images":true,"description":"O Natal está chegando e como muitas pessoas ainda não enfeitaram suas casas, o chanceler Jack Redd está distribuindo as luzes vermelhas para as cidades-sede. Como são muitas luzes para distribuir, Jack entregou um mapa a você, que contém informações sobre a cidade, a unidade central, seus pontos de decoração e as ruas. observe a imagem.\n\n\t\t\t\t\t\t\n\n\t\t\t\t\t\n\t\t\t\t\tNa imagem, a unidade central recebe as luzes e envia para os pontos de decoração 1, 2, 3 e 4, respectivamente. Cada ponto de decoração precisa de uma certa quantidade de luzes que é medida pelo: tamanho do agrupamento de pontos ( . ) vezes a distância mínima deste agrupamento até a unidade central. É possível andar por um ponto de decoração se ele for maior que 1 e se por acaso os fios não conseguirem chegar em um ponto de decoração, a cidade não fará mais parte do show de Natal.\n\t\t\t\t\t\n\t\t\t\t\tUm ponto decorativo é formado por um grupo de pontos ( . ). É necessário chegar com os fios em todos os pontos de decoração, para que a festa seja grande e bonita. Um ponto decorativo pode passar fios para seus adjacentes.\n\t\t\t\t\tA unidade central é definida pelo maior agrupamento de pontos ( . ) do mapa. Jack revelou apenas para você, por questões de segurança. Como os fios já fazem parte da unidade central, preste atenção em que partes precisam mesmo de fios, mais precisamente onde tem ( + ) ou em seus pontos decorativos. Os fios podem ser encaminhados para as quatro direções (Norte, Sul, Leste e Oeste). Com base nestas informações, será que você pode distribuir as luzes para a festa?","id":"2477","category":"Grafos","statistics":{"level":"10 / 10","submissions":76,"solved":7,"ratio":"9.21%"}}