{"output":"Para caso de teste, caso seja possível Bino ganhar moedas na viagem, imprima a quantidade máxima de moedas que Bino pode ganhar, caso contrário, imprima a quantidade mínima que ele pode perder. Siga a grafia dos exemplos.","input":"A primeira linha da entrada contém um inteiro Q (1 ≤ Q ≤ 100) representando a quantidade de casos de teste. A primeira linha de cada caso de teste contém um inteiro N (1 ≤ N ≤ 105), representando a quantidade de cidades. Cada uma das próximas N linhas do caso de teste contém 2 inteiros Xi (1 ≤ Xi ≤ 107), e Ci (1 ≤ Ci ≤ 1010), representando a posição e o valor da comida na cidade i (1 ≤ i ≤ N), respectivamente.","level":9,"name":"É Uma Cilada Bino","has_images":false,"description":"Bino é um caminhoneiro, e foi encarregado para levar os presentes de natal para N cidades. As cidades são dispostas em uma linha, e Bino quer entregar os presentes o mais rápido possível. Bino inicia sua jornada na posição 0 e pretende visitar todas as N cidades.\n\nBino viaja com seu amigo Pedro, um duende enviado pelo Papai Noel para protegê-lo.\n\nCada cidade i possui uma posição Xi e um valor de comida Ci.\n\nNa visita de uma cidade, Bino pode optar por comprar comida para Pedro. Quando Bino opta por comprar comida para Pedro em uma cidade i, ele paga Ci moedas de ouro pela comida, porém Pedro passa a produzir Xi moedas por cada unidade de distância percorrida. Como forma agradecimento, Bino sempre paga a comida para Pedro na cidade N.\n\nPerceba que se Pedro já estiver produzindo K moedas de ouro, e Bino comprar comida em outra cidade i, Pedro vai começar a produzir Xi moedas de ouro, e não K+ Xi.\n\nBino quer saber qual a maior quantidade de moedas de ouro que pode conseguir durante a viajem da cidade 1 até a cidade N.\n\nÉ garantido que as cidades serão fornecidas na entrada por ordem crescente de posição. Também é garantido que não existem duas cidades situadas na mesma posição.","id":"2481","category":"Paradigmas","statistics":{"level":"9 / 10","submissions":420,"solved":95,"ratio":"22.62%"}}