{"output":"Para cada pergunta feita em cada caso de teste, imprima a maior distância percorrida pelo cavalo entre o ponto (x1, y1) e o ponto (x2, y2), com precisão de duas casas decimais.","input":"A primeira linha de entrada contém o número de pontos N (2 ≤ N ≤ 104) e o número de perguntas P (2 ≤ P ≤ 104). Cada linha das próximas N linhas irá conter um ponto (x, y), (0 ≤ x, y ≤ 104), representando o ponto em que o cavalo foi reconhecido, isto é, o ponto em que ele se encontra atualmente. Não serão dados dois pontos de reconhecimento iguais na entrada. Em seguida, cada linha das próximas P linhas irá conter dois pontos: (x1, y1) e (x2, y2), representando a pergunta da maior distância percorrida entre eles.","level":4,"name":"É Na Batida do Cavalo!","has_images":false,"description":"Furacão é um apostador famoso da região, mais conhecido por ganhar todas as apostas em corridas de cavalo nos últimos 10 anos. Há quem diga que é fraude, há quem diga que ele usa estratégias infalíveis para sempre vencer. De qualquer modo, é inegável que Furacão é um ótimo apostador. Porém, ele está cansado de tanto ganhar, e dessa forma, desafiou aquele que conseguir lançar uma aposta em que ele não consiga vencer. Pensando nisso, foi criado o Clube de Apostas para o Recomeço e para a Realização do Extermínio do Tal Apostador Furacão (C. A. R. R. E. T. A. Furacão) com o único propósito de fazer Furacão perder.\n\nA primeira \"corrida de cavalos\" promovida pelo CARRETA Furacão ocorrerá de forma muito diferente das corridas tradicionais: Haverá somente um cavalo, e este, ao invés de correr, deverá andar todo o percurso em marcha batida, afinal, esta \"corrida\" tem o objetivo de fazer com que o Apostador seja derrotado. Ela ocorrerá da seguinte forma: O cavalo iniciará sua marcha em determinado ponto, e cada vez que ele passar por um ponto de reconhecimento de percurso, será realizado o cálculo da distância entre o ponto atual e o ponto anterior, ou seja, ao final da marcha, haverá diversas distâncias isoladas, referentes somente a dois pontos.\n\nO desafio proposto ao Apostador é que ele responda a diversas perguntas do tipo \"Qual é a maior distância percorrida pelo cavalo do ponto (x1, y1) ao ponto (x2, y2)?\" em não mais do de 1 segundo! O CARRETA Furacão está certo de que ele irá perder desta vez, mas como Furacão é um homem muito esperto, ele atentou-se à possibilidade de contratar um programador para realizar essa atividade para ele, isto é, para criar um programa que ele possa usar no dia do evento para não perder a aposta.\n\nAo saber que você é um ótimo programador e que participa de atividades ilegais se receber bem por isso, Furacão o contratou sem pensar duas vezes. Sua tarefa, portanto, é escrever um programa que diga a maior distância percorrida pelo cavalo entre dois pontos dados. Tenha em mente que sempre haverá somente um caminho entre um ponto e outro.","id":"2488","category":"Estruturas e Bibliotecas","statistics":{"level":"4 / 10","submissions":91,"solved":59,"ratio":"64.84%"}}