{"output":"Para cada caso de teste, imprima o tempo mínimo necessário para que o Garoto Ixpertinho visite todos os quarteirões (com precisão de duas casas decimais), e na mesma linha, quantas vezes ele teve que abastecer, isto é, quantas vezes ele perdeu o fôlego durante seu trajeto entre um quarteirão e outro.","input":"A entrada contém diversos casos de teste. Cada caso de teste inicia com dois valores inteiros Q (2 ≤ Q ≤ 1000) e C (Q-1 ≤ C ≤ 1000) e um valor real T (1 ≤ T ≤ 30), indicando, respectivamente, o número de quarteirões, o número de caminhos que os conectam e o tempo máximo, em minutos, que o Garoto Ixpertinho consegue permanecer gritando e dançando ao mesmo tempo. Seguem C entradas de dois valores inteiros X e Y e um valor real Z (1 ≤ Z ≤ 60), especificando que ele leva Z minutos para ir do quarteirão X ao Y enquanto espalha a palavra Malakoi. Considere que sempre haverá pelo menos um caminho para alcançar um quarteirão. A entrada termina com Q = C = T = 0.","level":6,"name":"Garoto Ixpertinho","has_images":false,"description":"O Garoto Ixpertinho está de volta. Assim como antes, ele ainda quer que todos saibam o significado e a origem da palavra Malakoi, mas dessa vez, ele não está de brincadeira. O Garoto Ixpertinho quer espalhar essa palavra por toda a cidade, e sempre da forma usual, isto é, fazendo sua dança característica. No entanto, ele não terá fôlego o suficiente para andar todos os quarteirões enquanto grita e dança ao mesmo tempo.\n\nComo consequência, alguns quarteirões não poderão ser visitados e ele não conseguirá completar sua missão de vida. Pensando nisso, o Garoto Ixpertinho contatou alguns amigos e fãs em toda a cidade, para poder descansar, abastecer e assim continuar sua jornada, quando ele perder o fôlego no caminho entre um quarteirão e outro.\n\nAssim sendo, o Garoto Ixpertinho quer espalhar sua palavra para todas as pessoas da cidade, visitando todos os quarteirões, no menor tempo possível. Ele não se importa de visitar o mesmo quarteirão mais de uma vez, pois a partir da segunda visita, ele não precisará mais divulgar sua palavra, e o tempo não será somado ao tempo da jornada principal.\n\nAlém disso, toda vez que ele visita um quarteirão (tendo perdido o fôlego no meio do caminho ou não), ele descansa e obtém todo o fôlego novamente, mas esse tempo de descanso será desconsiderado. Por outro lado, quando ele perde o fôlego em seu trajeto entre um quarteirão e outro, ele leva exatamente 2 minutos para abastecer, e este tempo deverá ser considerado.","id":"2490","category":"Grafos","statistics":{"level":"6 / 10","submissions":305,"solved":113,"ratio":"37.05%"}}