{"output":"A saída consiste de uma linha por caso de teste contendo o código semanal de Levi.","input":"A entrada é composta de vários casos de testes. A primeira linha de um caso de teste contém dois números inteiros N (1 ≤ N ≤ 102) e M (1 ≤ M ≤ 105) representando respectivamente a quantidade de números escritos no quadro pelo professor Chico e o número escrito no cartão. A segunda linha contém N números primos Pi (2 ≤ Pi < 106) ordenados de forma crescente, onde Pi (1 ≤ i ≤ N) é um número escrito no quadro. A entrada termina quando N=M=0.","level":10,"name":"Fatores Permitidos","has_images":false,"description":"Professor Chico, suspeitando que Levi, seu aluno, não está estudando Programação dinâmica como deveria, resolveu tramar um plano para incentivar Levi a estudar mais.\r\n\r\nChico avisou aos seus alunos que agora eles seriam referenciados por códigos numéricos de no máximo 12 dígitos nas comunicações oficiais (e-mails e tarefas). E logo em seguida entregou a cada, um cartão que continha um único número escrito. Rapidamente os alunos presumiram que esse seria seu código, mas para surpresa dos alunos e desespero de Levi, professor chico explicou que esses não eram seus códigos.\r\n\r\nO código de um aluno era o termo de uma sequência ordenada S que estava na posição (indexada a partir de 1) especificada pelo número no cartão de cada um. Essa sequência tem uma característica especial: cada termo, quando decomposto em fatores primos, só pode ter números contidos em um conjunto de N elementos escritos no quadro pelo professor. E pra dificultar ainda mais a vida de Levi, esses números mudariam toda semana de tal forma que ele sempre terá de recalcular seu código se não quiser atrasar suas tarefas.\r\n\r\nSua tarefa é fazer um programa para ajudar Levi de tal modo que, dado os números primos escritos no quadro durante a semana pelo professor Chico e número no cartão, diga o seu código semanal.","id":"2501","category":"Paradigmas","statistics":{"level":"10 / 10","submissions":172,"solved":40,"ratio":"23.26%"}}