{"output":"Para cada caso de teste deverão ser fornecidos, em uma linha única, três palavras, separadas por um único espaço, de acordo com o biorritmo físico, emocional e intelectual, nesta ordem. Se o biorritmo específico estiver na fase positiva a palavra de saída será: \"POSITIVO\", se estiver na fase negativa: \"NEGATIVO\", ou se for um dia de biorritmo zerado: \"ZERADO\".","input":"A entrada contém vários casos de teste. Cada linha representa um caso de teste e contém uma data no formato D/M/AAAA (ano completo), uma data válida e anterior a 7/11/2016. A anterioridade não supera 100 anos.","level":6,"name":"Biorritmo","has_images":false,"description":"No início do século XX, o psicólogo vienense Hermann Swoboda e o médico alemão Wilhelm Fliess, perceberam que o ser humano possui ciclos favoráveis e desfavoráveis ao longo da vida. Estes ciclos estão associados a três estados humanos: físico, emocional e intelecto. Ao nascer todos os ciclos começam de forma crescente. E ao longo dos dias variam de forma senoidal entre um máximo e um mínimo.\r\n\r\n\r\n\tO biorritmo de natureza física tem ciclo de 23 dias.\r\n\tO biorritmo do estado emocional tem ciclo de 28 dias.\r\n\tO biorritmo da capacidade intelectual tem ciclo de 33 dias.\r\n\r\n\r\nO biorritmo, no período positivo indica uma fase favorável aos desafios físico, emocional ou intelectual. Por exemplo, quem estiver na fase positiva do biorritmo intelectual terá mais vantagens nesta competição que aqueles em uma fase negativa.\r\n\r\nNo dia 0 (nascimento) todos os biorritmos estão zerados. No dia 1 estão já na fase positiva. No dia 14, por exemplo, o biorritmo emocional estará zerado novamente, o físico já estará negativo e o de intelecto ainda positivo. E assim sucessivamente. A pergunta é, passados vários dias de vida, quais os estágios do biorritmo na data de hoje (7/11/2016)? A você foi pedido um programa que recebe como entrada a data de nascimento e diga, para os biorritmos: físico, emocional e intelectual (nesta ordem), se no dia 7/11/2016 estarão: positivo, negativo ou zerado.","id":"2504","category":"Ad-Hoc","statistics":{"level":"6 / 10","submissions":36,"solved":7,"ratio":"19.44%"}}