{"output":"Para cada caso de teste da entrada seu programa deve gerar em uma linha única a saída \"SIM\" se a expressão de formatação está construída como uma árvore binária, ou \"NAO\" (sem acentuação) caso contrário.","input":"A entrada consiste de vários casos de teste, cada caso de teste consiste de uma linha única com uma expressão de formatação do LATEX para a construção de uma árvore binária usando os comandos \\pstree{}{} e \\Tcircle{}. O tamanho máximo da expressão é de 1000 caracteres sem qualquer espaço em branco inserido. Como argumento do comando \\Tcircle{} temos sempre um único caracter no intervalo 'A' a 'Z'. Não existe redundância de chaves, somente as chaves de primeiro nível que abriga os argumentos de cada comando.","level":5,"name":"Editor Latex","has_images":true,"description":"O LATEX é um excelente interpretador de linguagem de formatação para construção de textos, artigos, apresentaçõees, ... Para facilitar a construção de um texto em LATEX normalmente se utiliza um editor específico. O poder da linguagem vem da grande facilidade de inclusão de módulos e pacotes. Um destes pacotes é o pstricks que junto com pst-node e pst-tree permite construir árvores gerais. O nosso intuito é construir árvores binárias. O comando a seguir constrói a árvore da figura:\r\n\\pstree{\\Tcircle{A}}{\\pstree{\\Tcircle{B}}{\\Tcircle{D}\\Tcircle{E}}\\Tcircle{C}}\r\n\r\n\r\n\r\nDe uma forma geral o comando \\pstree{}{} recebe dois argumentos: o primeiro argumento é o raiz, necessariamente um nó, e o segundo são as árvores filhas que podem ser nó ou árvore (recursivamente por um comando \\pstree{}{}). Um nó é representado pelo comando \\Tcircle{} que irá criar um círculo com seu argumento escrito em seu interior. Os filhos, precisam ser exatamente 2 (para nosso objetivo: árvore binária). Como este comando possui vários níveis de recursividade profundidade da árvore) acaba ficando confuso a contagem de parˆentesis. Uma pequena troca produz resultados inesperados. Veja o exemplo:\r\n\\pstree{\\Tcircle{A}}{\\pstree{\\Tcircle{B}}{\\Tcircle{D}}{\\Tcircle{E}}\\Tcircle{C}}\r\n\r\nA você foi pedido um programa, para ser incorporado em um Editor LATEX, que verifique se a sintaxe do pstree está correta para formar árvores binárias.","id":"2509","category":"Strings","statistics":{"level":"5 / 10","submissions":31,"solved":13,"ratio":"41.94%"}}