{"output":"A saída é composta por uma linha indicando a mensagem: “Jason wins!”, se Jason ganhar a partida, “Fred wins!”, se Fred ganhar a partida, ou “Its a draw!”, se houver empate na partida.","input":"Cada entrada é composta várias linhas. Na primeira linha, haveŕa um número R indicando a quantidade de rodadas em uma única partida. Em seguida são descritas 2*R matrizes, na representação mostrada acima, uma embaixo da outra, cada par representando respectivamente, na ordem em que aparecem, a matriz inicial de Fred e a matriz inicial de Jason, correspondendo a uma rodada. Há um espaço em branco entre dois caracteres consecutivos na mesma linha de uma matriz e uma linha em branco separando duas matrizes consecutivas.","level":9,"name":"O Jogo Reverse","has_images":true,"description":"Você já ouviu falar no jogo reverse? É um jogo bem simples. Dada uma matriz 3x3, composta de ‘*’ (asteriscos) e ‘-’ (traços), o objetivo do jogador é alterar, através de pequenas mudanças feitas em seus caracteres, o estado da matriz de forma a chegar em um estado válido, no qual todos os caracteres da matriz são traços ou todos são asteriscos. A única regra para se fazer alguma mudança na matriz é a seguinte: o jogador escolhe uma célula da matriz e, em seguida, o caracter correspondente a esta e os correspondentes às suas células adjacentes (esquerda, direita, acima e abaixo) devem alterar seu valor para o caracter oposto, ou seja, se houver algum caracter ‘*’, este passará a ser ‘-’, e se houver ‘-’, ‘*’. Abaixo, um exemplo de mudança de estado (em vermelho as células escolhidas).\r\n\r\n\r\nA versão multiplayer do jogo se dá na seguinte forma: uma partida é composta por diversas rodadas. Em cada rodada, são dadas duas matrizes de mesmo estado inicial (escolhido ao acaso), uma para cada jogador. Os jogadores devem então, simultaneamente, alterar o estado inicial da sua matriz (através das mudanças descritas acima) para um estado final válido. O jogador decide livremente a qual destes estados ele deve chegar. Ganha uma rodada o jogador que cumprir o objetivo acima em menos passos. Uma mudança na matriz (as alterações dos caracteres correspondentes à célula escohida e adjacentes) corresponde a um passo neste jogo. Desta forma, a quantidade de caracteres alterados durante as mudanças de estado não interfere na quantidade de passos atingida. O empate em uma rodada ocorre quando os jogadores obtêm a mesma quantidade de passos, não importando qual estado final eles escolheram. Ganha a partida o jogador que obtiver mais rodadas ganhas. Há empate em uma partida quando os jogadores tem quantidades iguais de rodadas ganhas.\r\n\r\nUfah! Beleza. Agora que você conhece o jogo, talvez seja capaz de ajudar meus amigos. Fred e Jason são dois viciados em Reverse. Eles jogam de maneira ótima, ou seja, eles sempre sabem, partindo de um estado inicial qualquer, chegar a ambos os estados finais válidos com a menor quantidade de passos possível. Obviamente, também sempre escolhem o caminho com a menor quantidade mínima de passos. Desta forma, o empate torna-se inevitável!\r\n\r\nEntão, para que o jogo não fique sem graça, uma pequena mudança foi feita: Fred e Jason começam com matrizes diferentes. Desta forma, precisamos que você determine quem vai ganhar a partida, neste formato de jogo.","id":"2512","category":"Ad-Hoc","statistics":{"level":"9 / 10","submissions":70,"solved":19,"ratio":"27.14%"}}