{"output":"Para cada caso de teste, imprima uma linha contendo a distância entre a câmera e o participante no momento da foto. Arredonde e imprima a resposta com exatamente 2 casas decimais.","input":"A primeira linha de cada caso de teste contém três inteiros A, B, C (1 ≤ A, B, C ≤ 200) que descrevem o trajeto. A segunda linha contém dois inteiros xc e yc (0 ≤ xc, yc ≤ 200) indicando a posição da câmera. A terceira e última linha de cada caso de teste contém o inteiro xF  (1 ≤ xF  ≤ 200) indicando o ponto de chegada.\n\n\t\t\t\t\tÉ garantido que f(xF) = 0. Além disso, note que f(x) é tal que a função é sempre decrescente para x ≥ 0, e que a altura do prédio é sempre positiva.\n\n\t\t\t\t\tA entrada termina com fim-de-arquivo (EOF).","level":5,"name":"Desafio PoGro","has_images":true,"description":"A PoGro é uma famosa marca de câmeras digitais de alta tecnologia. Este ano, a PoGro está promovendo o Desafio PoGro! Neste desafio, cada participante deve saltar do topo de um prédio e chegar a salvo em um ponto específico no chão, utilizando apenas uma asa delta.\n\n\t\t\t\tConsidere que o topo do prédio está no ponto (0,C) do plano cartesiano, e que a chegada está no ponto (xF, 0). Para completar o desafio, o participante deve seguir rigorosamente o trajeto definido pela parábola dada pela função f(x) =  -x²/A - x/B + C, onde A, B e C são escolhidos pela organização do desafio de tal forma que f(xF) = 0. O trajeto é apresentado na figura abaixo.\n\n\t\t\t\t\n\n\t\t\t\tA organização colocou uma câmera PoGro na posição (xc,yc) do plano, que será utilizada para tirar uma foto do participante. Para que a foto tirada seja a melhor possível, a foto será tirada no exato momento em que o participante estiver o mais próximo possível da câmera.\n\n\t\t\t\tEntretanto, a organização está com dificultades em determinar qual será a distância entre a câmera e o participante no momento em que a foto será tirada (exemplificada pela reta pontilhada na figura acima). Dado o trajeto do participante e a posição da câmera, determine a distância entre a câmera e o participante no memento em que a foto será tirada!","id":"2517","category":"Geometria Computacional","statistics":{"level":"5 / 10","submissions":83,"solved":43,"ratio":"51.81%"}}