{"output":"Para cada caso de teste, imprima uma linha para cada consulta contendo o número de jogadores que estão atualmente na região consultada.","input":"A primeira linha de cada caso de teste contém dois inteiros N e M (1 ≤ N, M ≤ 1000), o número de linhas e de colunas do campo, respectivamente. As próximas N linhas contém M inteiros cada, descrevendo o campo com as posições iniciais dos jogadores. O inteiro 0 representa uma posição vazia, enquanto o inteiro 1 representa uma posição com um jogador. A próxima linha contém um inteiro Q (1 ≤ Q ≤ 105), o número de operações. As próximas Q linhas descrevem uma operação cada. Cada operação é descrita por cinco inteiros R I1 J1 I2 J2.\n\n\t\t\t\t\tSe R=0, o jogador na posição (I1,J1) se move para a posição (I2,J2) (1 ≤ I1,I2 ≤ N, 1 ≤ J1,J2 ≤ M). É garantido que, antes da operação, a posição (I1,J1) contém um jogador, e a posição (I2,J2) está vazia.\n\n\t\t\t\t\tSe R=1, o técnico faz uma consulta sobre a região (I1,J1) e (I2,J2), inclusive (1 ≤ I1 ≤ I2 ≤ N, 1 ≤ J1 ≤ J2 ≤ M).\n\t\t\t\t\tA entrada termina com fim-de-arquivo (EOF).","level":7,"name":"Estratégia Campeã","has_images":true,"description":"Os Wildcats estão na grande final de basquetebol escolar deste ano! Experiente, o técnico Bolton está utilizando sua famosa estratégia campeã para vencer o jogo e, logo, o torneio. Entretanto, para poder aplicar sua estratégia, ele precisa frequentemente contar o número de jogadores adversários em algumas regiões do campo durante todo o jogo. Mas, sabendo da estratégia do técnico, os jogadores adversários também mudam suas posições frequentemente durante o jogo!\n\n\t\t\t\tConsidere que o campo tem N linhas e M colunas, numeradas de 1 a N e de 1 a M, respectivamente. A figura abaixo exemplifica: (a) um campo com N=3, M=4, e as posições iniciais de cada jogador adversário; (b) o jogador na posição (1,2) se move para a posição (3,3); (c) há agora 3 jogadores na região entre as posições (1,3) e (3,4), inclusive.\n\n\t\t\t\t\n\n\t\t\t\tDadas as posições iniciais dos jogadores e a movimentação deles durante o jogo, ajude o técnico em suas contagens!","id":"2519","category":"Estruturas e Bibliotecas","statistics":{"level":"7 / 10","submissions":132,"solved":61,"ratio":"46.21%"}}