{"output":"Para cada caso de teste, imprima exatamente uma linha com o número de posições válidas sugeridas pelo Ministério de Lazer e Esporte.","input":"A entrada contém vários casos de teste. A primeira linha de cada caso contém quatro inteiros separados por espaços N, C (1 ≤ N, C ≤ 104), K (1 ≤ K ≤ 8) e D (1 ≤ D ≤ 105).\n\nAs próximas N linhas contém dois inteiros separados por um espaço, xi e yi (0 ≤ xi, yi ≤ 104), a posição do i-ésimo geocache já existente na Nlogônia. Não há posições repetidas.\n\nAs próximas C linhas contém dois inteiros separados por um espaço, xj e yj (0 ≤ xj, yj ≤ 104), a j-ésima possível posição do novo geocache.A entrada termina com fim-de-arquivo (EOF).","level":10,"name":"Cacheiro Viajante","has_images":false,"description":"Clóvis Eduardo é um cacheiro viajante, ou seja, ele viaja o mundo para praticar geocaching. Geocaching é um jogo mundial de GPS no qual os jogadores encontram caixas escondidas (conhecidas como geocaches) por outros jogadores fazendo uso das coordenadas terrestres.\n\nDevido a sua grande reputação e experiência (mais de 32768 geocaches encontrados em todos os continentes), Clóvis Eduardo foi convidado pelo ministério de Lazer e Esporte da Nlogônia a ajudar a esconder o geocache mais importante da história do país, uma grande caixa de ouro maciço em forma de cavalo, em comemoração aos 50 anos da instauração da república na Nlogônia.\n\nEntretanto, não basta apenas encontrar o local perfeito. Novos geocaches devem seguir as regras nacionais de colocação atualizadas este ano:\n\n\n\tNenhum geocache novo pode ser colocado no mesmo lugar de outro já existente;\n\tA soma das distâncias aos K geocaches já existentes mais próximos deve ser igual ou superior a D;\n\tSe existirem menos de K geocaches, deverão ser considerados todos os existentes na soma das distâncias.\n\n\nA Nlogônia é representada por um plano e, atualmente, possui N geocaches ativos. O ministério de Lazer e Esporte escolheu C possíveis localizações para a colocação do geocache comemorativo e pediu para que Clóvis Eduardo os informasse quantas destas localizações são viáveis de acordo as regras nacionais de colocação.\n\nComo Clóvis Eduardo é preguiçoso, ele pediu para que você escrevesse um programa para resolver o seu problema.","id":"2525","category":"Geometria Computacional","statistics":{"level":"10 / 10","submissions":100,"solved":49,"ratio":"49.00%"}}