{"output":"Para cada caso de teste, imprima uma linha com o valor a ser gritado para cada operação de grito (tanto E quanto O).","input":"A entrada contém vários casos de teste. A primeira linha de cada caso de teste contém dois inteiros P e Q (1 ≤ P, Q ≤ 105). A linha seguinte contém P inteiros pi (0 ≤ pi ≤ 109) separados por espaços com o número inicialmente escrito na placa das pulgas.\r\n\r\nAs Q linhas seguintes descrevem as ordens dadas aos insetos e seguem uma das quatro possibilidades:\r\n\r\n\r\n\tS a v: Trocar o número da placa da pulga na posição a (1 ≤ a ≤ P) por v;\r\n\tE a b: Gritar a quantidade de números pares nas placas das pulgas no intervalo [a,b] (1 ≤ a ≤ b  ≤ P);\r\n\tO a b: Gritar a quantidade de números ímpares nas placas das pulgas no intervalo [a,b] (1 ≤ a ≤ b ≤ P);\r\n\tI a b: Inverter a ordem das placas no intervalo [a,b] (1 ≤ a ≤ b ≤ P).\r\n\nA entrada termina com fim-de-arquivo (EOF).","level":9,"name":"Circo das Pulgas","has_images":false,"description":"Vasya e Petya resolveram investir em um novo empreendimento. Eles abriram um circo de pulgas.\r\n\r\nNeste exato momento, eles estão ensaiando com suas P pulgas em uma linha reta. Cada inseto carrega uma pequena placa com um número inteiro e sabe seguir 4 ordens diferentes:\r\n\r\n\r\n\tTrocar o número em sua placa por outro especificado;\r\n\tGritar a quantidade de números pares nas placas das pulgas de um dado intervalo de posições;\r\n\tGritar a quantidade de números ímpares nas placas das pulgas de um dado intervalo de posições;\r\n\tComeçar a dançar enquanto as pulgas de um dado intervalo de posições invertem a ordem de suas placas.\r\n\r\n\r\nAlguns animais não entenderam a última tarefa e pediram um exemplo. Vasya prosseguiu:\r\n\r\nSuponha que existam 10 pulgas inicialmente segurando placas com os seguintes valores:\r\n\r\n70, 15, 3, 4, 15, 59, 0, 1, 444, 2\r\n\r\nSe a ordem for para inverter a ordem das placas no intervalo [3, 7], a nova configuração seria:\r\n\r\n70, 15, 0, 59, 15, 4, 3, 1, 444, 2\r\n\r\nA dupla pediu para que você escrevesse um programa que simule o ensaio das pulgas. Desta forma, eles podem verificar se elas estão bem treinadas.","id":"2529","category":"Grafos","statistics":{"level":"9 / 10","submissions":133,"solved":50,"ratio":"37.59%"}}