{"output":"Para cada caso de teste, imprima uma linha contendo sim se a prova deverá ser zerada ou nao caso contrário.","input":"A entrada contém vários casos de teste. A primeira linha de cada caso contém dois inteiros N e M (1 ≤ M ≤ N ≤ 105). A segunda linha contém N inteiros si (1 ≤ si ≤ 103) descrevendo as respostas de Juan. A terceira linha contém M inteiros rj (1 ≤ rj ≤ 103) descrevendo as respostas de Ricardinho.A entrada termina com fim-de-arquivo (EOF).","level":5,"name":"Cola","has_images":false,"description":"Os alunos da quarta série do colégio Trale Lewous fizeram prova de Matemática no primeiro horário, todos entregaram uma folha apenas com as respostas e seus respectivos índices. Dona Maria Eduarda, a professora, suspeita Ricardinho de ter colado de Juan, o melhor aluno da turma.\r\n\r\nRicardinho foi chamado para conversar com a professora durante o recreio, a fim de verificar se houve cola ou não. Entretanto, ao ver que poderia ser pego, o menino, que é muito travesso, distraiu Maria Eduarda e apagou o índice das respostas na folha entregue. Por exemplo, se inicialmente estava escrito \"1) 20 2) 30 3) 35 ...\", agora restou apenas \"20 30 35 ...\".\r\n\r\nA prova consistia de N questões, todas com respostas númericas. Entretanto, o menino conseguiu responder apenas M delas. A professora lembra, com certeza, que Ricardinho as escreveu em ordem na folha de respostas. Ou seja, se ele respondeu, por exemplo, as questões 2 e 4, a resposta da questão 2 está escrita antes da resposta da questão 4.\r\n\r\nTendo as N respostas de Juan, também em ordem, Maria Eduarda zerará a prova de Ricardinho se houver uma forma de casar o valor das M respostas do aluno malandro com M das N respostas do aluno caxias, sem desrespeitar a ordem delas.\r\n\r\nEscreva um programa que, dado as N respostas de Juan e as M respostas de Ricardinho, diga se a prova deverá ser zerada.","id":"2530","category":"Ad-Hoc","statistics":{"level":"5 / 10","submissions":458,"solved":177,"ratio":"38.65%"}}