{"output":"Para cada caso de teste, imprima uma linha para cada consulta contendo a maior diferença de preços das lojas entre as lojas i e j, inclusive.","input":"A entrada contém vários casos de teste. A primeira linha de cada caso contém o inteiro N (1 ≤ N ≤ 105). A segunda linha contém N inteiros p1,p2,...,pN (1 ≤ pi ≤ 105). O inteiro pi indica o preço inicial do celular na loja i. A terceira linha contém um inteiro Q (1 ≤ Q ≤ 105), o número de operações. As próximas Q linhas descrevem uma operação cada. Cada operação pode ser descrita de duas formas:\r\n\r\n\r\n\t1 i p (1 ≤ i ≤ N, 1 ≤ p ≤ 105), indicando que o preço do celular foi alterado para p na loja i.\r\n\t2 i j (1 ≤ i ≤ j ≤ N), indicando uma consulta.\r\n\nA entrada termina com fim-de-arquivo (EOF).","level":7,"name":"Compras em FdI","has_images":false,"description":"Está chegando a grande final do Campeonato Nlogonense de Surf Aquático. Ano que vem, a final ocorrerá na cidade de Foça do Iguachim (FdI)! A região de FdI e das cidades próximas é famosa por seu comércio, composto por diversas lojas que costumam vender diversos produtos a preços mais atraentes que no restante do país. Você quer aproveitar a viagem para FdI para comprar o novo celular Aifôni (R) (Na verdade, você queria um Sãosunga (R), mas este celular é um verdadeiro estouro!)!\r\n\r\nExistem N lojas na região, numeradas de 1 a N. Todas as lojas vendem o celular, embora o preço do aparelho pode ser diferente em cada loja. Para não tornar sua viagem cansativa, você pode considerar não visitar todas as N lojas, mas sim visitar apenas as lojas entre duas dadas lojas i e j, inclusive. Você está interessado na maior diferença de preços do aparelho entre as lojas visitadas. A diferença é dada por |M - m|, onde M é o maior preço dentre as lojas visitadas, e m é o menor.\r\n\r\nAlém disso, as lojas podem alterar o preço do celular como desejarem! Sua tarefa é determinar, para várias consultas, a maior diferença de preços nas lojas entre duas dadas lojas, considerando também eventuais alterações de preços nas lojas.","id":"2531","category":"Estruturas e Bibliotecas","statistics":{"level":"7 / 10","submissions":1163,"solved":379,"ratio":"32.59%"}}