{"output":"Para cada caso de teste, imprima, para cada rodada, uma linha indicando o total de azeitonas na região.","input":"A entrada contém vários casos de teste. A primeira linha de cada caso contém os inteiros N e M (1 ≤ N ≤ 1000, 1 ≤ M ≤ 105). As próximas N linhas contém N inteiros cada, descrevendo o tabuleiro inicial. O valor 1 indica uma azeitona, enquanto o valor 0 indica uma célula vazia. As próximas 2×M linhas descrevem as rodadas do jogo, uma rodada a cada duas linhas. A primeira linha contém dois inteiros i e j (1 ≤ i, j ≤ N) indicando a inclusão de uma azeitona na célula na linha i e coluna j. É garantido que a célula estava vazia antes da rodada. A segunda linha de cada rodada contém quatro inteiros I1, J1, I2 e J2 (1 ≤ I1 ≤ I2 ≤ N, 1 ≤ J1 ≤ J2 ≤ N), descrevendo a região do tabuleiro da célula (I1, J1) até a célula (I2, J2).A entrada termina com fim-de-arquivo (EOF).","level":6,"name":"GigaDrive","has_images":false,"description":"A TéquiToy está relançando no mercado o Giga Drive, um console antigo muito popular nos anos 90. Para comemorar o relançamento do console, a TéquiToy vai lançar um jogo “inédito” este ano: o Giga Drive ChesseBread 2! Na verdade, o Giga Drive CheeseBread 2 é um clone com poucas alterações de um outro jogo famoso. Por isso, suas regras são muito semelhantes.\r\n\r\nEm Giga Drive CheeseBread 2, o tabuleiro do jogo consiste em uma matriz de N linhas e N colunas. Inicialmente, cada célula da matriz está vazia ou contém uma azeitona (?). Uma partida é composta por M rodadas. A cada rodada, o computador coloca uma azeitona em uma célula vazia do tabuleiro. Em seguida, ele pergunta ao jogador o total de azeitonas na região do tabuleiro da célula (I1, J1) até uma célula (I2, J2) dada. Em outras palavras, o computador indica quatro inteiros I1, J1, I2 e J2, e pergunta ao jogador o número total de azeitonas nas células na linha i e coluna j tal que I1 ≤ i ≤ I2 e J1 ≤ j ≤ J2.\r\n\r\nPara vencer o jogo, você deve acertar a contagem em todas as rodadas do jogo! Entretanto, você tem muito pouco tempo para contar todas as azeitonas. Por isso, escreva um programa para garantir sua vitória!","id":"2537","category":"Estruturas e Bibliotecas","statistics":{"level":"6 / 10","submissions":190,"solved":88,"ratio":"46.32%"}}