{"output":"Para cada caso de teste, imprima uma linha com um inteiro indicando quantos analógimôns ficarão no ginásio.","input":"A entrada contém vários casos de teste. A primeira linha de cada caso contém os inteiros IP e M (1 ≤ IP, M ≤ 105), o IP do ginásio e o número de tentativas, respectivamente. As próximas M linhas descrevem as tentativas de colocar um analógimôn no ginásio, na ordem em que são feitas. Cada linha contém dois inteiros PC e NA (1 ≤ PC, NA ≤ 105), indicando o PC e o NA do analógimôn, respectivamente. O Poder de Combate de todos analógimôns são distintos.A entrada termina com fim-de-arquivo (EOF).","level":7,"name":"Ginásio","has_images":false,"description":"Analógimôn Go! é um jogo bastante popular. Em sua jornada, o jogador percorre diversas cidades capturando pequenos monstrinhos virtuais, chamados analógimôns. As cidades contém localidades especiais chamadas de ginásios. Ao chegar a um ginásio, um jogador pode tentar colocar um de seus analógimôns dentro dele.\r\n\r\nCada anlógimôn tem dois inteiros associados a ele: seu Poder de Combate (PC) e seu Número de Ataques (NA). Além disso, um ginásio tem associado a ele um Intervalo de Poder (IP). Ao tentar colocar um analógimôn em um ginásio, o jogo verifica quantos são os analógimôns já presentes no ginásio cuja diferença do seu PC para o PC do analógimôn sendo colocado é de no máximo IP. Se esta quantidade for menor ou igual ao NA do analógimôn sendo colocado, o monstrinho é inserido no ginásio com sucesso. Caso contrário, ele não é colocado no ginásio. Em ambos os casos, os analógimôns que já estavam no ginásio continuam no ginásio. Como exemplo, considere um ginásio com IP=3 com analógimôns de PC iguais a 5, 8, 13 e 20. Se um jogador tenta colocar um analógimôn de PC=10 e NA=4, o jogo contará quantos analógimôns há no ginásio com PC entre 10 - 3 = 7 e 10 + 3 = 13, inclusive. Como há dois analógimôns neste caso, o monstrinho é colocado com sucesso no ginásio, pois 2 ≤ 4. O ginásio passa a conter analógimôns de PC iguais a 5, 8, 10, 13 e 20.\r\n\r\nDadas as informações sobre um ginásio e as tentativas de colocar analógimôns dentro dele, determine quantos analógimôns ficarão no ginásio após todas as tentativas. Considere que o ginásio inicialmente não contém nenhum analógimôn.","id":"2538","category":"Estruturas e Bibliotecas","statistics":{"level":"7 / 10","submissions":265,"solved":113,"ratio":"42.64%"}}