{"output":"Para cada caso de teste, para cada operação do último tipo, imprima uma linha contendo a soma resultante da operação.","input":"A entrada contém vários casos de teste. A primeira linha de cada caso contém um inteiro N (1 ≤ N ≤ 2×105). A segunda linha contém N inteiros a1,a2,...,aN, a sequência inicial de Flávio (0 ≤ ai ≤ 103). A terceira linha contém um inteiro Q (1 ≤ Q ≤ 2×105), o número de operações. As próximas Q linhas contém as operações. Cada operação é descrita por uma linha contendo:\n\n\n\t1 i v (1 ≤ i ≤ N, 0 ≤ v ≤ 103), indicando a troca do i-ésimo número para v; ou\n\t2 i j z v (1 ≤ i ≤ j ≤ N, z=13 ou 7, 0 ≤ v ≤ 103), indicando a troca das ocorrências de z entre o i-ésimo e o j-ésimo número (inclusive) para v; ou\n\t3 i j (1 ≤ i ≤ j ≤ N), indicando o cálculo da soma dos elementos entre o i-ésimo e o j-ésimo número, inclusive.\n\nA entrada termina com fim-de-arquivo (EOF).","level":10,"name":"Sexta-Feira 13","has_images":false,"description":"Hoje é sexta-feira 13! Segundo a tradição, o número 13, assim como o número 7, pode ser considerado um número de azar. Por isso, algumas pessoas preferer tomar cuidado com os números 13 e 7 em paticular!\n\nFlávio tem uma sequência de N números inteiros numerados de 1 a N, e deseja realizar várias operações sobre ela. Há três operações possíveis:\n\n\n\tDado um inteiro i e um inteiro v, trocar o i-ésimo número da sequência para v;\n\tDados inteiros i, j, z e v, com z=13 ou 7, trocar todas as ocorrências do número z para v entre o i-ésimo e o j-ésimo número da sequência, inclusive;\n\tDados inteiros i e j, calcular a soma de todos os elementos da sequência entre o i-ésimo e o j-ésimo número, inclusve.\n\n\nPor exemplo, se a sequência inicial de Flávio é (2, 13, 5, 13, 7) e troca-se o 1-ésimo número para 3, tem-se o vetor (3, 13, 5, 13, 7). Se todas as ocorrências de 13 entre o 4-ésimo e o 5-ésimo número são trocadas para 6, tem-se o vetor (3, 13, 5, 6, 7). Por fim, a soma dos elementos entre o 2-ésimo e o 4-ésimo número é igual a 13+5+6=24.\n\nPara cada operação do último tipo, calcule e mostre a soma resultante da operação.","id":"2559","category":"Estruturas e Bibliotecas","statistics":{"level":"10 / 10","submissions":537,"solved":45,"ratio":"8.38%"}}