{"output":"Para cada caso de teste, imprima uma linha com um inteiro indicando a menor quantidade de espécies de analógimôns que certamente são do mesmo tipo da espécie do seu analógimôn, de acordo com o manual. Note que a espécie do seu analógimôn também deve ser contada.","input":"A entrada contém vários casos de teste. A primeira linha de cada caso contém dois inteiros N e M (1 ≤ N ≤ 1000, 0 ≤ M ≤ N(N-1)/2), o número de espécies de analógimôns e o número de informações presentes no manual, respectivamente. As espécies são numeradas de 1 a N. Cada uma das próximas M linhas contém uma informação presente no manual. Cada linha contém dois inteiros a e b (1 ≤ a, b ≤ N, a≠b), indicando que as espécies a e b são do mesmo tipo. A última linha contém um inteiro E (1 ≤ E ≤ N), indicando a espécie de seu analógimôn.A entrada termina com fim-de-arquivo (EOF).","level":6,"name":"Tipos Analógimôn","has_images":false,"description":"Analógimôn Go! é um jogo bastante popular. Em sua jornada, o jogador percorre diversas cidades capturando pequenos monstrinhos virtuais, chamados analógimôns. Existem várias espécies de analógimôns. Cada espécie é de (exatamente) um tipo, como fogo, água, elétrico, etc. Algumas espécies podem ser do mesmo tipo, enquanto outras podem se tipos diferentes.\r\n\r\nNo manual oficial do jogo consta que algumas espécies são do mesmo tipo. Entretanto, o manual pode não apresentar esta informação para todos os pares de espécies que são do mesmo tipo. Por exemplo, se o manual indica que uma espécie a é do mesmo tipo que uma espécie b, e que uma espécie b é do mesmo tipo que uma espécie c, então as espécies a e c certamente são do mesmo tipo, embora esta informação pode não constar no manual.\r\n\r\nVocê capturou um analógimôn de uma certa espécie. Sua tarefa é determinar o menor número possível de espécies que certamente são do mesmo tipo da espécie do seu analógimôn, de acordo com as informações contidas no manual.","id":"2562","category":"Grafos","statistics":{"level":"6 / 10","submissions":1298,"solved":470,"ratio":"36.21%"}}