{"output":"Para cada caso de teste, imprima uma linha com a quantidade mínima de vezes que você deve usar seu poder para garantir que o prêmio N será conquistado.","input":"A entrada contém vários casos de teste. A primeira linha de cada caso contém o inteiro N (2 ≤ N ≤ 100), o número de prêmios. As próximas N-1 linhas descrevem uma rodada cada, em ordem. Cada linha contém dois inteiros Pi e Ri (2 ≤ Pi ≤ N, Ri = 0 ou 1), o prêmio oferecido na rodada e a resposta que seu irmão pretende dar na rodada, respectivamente. Ri = 0 indica “não”, enquanto Ri = 1 indica “sim”.\r\n\r\nNenhum prêmio será oferecido mais de uma vez, e o prêmio 1 não será oferecido novamente.A entrada termina com fim-de-arquivo (EOF).","level":5,"name":"Troca ou Não Troca","has_images":false,"description":"Você provavelmente conhece programas de TV do tipo Troca ou não Troca?, onde um participante pode ganhar um prêmio que pode ir desde uma caneta até uma casa com piscina.\r\n\r\nExistem N prêmios, numerados de 1 a N. O participante começa o programa com o prêmio 1. O programa tem então N-1 rodadas. Na rodada i, o apresentador pergunta ao participante se ele deseja trocar seu prêmio atual pelo prêmio Pi. O participante, que não sabe qual prêmio está sendo oferecido, deve responder “sim” ou “não”. Se o participante responder “sim”, seu prêmio atual é trocado pelo prêmio Pi. Se o participante responder “não”, seu prêmio atual não é alterado. Após a última rodada, o participante leva para casa o prêmio que tiver.\r\n\r\nSeu irmão será o participante do programa que está prestes a começar! Antes do programa, ele lhe contou a resposta que pretende dar em cada rodada. Entretanto, você tem o poder de controlar sua mente! Ao utilizar o poder em alguma rodada, a resposta dele para aquela rodada é alterada, isto é, ele irá dizer “sim” caso pretendia dizer “não”, e vice-versa.\r\n\r\nVocê acabou de descobrir qual prêmio será oferecido em cada rodada. Você quer muito que ele termine o programa com o prêmio N, o de maior valor entre todos os prêmios. Qual a quantidade mínima de vezes que seu poder deve ser utilizado para garantir que seu irmão irá levar o prêmio N?","id":"2564","category":"Ad-Hoc","statistics":{"level":"5 / 10","submissions":224,"solved":93,"ratio":"41.52%"}}