{"output":"Para cada caso de teste, imprima uma única linha contendo um inteiro indicando o custo mínimo necessário para fazer sua viagem, dadas as restrições acima.","input":"A entrada contém vários casos de teste. A primeira linha de cada caso contém dois inteiros N e M (2 ≤ N ≤ 100, 1 ≤ M ≤ 2(N2 -N)), o número de cidades e de trechos, respectivamente. As próximas M linhas descreve um trecho cada. Cada linha contém quatro inteiros A B T R (1 ≤ A, B ≤ N, A≠B,T = 0 ou 1, 1 ≤ R ≤ 104), indicando um trecho que sai da cidade A e chega na cidade B (nesta ordem), feito por ônibus se T = 0 ou por avião se T = 1, e cuja passagem custa R reais.\r\n\r\nÉ garantido que existe ao menos um caminho de sua cidade para BH utilizando apenas um meio de transporte. Além disso, para cada par ordenado de cidades (A,B), existe no máximo um trecho de A para B para cada meio de transporte possível (mas note que pode haver um trecho de ônibus e outro de avião de A para B).A entrada termina com fim-de-arquivo (EOF).","level":6,"name":"Viagem Para BH","has_images":false,"description":"Está chegando a grande final do Campeonato Nlogonense de Surf Aquático, que este ano ocorrerá na cidade de Bonita Horeleninha (BH)! Você decidiu que irá viajar de sua cidade natal para BH para acompanhar a final.\r\n\r\nExistem N cidades em Nlogônia, numeradas de 1 a N. Considere que cidade 1 é sua cidade natal, e a cidade N é BH.\r\n\r\nAlém disso, existem M trechos pelos quais é possível viajar. Cada trecho pode ser usado para ir de uma cidade para alguma outra do país. Alguns trechos são feitos de ônibus, enquanto os demais são feitos de avião. Para cada trecho, você conhece o preço, em reais, da passagem que deve pagar para poder utilizá-lo.\r\n\r\nPara não tornar sua viagem muito cansativa com deslocamentos entre rodoviárias e aeroportos, você decidiu que irá utilizar apenas um meio de transporte em toda sua viagem, isto é, você quer ir para BH ou utilizando apenas ônibus, ou utilizando apenas aviões.\r\n\r\nSua tarefa é determinar o custo mínimo necessário, em reais, para viajar da sua cidade natal para BH, dada a restrição que o meio de transporte não deve ser alterado durante a viagem.","id":"2566","category":"Grafos","statistics":{"level":"6 / 10","submissions":474,"solved":165,"ratio":"34.81%"}}