{"output":"A saída contém R linhas. Na i-ésima linha, imprima um inteiro: o ataque total da melhor equipe de até K Pokémons que se pode formar com os Pokémons disponíveis na i-ésima região. Como este número pode ser muito grande, imprima o seu resto da divisão por 109 + 7.\r\n ","input":"A entrada começa com uma linha contendo três inteiros separados por espaço: N ( N <  2*105 ) (número de Pokémons no jogo), K ( K < 40 ) (tamanho máximo de uma equipe de Pokémons que pode batalhar) e R ( R < 2*105 ) (número de regiões no jogo). Em seguida, a próxima linha contém N inteiros m_i ( 0 < m_i < 104 ) separados por espaço, onde m_i é o multiplicador de ataque do Pokémon de número i. Por fim, há R linhas descrevendo quais Pokémons estão disponíveis em cada região. Cada uma dessas linhas contém dois inteiros, L_i e R_i (1 < L_i < R_i < N), significando que na i-ésima região do jogo apenas os Pokémons com números entre L_i e R_i estão disponíveis.","level":10,"name":"Escalação","has_images":false,"description":"Escalar uma equipe é uma tarefa complicada em vários esportes. Por exemplo, no futebol, se montarmos um time com os 11 melhores jogadores de futebol de todos os tempos, teríamos provavelmente um time com nenhum goleiro ou zagueiro.\r\n\r\nO caso é um pouco mais simples no Pokémon Ho. Neste jogo, cada jogador tem seu conjunto de bichos, chamados de Pokémons, que podem batalhar entre si. Numa batalha entre dois treinadores, cada um deve escolher um conjunto de até K Pokémons para batalhar. Uma equipe não precisa ter K Pokémons, mas precisa ter pelo menos um. Cada Pokémon tem um multiplicador de ataque, e o dano total causado por todos os Pokémons é simplesmente o produto dos multiplicadores de todos os Pokémons da equipe do treinador. Este produto é chamado de ataque total. Como a interação entre os multiplicadores dos Pokémons é mais simples que entre jogadores de um esporte de equipe, não é tão difícil escolher os Pokémons que maximizam o ataque total para uma batalha.\r\n\r\nAntes de lançar o jogo, a NlogNintendo está avaliando as equipes que podem ser formadas em cada região do mundo. Há N Pokémons no jogo, numerados de 1 a N. Para cada região do mundo, a NlogNintendo decidiu liberar apenas alguns Pokémons. Assim, para capturar todos os Pokémons, os jogadores teriam que viajar por vários países, o que deixa a experiência mais interessante (apesar de mais cara). Para simplificar a escolha, foi decidido que cada região terá acesso a uma parte contígua da sequência de Pokémons. Mais precisamente, na região i, os jogadores têm acesso aos Pokémons de números L_i, L_{i}+1, ..., R_{i} - 1, R_{i}, isto é, todos os Pokémons com números entre L_i e R_i.\r\n\r\nDados os multiplicadores de ataque de cada Pokémon, a sequência de Pokémons disponíveis em cada região, e o tamanho máximo K das equipes que podem batalhar, a empresa contratou você para dizer qual é o melhor ataque total possível que alguém poderia formar apenas com os Pokémons de cada região.","id":"2572","category":"Ad-Hoc","statistics":{"level":"10 / 10","submissions":518,"solved":141,"ratio":"27.22%"}}