{"output":"A saída deve conter uma linha com dois números com 6 casas decimais separados por espaço, representando a probabilidade de Luan pegar a moeda e a probabilidade de Larissa pegar a moeda.","input":"A entrada é composta por três linhas. A primeira contém dois inteiros L ( 1 ≤ L ≤ 104 ) e A ( 1 ≤ A ≤ 104 ), as coordenadas do canto superior direito da piscina. A segunda contém dois inteiros XA ( 0 ≤ XA ≤ L )e YA ( 0 ≤ YA ≤ A ​​​​​​​), as coordenadas de Luan dentro da piscina. A terceira contém dois inteiros XB ( 0 ≤ XB ≤ L ) e YB ( 0 ≤ YB ≤ A ​​​​​​​), as coordenadas de Larissa dentro da piscina.","level":10,"name":"Caça ao Tesouro","has_images":false,"description":"Luan e Larissa são irmãos gêmeos que adoram brincar na piscina. A brincadeira favorita deles é a caça ao tesouro. Nessa brincadeira, ambos se encontram dentro da piscina quando o pai deles joga uma moeda dentro da piscina, em uma posição escolhida aleatoriamente com probabilidade uniforme. Como Larissa e Luan são gêmeos que adoram nadar, ambos conseguem nadar com a mesma velocidade. Por isso, aquele que estiver mais próximo do local em que a moeda cair será o primeiro a pegá-la.\n\nMateus é o irmão mais novo de Luan e Larissa. Ele não é muito de praticar esportes. Ele prefere ficar no quiosque tomando limonada e resolvendo um Sudoku. Porém, observador como é, Mateus percebeu que o resultado da brincadeira dos irmãos é determinado pela sorte. Agora, ele quer saber qual é a probabilidade que cada um dos irmãos tem de pegar a moeda. Mateus está muito ocupado resolvendo seu Sudoku. Por isso, ele pediu que você calculasse essa probabilidade para ele com base no tamanho da piscina e na posição de cada um dos irmãos.\n\nA piscina é descrita como um retângulo cujo canto inferior esquerdo se encontra no ponto (0, 0) e o canto superior direito se encontra no ponto (L, A). A posição de Luan é descrita pelo ponto (XA, YA), e a posição de Larissa pelo ponto (XB, YB). ","id":"2573","category":"Ad-Hoc","statistics":{"level":"10 / 10","submissions":187,"solved":44,"ratio":"23.53%"}}