{"output":"A saída deve conter um único inteiro T, o maior número de territórios que podem ser delimitados pelo governo de Bacon - O Grande.","input":"A entrada contém várias linhas. Na primeira delas, estão os inteiros N (N = 2k), tendo K os limites (0 < K < 11) e G (1< G < 105 ), o tamanho da matriz e numero mínimo de unidades de grama que devem existir em cada novo território.\r\nEm seguida, seguem N linhas com N inteiros cada, descrevendo a Ilha dos Amores, com o j-ésimo elemento da i-ésima linha representando a célula mij ( 0 < mij  < 300 )da matriz.","level":8,"name":"Lagoa Das Capivaras","has_images":false,"description":"Belo Horizonte é conhecida por abrigar um dos mais novos patrimônios históricos da humanidade: a Lagoa da Pampulha. Outra coisa que você deve saber é que ela é a morada de várias capivaras, os maiores roedores do mundo. Mas você realmente não deve fazer ideia de que a sociedade das capivaras é organizada como uma monarquia absolutista que frequentemente tem de lidar com revoluções e consequente subdivisão territorial.\r\n\r\nRecentemente, as capivaras saíram vitoriosas das Guerras de Unificação da Lagoa da Pampulha, consolidando seu território e se estabelecendo como os roedores dominantes da Lagoa. O rei das capivaras, Bacon - O Grande -, está interessado em dividir a derradeira conquista de seu povo, a Ilha dos Amores, entre seus súditos. A Ilha é uma matriz quadrada de ordem N = 2k, com cada célula representando a quantidade de unidades de grama em um dado metro quadrado da ilha. Para evitar uma sangrenta revolução e o reinício das Guerras de Unificação, Bacon - O Grande - estima que são necessárias G unidades de alimento em um território para manter uma comunidade de capivaras apaziguada.\r\n\r\nBacon - O Grande - pediu a você para descobrir qual o maior número de territórios que deverão ser formados obedecendo às seguintes restrições: (i) todas as áreas devem ser matrizes quadradas; (ii) todos os territórios devem ter a mesma área (iii) todas as células da ilha devem ser ocupadas.\r\n\r\nSua tarefa é, dada a descrição da Ilha dos Amores e a quantidade G de grama, determinar qual o maior número de comunidades que podem ser formadas pelo governo de Bacon - O Grande.","id":"2574","category":"Ad-Hoc","statistics":{"level":"8 / 10","submissions":202,"solved":49,"ratio":"24.26%"}}