{"output":"A saída deve conter dois inteiros, D e M que representam o quão bonito é a árvore com o corte ótimo e quantos cortes precisam ser feitos, respectivamente. Se o número de cortes for maior do que 0, na próxima linha, imprima M inteiros dj em ordem crescente e separados por espaço, onde dj representa o identificador de cada galho j a ser cortado.\n\nCaso exista mais de uma árvore com o mesmo grau de beleza, imprima aquela que possui menos galhos. Se ainda existir mais de uma árvore que satisfaça os mesmos criteŕios, imprima a que possua menos cortes.","input":"A entrada consiste de um inteiro N (2 < N < 106) que é a quantidade de nós da árvore. Nas próximas N-1 linhas, temos quatro inteiros di (0 < di < N-2), ai (0 < ai < N-1), bi (0 < bi < N-1),  e wi  (-1000 < wi < 1000) representando o identificador do galho i, que ele conecta o nó ai ao nó bi, e que ele possui wi de beleza pela classficação de Roberto. A árvore é sempre enraizada no nó 0. É garantido que o grafo da entrada é conexo e não possui ciclos.","level":9,"name":"Árvore de Natal","has_images":true,"description":"Roberto é apaixonado por árvores de natal. Todo ano, ele enfeita as árvores de Itajubá com os mais bonitos enfeites. Por isso, esse ano ele foi convidado pelo prefeito de Belo Horizonte a enfeitar as árvores de natal que serão colocadas no final do ano. Para isso, Roberto irá podar galhos das árvores que ele acha que estão feios. Para cada galho i da árvore, Roberto definiu o quão bonito ele é por um número wi. Valores negativos representam que o galho é feio. A beleza de uma árvore de natal é então definida pela soma das belezas de seus galhos.\n\nO processo de poda de uma árvore é simples. Roberto corta um galho da árvore, e todos os galhos que partiam dele caem também. Na figura 1 temos um exemplo de árvore e de uma poda feito por Roberto. Em cada galho da árvore na figura temos  o valor wi que descreve o quão bonito é o galho. Na árvore à direita, os galhos cortados  por Roberto estão pontilhados, enquanto os nós e galhos que caíram após o corte estão tracejados. No exemplo da figura 1, tanto a árvore sem corte, quanto a cortada possuem um valor 10 de beleza.\n\n    Figura 1: Corte de Roberto\n\n\n\n    \n\n\n\n    A figura 2 apresenta o corte ótimo do caso de exemplo. Note que foram feitos o menor número de cortes para obter essa árvore de beleza 15.\n\n\n\n    Figura 2: Corte ótimo\n\n\n\n    \n\n\nSabendo da VI Maratona Mineira de Programação, Roberto pediu que você fizesse um programa que o ajudasse a definir quais galhos ele deverá cortar da árvore para que ela fique a mais bonita possível de acordo com sua definição.","id":"2575","category":"Ad-Hoc","statistics":{"level":"9 / 10","submissions":275,"solved":87,"ratio":"31.64%"}}