{"output":"Imprima um único inteiro, representando o número de formas que Astolfo tem de cortar extremidades de tira com o texto  T  de forma que a tira final contenha uma ocorrência de ao menos um anagrama de  M, em qualquer posição.","input":"A entrada é composta por duas linhas. A primeira linha contém o texto T, composto apenas por letras minúsculas entre 'a' e 'z'. A segunda linha contém a mensagem M, também composta por letras minúsculas entre 'a' e 'z'. (1 ≤ |M| ≤|T| ≤ 106)","level":9,"name":"Ontarama Meraini","has_images":true,"description":"Chegando para a abertura da VI Maratona Mineira Programação, os times se depararam com um banner um tanto quanto confuso, onde dizia: \"Bem-vindos à VI Ontarama Meraini!\". Depois de ler algumas vezes, os mais atenciosos perceberam que se tratava de um anagrama de \" Maratona Mineira \", já que Astolfo, o criador da arte, é um cara apaixonado por anagramas.\n\nUm anagrama de uma palavra é qualquer outra palavra que se forma apenas alterando a ordem de uma ou mais de suas letras, por exemplo: \"Alergia\", \"Regalia\" e \"Galeria\" são alguns dos anagramas de \"Alegria\".\n\nAstolfo deseja fazer uma brincadeira à parte com os competidores envolvendo anagramas, para quebrar o gelo e descontrair os competidores. Para isso, ele gerou um texto  T  em seu computador, e o imprimiu em uma tira gigante de papel. Nesta tira, há lições de vida importantes que os competidores devem procurar.\n\nEle gostaria de diminuir a tira para que ela caiba em sua mala, já que ela ficou enorme. Porém, a graça da tira é justamente que Astolfo escondeu no texto alguns anagramas de uma profunda mensagem  M. Assim ao diminuir a tira, Astolfo deseja que ao menos um anagrama de  M  sobre na tira final. Ele fará a redução da seguinte forma. Primeiro, escolhera um inteiro  b entre 1 e  T inclusive, e cortará as  b primeiras letras de  T, descartando o restante.    Em seguida, ele escolherá um segundo inteiro  e  entre 1 e  b  inclusive, e cortará as últimas  e  letras da tira que restou, descartando as demais letras. Esta é a tira final de Astolfo.\n\n\n\nAstolfo percebeu que pode haver mais de uma forma de realizar este procedimento de forma que a tira resultante contenha um anagrama de  M. Assim, ele escolheu  T  e  M  de maneira tal a esconder uma mensagem importante também nesse número de formas. Assim caso você também deseje saber qual é a mensagem de Astolfo, basta resolver o seguinte problema: dados T  e  M, calcule o número de maneiras distintas que Astolfo tem de cortar a tira com o procedimento descrito acima de forma que a tira final contenha ao menos uma ocorrência de um anagrama qualquer de  P.","id":"2578","category":"Ad-Hoc","statistics":{"level":"9 / 10","submissions":260,"solved":42,"ratio":"16.15%"}}