{"output":"Um número real arredondado para 4 casas decimais correspondente a experiência esperada a ser ganha por um mestre pokémon Ho.","input":"A entrada consiste de dois inteiros N (1 ≤ N ≤ 30) e P (1 ≤ P ≤ 106 )  que representam o número de pokémons no jogo, e o número de pokebolas disponíveis para o jogador. As próximas 2*N linhas temos uma string Si (1 ≤ |Si| ≤ 50 )(∀1 ≤ i ≤ N ) ,um inteiro Ri ( 1 ≤ Ri ≤ 104 )(∀1 ≤ i ≤ N ), um inteiro ei (1 ≤ ei ≤ 1000 )(∀1 ≤ i ≤ N ) e um real de 3 casas decimais pi ( 0.000 ≤ pi ≤ 0.900 )( ∀1 ≤ i ≤ N ) que representam  o nome do pokémon i, o número de probabilidades de escapar de uma batalha, a experiência obtida ao capturá-lo e a probabilidade do pokémon i quebrar a pokebola, respectivamente. Na próxima linha Ri números reais r{i, j} ( 0.000 ≤ r{i, j} ≤ 1.000 )( ∀1 ≤ i ≤ N )( ∀1 ≤ j ≤ Ri ) que representam a probabilidade do i-ésimo pokémon escapar da batalha após a j-ésima tentativa de captura. Lembre-se que a cada Ri tentativas, os valores se repetem.\n\nObservação: Não é garantido que se dois pokémons aparecerem com o mesmo nome na entrada, terão todos os valores associados iguais.","level":9,"name":"Mestre Pokémon Ho","has_images":false,"description":"Em Belo Horizonte, um jogo eletrônico tem tomado as ruas e praças da cidade: é o pokémon Ho.  A startup NlogNintendo que criou o jogo não esperava tamanho sucesso. E ela acabou de te contratar para que você descubra o melhor jeito de se tornar um mestre pokémon Ho.\n\nNo pokémon Ho, você possui pokebolas que capturam pokémons (criaturinhas do jogo). A cada vez que se captura um pokémon novo, ganha-se experiência, porém pokémons repetidos não. Um mestre pokémon Ho é um jogador que possui grande quantidade de experiência. E é por isso que  você deseja capturar os mais diversos tipos de pokémons que se é possível. Entretanto, essa não é uma tarefa fácil. Os pokémons, ao tentarem ser capturados, podem quebrar as pokebolas. Alguns com mais facilidade do que outros. De fato, para cada pokémon i temos uma probabilidade associada pi do pokémon quebrar a pokebola. Para não deixar alguns pokémons impossíveis de serem capturados, a NlogNintendo assumiu que pi ≤ 0.9. Ou seja, é garantido ao menos 10% de chance de capturar um pokémon. Além disso, após cada j-ésima tentativa falha, o pokémon i tem uma probabilidade r{i, j} de escapar da batalha. Se o pokémon escapar, não se pode tentar capturá-lo novamente. Como podem ter muitas tentativas, a NLogNintendo disponibiliza apenas Ri probabilidades de escapar para cada pokémon i. As probabilidades r{i, j}, 1 ≤ j ≤ Ri se repetem a cada Ri tentativas.\n\nA NlogNintendo te mandou a seguinte tarefa: Dado as probabilidades e as experiências de captura associado a cada pokémon e um número finito de pokebolas, encontre o valor esperado de experiência a ser obtido assumindo que o mestre pokémon Ho sempre joga de forma ótima.","id":"2580","category":"Ad-Hoc","statistics":{"level":"9 / 10","submissions":20,"solved":6,"ratio":"30.00%"}}