{"output":"Para cada caso de teste imprima o valor que representa, em minutos, o menor tempo possível para Rafael sair do cais da ilha, recolher o tesouro e retornar ao cais. Você deve desprezar o tempo gasto por Rafael para pegar parte do tesouro e atravessar uma caverna.","input":"A entrada é composta por vários casos de teste. A primeira linha de um caso de teste possui dois inteiros N e M (1 ≤ N ≤ 100, 1 ≤ M ≤ N(N −1)/2), representando, respectivamente, o número de cavernas de um ilha e a quantidade de trilhas secretas. A segunda linha é composta por N inteiros, onde o i-ésimo número Xi representa a área da i-ésima caverna (1 ≤ Xi ≤ 105). Você pode assumir que haverá entre 1 e 15 números primos. Portanto, 1 ≤ K ≤ 15. As próximas M linhas possuem três inteiros A, B e C (1 ≤ A, B ≤ N + 1, A != B e 1 ≤ C ≤ 1000) indicando que existe uma trilha secreta entre as cavernas A e B e que são gastos C minutos para completar o trajeto. O valor N + 1 representa o cais da ilha, portanto, quando A ou B for igual N + 1 significa que existe uma trilha entre o cais e uma das cavernas. Você pode assumir que sempre será possível percorrer um caminho entre qualquer par de cavernas, ou entre o cais e qualquer caverna.","level":10,"name":"Caça ao Tesouro","has_images":false,"description":"O arquipélago da Nlogônia é formado por ilhas inabitadas e mal assombradas. Cada ilha possui um pequeno cais e N cavernas que são acessadas exclusivamente por M trilhas secretas. Em tempos passados, elas eram usadas por piratas para abrigar joias, bebidas e mercadorias obtidas após saques em cidades e navios. Com o fim dessa era, acredita-se que existam tesouros perdidos em algumas ilhas.\n\t\t\t\t\n\t\t\t\t\n\t\t\t\t\tPor questões de segurança, os piratas tinham um método bem curioso para guardar seus pertences. Para esconder um tesouro, escolhia-se uma única ilha. Em primeiro lugar, calculava-se a área de cada caverna. Por acreditarem que números primos traziam sorte, selecionava-se apenas cavernas cujo valor da área também fosse um número primo, totalizando K cavernas. Enfim, o tesouro era dividido em K partes iguais e distribuído ao longo das cavernas selecionadas.\n\t\t\t\t\n\t\t\t\t\n\t\t\t\t\tApós vasculhar destro¸cos de um antigo navio pirata, Rafael encontrou mapas descrevendo algumas ilhas onde possivelmente tesouros foram escondidos. Como Rafael reprovou a disciplina de algoritmos, ele pediu sua ajuda para escrever um programa em que dadas as características de uma ilha, determine o menor tempo possível para sair do cais, recolher o tesouro, ou seja, passar por todas as cavernas que contém partes do tesouro e em seguida, retornar ao cais.","id":"2628","category":"Ad-Hoc","statistics":{"level":"10 / 10","submissions":150,"solved":35,"ratio":"23.33%"}}