{"output":"Para cada caso de teste imprima Q linhas, onde a i-ésima linha é a resposta para a i-ésima consulta. Se for possível montar uma dupla com os estudantes indicados na consulta imprima o caractere ‘S’, caso contrário imprima o caractere ‘N’. Imprima uma linha em branco ao final de cada caso de teste.","input":"A entrada é composta por vários casos de teste. A primeira linha de um caso de teste possui três inteiros N, M e Q (2 ≤ N ≤ 104, 0 ≤ M ≤ 105, 1 ≤ Q ≤ 103), representando, respectivamente, o número de alunos, as relações de amizade entre os estudantes e o número de consultas. As próximas M linhas possuem dois inteiros X e Y (1 ≤ X, Y ≤ N e X != Y) indicando que o aluno X tem uma relação direta de amizade com o aluno Y. Em seguida, cada uma das próximas Q linhas descreve uma consulta com dois inteiros A e B (1 ≤ A, B ≤ N e A != B), indicando os estudantes de uma possível equipe.","level":9,"name":"Formando Duplas","has_images":false,"description":"Roberto é um dos grandes professores que compõem o corpo docente da universidade de sua cidade. Treinar seus alunos para a maratona de programação é uma de suas maiores paixões, apesar de ser uma tarefa bem difícil. Felizmente, neste semestre, vários alunos se inscreveram para sua disciplina de programação competitiva.\n\t\t\t\t\n\t\t\t\t\n\t\t\t\t\tPara treinar seus alunos, Roberto costuma aplicar testes e provas regularmente, onde sempre divide sua turma em diferentes duplas, já que neste ano, as equipes da maratona de programação serão formadas por apenas dois integrantes.\n\t\t\t\t\n\t\t\t\t\n\t\t\t\t\tAo longo do semestre, analisando os resultados das avaliações e o comportamento dos estudantes em sala de aula, Roberto percebeu que se os alunos escolhidos para formar uma dupla não têm afinidade, o desempenho da equipe é bem inferior em relação às duplas formadas por alunos que apresentam tal comportamento. Podemos dizer que dois estudantes A e B possuem afinidade caso pertençam ao mesmo grupo de amigos, ou seja, caso possuam uma relação direta de amizade, ou se é possível escrever uma sequência de alunos X1, X2, X3, ... , XN , onde para todo i < N exista uma relação direta de amizade entre os alunos Xi e Xi+1, com X1 = A e XN = B.\n\t\t\t\t\n\t\t\t\t\n\t\t\t\t\tA maratona de programação se aproxima e Roberto decidiu que montará duplas compostas apenas por alunos que possuem afinidade. Desta forma, as equipes de sua universidade serão mais competitivas, aumentando as chances de classificação para a próxima fase. Como a turma está abarrotada de alunos, ele pediu para você escrever um programa em que dadas as relações de amizades entre os alunos e uma série de consultas indicando dois estudantes, determine para cada consulta se é possível montar uma dupla com estes dois alunos.","id":"2631","category":"Iniciante","statistics":{"level":"9 / 10","submissions":1355,"solved":173,"ratio":"12.77%"}}