{"output":"Para cada caso de teste deve ser impressa a mensagem “Experimento #e:”, seguida de uma quebra de linha, onde e é o número do caso de teste (cuja contagem tem inı́cio com o número um). Para cada comando Q deve ser impressa uma linha com a mensagem “w1/y1 a w2/y2\": dados consistentes\" ou “w1/y1 a w2/y2: dados corrompidos”, onde w1, w2 representam as semanas (com dois dı́gitos e com zeros à esquerda, se necessário) e y1, y2 representam os anos (com quatro dı́gitos e com zeros à esquerda, se necessário) do intervalo solicitado. Para cada comando M a mensagem deve ser “Maior periodo consistente: w1/y1 a w2/y2”. Cada mensagem associada a um comando deve estar em uma única linha e dois casos de teste sucessivos devem estar separados por uma linha em branco.","input":"A entrada consiste em T (1 ≤ T ≤ 10) casos de teste, onde o valor de T é dado na primeira linha da entrada. Cada caso de teste é representado por várias linhas: a primeira linha contém a semana w (1 ≤ w ≤ 52) e o ano y (1 ≤ y ≤ 2015) onde o experimento teve inı́cio (isto é, onde foi feito o primeiro registro). Considere, para este problema, que cada ano é composto de exatamente 52 semanas. A segunda linha contém o número N (1 ≤ N ≤ 105) de semanas consecutivas que tiveram matrizes de transição registradas. As N linhas seguintes contém, cada uma, quatro valores inteiros a11 , a12 , a21 , a22 (−100 ≤ aij ≤ 100), representando os coeficientes de transição da matriz At (1 ≤ t ≤ N). Em seguida, há uma linha com o número M (1 ≤ M ≤ 105) comandos a serem executados. As M linhas seguintes contém os comandos, seguindo a formatação a seguir:\n\t\t\t\t    \n\t\t\t\t        1. “Q a b”, com 1 ≤ a ≤ b ≤ N, onde a e b são os números da semana inicial e final do intervalo que deve ser consultado com o intuito de verificar se há ou não matrizes corrompidas neste intervalo;\n                        2. “Ut a11 a12 a21 a22”, com 1 ≤ t ≤ N, onde t é o número da semana que deve ter a matriz substituı́da pela matriz com os coeficientes a ii dados nesta linha;\n                        3. “M”, que é o comando que retorna o maior intervalo de tempo onde todas as matrizes consecutivas do intervalo são consistentes (isto é, tem determinante diferente de zero).\n\t\t\t\t    \n\t\t\t\t\n\t\t\t\t\n\t\t\t\tObservação: haverão no máximo 103 comandos do tipo ‘M’.","level":9,"name":"Em Prol da Ciência","has_images":false,"description":"Um grupo de cientistas vem mantendo uma pesquisa abrangente sobre o comportamento de bactérias, mais especificamente seu ciclo de reprodução e evolução.\n                \n                    \n                    Os dados estavam registrados por semanas, e a cada semana era realizada uma série de experimentos para determinar uma matriz de transição At , de dimensões 2 x 2, de modo que as informações do vetor ut da semana t pudesse se computado através da expressão ut= At ut-1, sendo o valor inicial u 0 conhecido. Contudo, às vésperas da publicação deste resultados em uma importante revista cientı́fica, uma descarga elétrica corrompeu os discos rı́gidos onde estavam armazenadas as matrizes!\n\t\t\t\t\n\t\t\t\t\n\t\t\t\t\tA equipe começou um árduo trabalho de tentar recuperar tais informações em tempo hábil. Logo ficou claro que algumas das matrizes recuperadas tinham determinante igual a zero, o que apontava que os dados estavam corrompidos, pois todas as matrizes de transição devem ter determinante não nulo.\n\t\t\t\t\n\t\t\t\t\n\t\t\t\t    Auxilie a equipe escrevendo um software que, dadas as matrizes de transição recuperadas de N semanas, permita:\n\t\t\t\t\n\t\t\t\t\n\t\t\t\t    1. Saber se todas as matrizes de um intervalo de tempo estão consistentes ou se há alguma matriz corrompida;\n                    2. Atualizar a matriz A t de uma determinada semana;\n                    3. Determinar o maior intervalo de tempo onde todas as matrizes consecutivas são consistentes.","id":"2634","category":"Ad-Hoc","statistics":{"level":"9 / 10","submissions":84,"solved":13,"ratio":"15.48%"}}