{"output":"Para cada caso de teste, imprima uma única linha com a resposta.","input":"A entrada é composta por vários casos de teste e termina com fim de arquivo. A primeira linha de um caso de teste contém os inteiros M, V, E, C, e L. Cada uma das próximas M linhas descreve um ataque. Cada linha é composta pelos inteiros v e w, que são respectivamente o dano causado pelo ataque e o custo de mana do ataque. Cada uma das próximas E linhas descreve um caminho. Cada linha é iniciada com quatro inteiros a, b, m, and l. O caminho conecta os locais a e b. Os próximos m inteiros são os pontos de vida h de cada um dos m monstros que aparecem no caminho. Se o inteiro l for zero, então o caminho está inicialmente aberto. Caso contrário, ele é liberado pela alavanca de rótulo l. Há no máximo um caminho conectando um par de locais. Cada uma das próximas C linhas descreve uma moeda. Para 1 ≤ i ≤ C, a i-ésima linha contém um inteiro u, o rótulo do vértice em que está a moeda de rótulo i. Cada uma das próximas L linhas descreve uma alavanca. Para 1 ≤ i ≤ L, a i-ésima linha contém um inteiro u, o rótulo do vértice em que está a alavanca de rótulo i.","level":10,"name":"Casa do Batera","has_images":false,"description":"A casa do Batera é um lugar onde muita coisa acontece. É lá que surgem ideias como “bora pra chapada, neném?? — Dudu”. É também um lugar onde muita gı́ria jovem é usada, como “pô deivis, mas bem que seria bom...”, ou “beeeeeem...”. E é também onde muitos apelidos são criados, como “Pimenta Filosofal”, “Pai Alan”, “Jonny Boy”, “Pimenta Marinho” e o melhor apelido de todos: “João Henrique”.\n\t\t\t\t\n\t\t\t\t\n\t\t\t\t\tA rapaziada está jogando o RPG inventando por Dôdo e Leo. O jogo consiste em capturar monstros, treiná-los e usá-los em batalhas. Neste momento, estamos entrando em uma mapa em que há diversos locais “neutros”, rotulados de 1 a V . Em cada local, é possı́vel que haja uma moeda e/ou uma alavanca. Sempre que passamos por um local com uma moeda, coletamos a moeda, e não aparece outra moeda no mesmo local se voltarmos a ele mais tarde. Sempre que passamos por um local com uma alavanca, acionamos a alavanca, e nunca mais precisamos acioná-la novamente. Cada alavanca abre um conjunto de caminhos que conectam pares de locais neutros. Alguns caminhos já estão inicialmente abertos. Para atravessar cada caminho, precisamos derrotar (ou capturar, se quisermos nos tornar mestres) os monstros que aparecem neste caminho. Monstros sempre surgem ao atravessar qualquer caminho, então sempre é preciso derrotá-los, mesmo passando por um caminho que já atravessamos antes. Para derrotar um monstro, usamos os monstros que já capturamos. Nossos monstros possuem uma lista de M ataques, cada um com um custo de mana e um valor de dano que é causado ao monstro alvo. Estamos no local 1 e a saı́da do mapa está no local V . O local 1 não contém moeda ou alavanca.\n\t\t\t\t\n\t\t\t\t\n\t\t\t\t    Como este é um jogo sério, que tem que ser levado a sério, João Henrique, que virou fã da teoria dos grafos após cursar a disciplina do Professor Claus, está tentando otimizar a nossa travessia. Ele pediu a sua ajuda para calcular o custo mı́nimo (de mana) necessário para realizar a travessia, coletando todas as moedas e... não capturando nenhum monstro (pô Jonny, tá achando que o balão é esférico e sem atrito? É assim que você quer se tornar um mestre capturador de monstros, João Henrique?).","id":"2637","category":"Grafos","statistics":{"level":"10 / 10","submissions":24,"solved":4,"ratio":"16.67%"}}