{"output":"Mostre o número máximo de caixas que podem ser roubadas sem serem detectadas.","input":"A primeira linha de entrada contém dois inteiros r (1 ≤ r ≤ 100) e c (1 ≤ c ≤ 100), o número de linhas e colunas na grade, respectivamente. Cada uma das seguintes linhas r contém c inteiros, as alturas (em caixas) das pilhas na linha correspondente. Todas as alturas estão entre 0 e 109 inclusive.","level":9,"name":"Missão Improvável","has_images":true,"description":"É um dia ensolarado na primavera e você está prestes a encontrar com Patrick, um amigo íntimo e ex-parceiro do crime. Patrick perdeu a maior parte do seu dinheiro apostando em competições de programação, então ele precisa fazer outro trabalho. Por causa disso ele precisa de sua ajuda, mesmo que você tenha se aposentado da vida do crime. Você está relutante no início, ja que você não tem a mínima vontade de retornar às suas antigas formas criminais, mas você imagina que não há mal em ouvir o plano de seu amigo.\n\nHá um carregamento de widgets caros em um armazém próximo e Patrick pretende roubar o quanto ele puder. Isso implica em encontrar um caminho para dentro do prédio, icapacitar os protetores de segurança, passar através de vários arrays de raios laser - você sabe, as técnicas habituais de roubo. No entanto, o coração do armazém foi equipado com um sistema de segurança que Patrick não pode desabilitar. É aqui que ele precisa de sua ajuda.\n\nO carregamento é armazenado em grandes caixotes cúbicos, todos os quais têm as mesmas dimensões. As bancas são empilhadas em pilhas organizadas, formando uma grade tridimensional. O sistema de segurança tira fotografias das pilhas uma vez por hora usando três câmeras: uma câmera frontal, uma câmera lateral e uma câmera superior. A imagem da câmera frontal mostra a altura da pilha mais alta em cada coluna, a imagem da câmera lateral mostra a altura do pilha mais alta em cada linha, e a imagem da câmera superior mostra se cada pilha está vazia ou não. Se o sistema de segurança detecta uma alteração em qualquer uma das imagens, soa um alarme.\n\nUma vez que Patrick está dentro, ele irá determinar as alturas das pilhas e enviá-las para você. A Figura C.1 mostra uma Layout possível da grade e a visão de cada uma das câmeras.\n\n\n\nFigura 1: Grade de alturas e as visualizações de câmera correspondentes.\n\n\n\nFigura 2: Possível grade de alturas após o choque.\n\nPatrick quer roubar tantos caixotes quanto possível. Como ele não pode desativar o sistema de segurança, ele planeja Enganá-lo arrumando as caixas restantes em pilhas para que o próximo conjunto de imagens da câmera seja o mesmo. No exemplo acima, é possível roubar nove caixotes. A Figura C.2 mostra uma possível configuração pós-roubo que parece idêntico ao sistema de segurança.\n\nPatrick pede-lhe para ajudá-lo a determinar o número máximo de caixas que podem ser roubadas, deixando uma configuração de caixas que enganarão o sistema de segurança. Você o ajudará a conseguir esse trabalho final?","id":"2640","category":"Geometria Computacional","statistics":{"level":"9 / 10","submissions":162,"solved":11,"ratio":"6.79%"}}