{"output":"Mostre o número total máximo de dólares que você pode ganhar. Se não houver nenhuma maneira de assinar contratos que lhe ofereçam lucros, mostre 0.","input":"A primeira linha de entrada contém dois inteiros m e n (1 <= m; n <= 500 000) indicando o número de empresas produtoras e consumidoras no mercado, respectivamente. Seguem-se linhas m, cujo ith contém dois inteiros pi e di (1 <= pi; di <= 109), o preço (em dólares) no qual o i-ésimo produtor vende um widget e o dia em que o primeiro widget estará disponível nesta empresa. Em seguida, siga n linhas, sendo que o jth contém dois inteiros qj e ej (1 <= qj; ej  <= 109), o preço (em dólares) no qual o jth consumidor está disposto a comprar widgets e o dia imediatamente após o dia em que o último widget deve ser entregue a esta empresa.","level":10,"name":"Dinheiro por Nada","has_images":false,"description":"Neste problema, você estará resolvendo um dos desafios mais difíceis da humanidade em todo o mundo desde o início dos tempos - como ganhar muito dinheiro.\n\nVocê é um intermediário no mercado de widgets. Seu trabalho é comprar widgets de empresas produtoras de widgets e vendê-los para empresas de consumo de widgets. Cada empresa de consumo de widgets possui um pedido aberto para um widget por dia, até uma data de término, e um preço no qual está disposto a comprar os widgets. Por outro lado, cada empresa produtora de widgets possui uma data de início na qual pode começar a entregar widgets e um preço no qual ele irá entregar cada widget.\n\nDevido a leis de concorrência leal, você pode assinar um contrato com apenas uma empresa produtora e apenas uma empresa de consumo. Você vai comprar widgets da empresa produtora, um por dia, a partir do dia em que pode começar a ser entregue e terminando na data especificada pelo cliente. Em cada um desses dias você ganha a diferença entre o preço de venda do produtor e o preço de compra do consumidor.\n\nSeu objetivo é escolher a empresa de consumo e a empresa produtora que maximizarão seus lucros.","id":"2641","category":"Ad-Hoc","statistics":{"level":"10 / 10","submissions":53,"solved":7,"ratio":"13.21%"}}