{"output":"Para cada uma das Q consultas imprima \"S\" se a pessoa pode competir ou \"N\" caso contrário.","input":"A primeira linha contém três inteiros N,M e Q (1 ≤ N, M, Q ≤ 104) representando respectivamente o número de pessoas, quantas ligações existem entre essas pessoas e quantas consultas serão realizadas. Cada uma das N linhas seguintes contém uma string S (1 ≤ |S| ≤ 10) e um inteiro V (0 ≤ V ≤ 10) representando respectivamente o nome da pessoa e seu nível de programação. As próximas M vão conter duas strings S1 e S2 (1 ≤ |S1|, |S2| ≤ 10), representando que a pessoa S1 e S2 estão no mesmo cluster. As próximas Q linhas vão conter uma string T (1 ≤ |T| ≤ 10) que representa o nome da pessoa que pretende participar da competição.\n\nAs strings serão compostas apenas de letras maiúsculas e minusculas.","level":10,"name":"Sensate","has_images":false,"description":"Sensates, ou Homo sensoriums, são uma espécie de humanos que são conectados telepaticamente com outras pessoas pelo mundo. Um grupo de sensates é chamado de cluster, e os membros de um cluster podem contactar um ao outro independente de onde eles estiverem no mundo. Após saber dos sensates os organizadores de maratonas de programação ficaram muito preocupados, pois mesmo que uma pessoa não saiba programar, se alguém do seu cluster souber ela irá se sair bem na competição mesmo sem saber nada. Por causa disso os organizadores de maratonas criaram novas regras para determinar se uma pessoa poderá participar de uma competição ou não.\n\nPrimeiramente cada pessoa no planeta irá receber uma nota de um a dez, com o intuito de medir quão bem ela programa. Após isso para a pessoa participar ela terá que se encaixar em uma das categorias abaixo:\n\n1. Não ser um sensate.\n\n2. Ser um sensate e não ter ninguém no mesmo cluster com nível de programação maior que cinco.\n\n3. Ser um sensate e ter seu nível de programação maior ou igual a 5.\n\nDesenvolva um programa que consiga determinar se uma pessoa poderá ou não participar de competições de programação.","id":"2657","category":"Grafos","statistics":{"level":"10 / 10","submissions":544,"solved":109,"ratio":"20.04%"}}