{"output":"Para cada caso de teste, espera-se em uma linha única o valor da resistência equivalente com três casas decimais.","input":"A entrada contém vários casos de testes, cada caso de teste ocupa uma linha de no máximo 300 símbolos (não existe espaço em branco) e representa uma expressão válida de associação de resistores, onde cada valor de resistor é representado por um inteiro R (0 < R < 10000). O fim dos casos de testes coincide com o fim das entradas.","level":8,"name":"Resistores Série e Paralelo","has_images":true,"description":"Uma associação de resistores sempre resulta em um resistor equivalente. Esta associação pode ser em paralelo, em série ou híbrida. Veja exemplo de uma associação em paralelo:\r\n\r\n                \r\n\r\nEsta associação em paralelo é equivalente a um resistor de 10Ω. Também podemos considerar associações em série, como o exemplo abaixo, que resulta em uma resistência equivalente de 40Ω.\r\n\r\n                \r\n\r\nPor fim, uma associação híbrida, com série e paralelo. A associação abaixo resulta em 50Ω.\r\n\r\n                \r\n\r\nPara melhor representar uma associação vamos considerar a resistência equivalente Req de uma associação em série entre os resistores R1 e R2 representada como: Req = R1 - R2. Da mesma forma para a associação em paralelo: Req = R1 | R2. Não existe precedência entre as associações, exceto quando explícito por parêntesis, por exemplo: R1 - R2 | R3 é equivalente a (R1 - R2) | R3, e R1 | R2 - R3 é equivalente a (R1 | R2 - R3. Estes dois circuitos podem ser desenhados, respectivamente, como:\r\n\r\n                \r\n\r\nDesta forma uma associação híbrida é representada por uma expressão que segue a seguinte regra, considerando R o valor nominal de uma resistência em Ohms (Ω):\r\n\r\nexp := R;\r\nexp := exp - exp;\r\nexp := exp | exp;\r\nexp := ( exp ).\r\n\r\nO circuito híbrido da terceira figura acima poderia ser representado pela expressão:\r\n\r\nReq = 20 - (20 | 20) - 20 = 50\r\n\r\nA você foi solicitado um programa onde, dada a expressão de uma associação, calcule a resistência equivalente.","id":"2673","category":"Ad-Hoc","statistics":{"level":"8 / 10","submissions":109,"solved":35,"ratio":"32.11%"}}