{"output":"Como no exemplo dado, verifique se a tag foi usada corretamente. Seu programa deve informar \"Successful!!\" se a sintaxe estiver certa ou \"error\" se estiver faltando alguma coisa. A mensagem deve ser exibida sem as aspas, com o quebra linha no final.\n ","input":"A entrada contém um inteiro  0 < N < 100 que indica o número situações a serem verificadas. As N linhas seguintes correspondem as situações, cada uma com um inteiro K (0 ou 1) (que será o meio de identificação da(s) tag) e logo em seguida vem uma linha com o código S (0 > S < 200) a ser verificado.","level":10,"name":"Ajude o Professor Webscript!!","has_images":false,"description":"O Professor  Webscript, um dos renomados professores do Instituto Federal de Muzambinho ensina seus alunos a desenvolverem sites totalmente responsivos e práticos, sem a necessidade de  frameworks. Ele auxilia os mais diversos tipos de alunos de toda a escola, mas cansou de ensinar a sintaxe correta das tags(\">\" fechar e \"<\" abre ), de maneira correta. Então, para voltar a paz e a tranquilidade que tinha, ele solicita sua ajuda. Haverá diversos tipos de tag, não é necessário textos entres os sinais das tags, seu programa deverá indicar se uma tag foi usada corretamente ou não. Não esqueça que seu programa deverá seguir alguns critérios como no exemplo abaixo.\n\nI - O primeiro parâmetro indica o tipo da tag:\n1 - Quando a tag é única.\n0 - Quando a tag possui dois pares de sinais;\n\nII - Os sinais como \">\" ou \"<\" só deverão ser usados para indicar o fechamento ou a abertura de uma tag:\n0 <p> Home>Download>Sublime <\/p> -> error\n1 <input type=\"text\" name=\"Next >\"> -> error\n0 <ul><li>Ola<\/li><\/ul> -> Successful\n1 <span><br> -> certo\n0 <><\/li> -> error \n\nQuando inserimos  o parâmetro, só existiram tags do padrão escolhido, por exemplo: se colocarmos 0(Quando a tag possui dois pares de sinais) o programa só vai verificar tags com dois pares de sinais, a mesma coisa acontece quando colocamos 1(Quando a tag é única). Então em uma única tag não haverá os dois tipos.","id":"2684","category":"Ad-Hoc","statistics":{"level":"10 / 10","submissions":458,"solved":28,"ratio":"6.11%"}}