{"output":"Imprima a linha e a coluna da cadeira, \"linha > x coluna > y\", sem aspas, onde a média dos adjacentes dela sejam menor que a altura de WBJ e a distância até a saída seja a mínima possivél.","input":"O programa pede um inteiro A (50 < A < 100) referente a altura de WBJ. Em seguida um breve raio-x de 13x13 do refeitório é informado. Nele contém os possíveis locais onde ele pode se sentar (0), a saída [Linha 1 | Coluna 8], as paredes (88), o patio (11), e os corredores(99). A saída será por EOF.","level":10,"name":"Escolhendo um Lugar","has_images":true,"description":"As refeições do refeitório do Instituto Federal do Sul de Minas (IF), campus Muzambinho são uma delícia, todos os dias os estudantes esperam ansiosamente para degustar suas delícias. Webscrit Junior (WBJ), sempre é um dos últimos da fila e encontra o refeitório quase lotado, só com algumas cadeiras vagas. Como WBJ é muito observador ele anda pelos corredores, procurando lugares disponíveis para sentar. Um lugar onde ele possa sentar é a cadeira disponível onde a média da altura das pessoas adjacentes daquele lugar seja menor que o tamanho de WBJ e sempre o mais perto da saída (que se encontra na linha 1 coluna 8, indicado na figura pelo numero 77. O número 77 foi adicionado apenas para facilitar a visualização). Todo esse cuidado para depois correr nos espaços livre, e não perder nenhum segundo da sua matéria preferida (AED).\n\nAbaixo temos um exemplo do refeitório vazio:\n\n\n\nAtenção:\n- A prioridade é a cadeira que tenha a média dos adjacentes menor que a altura e o menor caminho até a saída;\n- Não existem lugares disponíveis nas paredes (88), nos espaços fora do refeitório (11) ou nos últimos lugares da mesa (nas quinas); não se tem uma boa visualização do refeitório sentando nas quinas;\n- A cada cadeira que WEJ passa é considerado 1 passo;\n- Não haverá empates, sempre terá uma cadeira que atende os requesitos;\n- Os \"00\" da figura servem para mostrar onde as cadeiras ficam, APENAS para facilitar visualização;\n- A saída do refeitório é fixa, sendo sempre na posição [Linha 1 | Coluna 8]. Na imagem, essa cordenada contém o numero 77 apenas para facilitar a visualização do refeitório.\n- Assim como a saída é sempre fixa o tamanho do refeitório (13x13) também é fixo;\n- Os adjacentes da cadeira são todas as cadeiras que estão ao redor;\n- A saída (1,8) será sempre uma parede;\n\nPegando a entrada abaixo como exemplo temos:\n-  Cadeira 1 com posição (L = 3 | C = 3);\n-  Cadeira 2 com posição (L = 6 | C = 6);\n-  Cadeira 3 com posição (L = 8 | C = 12);\n* a contagem começa apartir do um.\n\nSuponhamos que a cadeira 1 e 2, citadas a cima (como base), atende os critérios da média de seus adjacentes. Podemos concluir que a cadeira 1 está mais perto da saída do que a cadeira 2, pois o número de cadeiras que WBJ irá passar até a saída é menor. E é mais perto que a cadeira 3(L = 8 | C = 12) que além de estar na quina da mesa (um local considerável) está longe da saída.\n\nEnquanto está na fila, WBJ resolveu te ligar para que rapidamente o ajude na escolha do melhor lugar.","id":"2688","category":"Grafos","statistics":{"level":"10 / 10","submissions":131,"solved":9,"ratio":"6.87%"}}