{"output":"Com isso pediu para você ver as possíveis maletas. Exiba uma mensagem \"Possíveis maletas: \" e logo em seguida as maletas selecionadas, separadas por \",\" e no final um \";\" e o quebra linha.","input":"WBJ deixou P listas com uma área 3x3, onde ele tem certeza que a maleta premiada estará nela. São três linhas, cada linha com três números inteiros menores que 100.","level":3,"name":"Jogo do Mião","has_images":false,"description":"A muito tempo acontece o secreto jogo do mião. Dizem que o jogo é chato e muito difícil pois ninguém conseguiu ganhar o famoso prêmio, mas mesmo assim Webscript Junior (WBJ) decidiu tentar. O jogo funciona da seguinte maneira: um espantalho mostra um quadro com maletas, onde só haverá uma maleta com o mião. Nem mesmo o espantalho lembra em qual maleta o guardou e WBJ só tem uma oportunidade de levar esse \"MIÃO!\" para casa. WBJ pegou o índices das maletas que já foram escolhidas por outros jogadores para ver se existia algum padrão.\n\nApós várias e várias pesquisas, WBJ concluiu que a maleta premiada estava em uma i-ésima posição de uma sequência, então ele apresentou o jogo para alguns amigos para ver como o jogo e o espantalho se comportavam a cada jogada e com isso obter mais informações para sua pesquisa. A informação mais relevante é que, além de sorte, as maletas onde a subtração dos índices é diferente da diferença que mais se repete, serve como padrão para definir quais são as possíveis maletas premiadas.\n\nPara uma precisão mais correta WBJ pediu sua ajuda, ele quer um programa que gere uma listas com os índices das maletas onde possivelmente estaria o prêmio. Ele te da 9 maletas em um grid(3x3), seu programa gera a lista e ele só precisa acertar o número da maleta, dentro das possíveis maletas que ele teria como referência gerada pelo seu programa.\n\nPor exemplo:\nVamos supor que as maletas que WBJ escolheu foram:\n78 7 8\n9 7 8\n8 7 9\n\nA diferença é calculada da seguinte forma: o primeiro elemento é calculado com o próximo, e os outros dois com o seu anterior ignorando o sinal, desse modo a diferença entre as maletas fica assim:\n\n71 71 1\n2 2 1\n1 1 2\n\nO primeiro número é resultado de 78 menos 7, o segundo é 7 menos 78, e o terceiro é 8 menos. O processo se repete nas demais linhas. Então concluímos que a diferença que mais se repete é o número 1. O próximo passo é verificar se a diferença entre os números não é a que mais se repete. A diferença para o primeiro número é calculado com o segundo e terceiro, a diferença do segundo número é calculado com o primeiro e o último, logo a diferença do último com os dois anteriores. Caso o resultado dessas diferenças seja 1, o número não é exibido, por exemplo: o segundo número menos o terceiro das maletas que WBJ lhe deu é igual a 1, então o segundo numero não é valido e a mesma coisa acontece com o terceiro. O resultado final fica assim:\n\nPossiveis maletas: 78;","id":"2689","category":"Ad-Hoc","statistics":{"level":"3 / 10","submissions":115,"solved":55,"ratio":"47.83%"}}