{"output":"Imprima uma única linha com a descrição da operação que possibilita o seu amigo ganhar o jogo ou um “*” (asterisco) se não existe maneira de ganhar. A descrição da operação deve seguir o formato mostrado no enunciado, i.e. “-x”, “+x” ou “-x +y”.","input":"A primeira linha contem dois inteiros K (3 ≤ K ≤ 1000) e N  ( 1 ≤ N≤ 104), indicando respectivamente o inteiro que Naebbirac escolheu para começar o jogo e o comprimento da sequencia escrita no convés. A segunda linha contem N inteiros S1, N2,…,SN (1 ≤ S i ≤ K for i = 1, 2, . . . , N) representando a sequência escrita; você pode seguramente assumir que a sequência não está completa.","level":7,"name":"Sequencia Completa de Naebbirac","has_images":false,"description":"Naebbirac é um jovem marinheiro que se entedia facilmente. Ele gosta de sequências de inteiros, e desenvolveu modos de classifica-las. Naebbirac diz que toda a sequência é completa para um dado inteiro K, se a sequência apenas contem inteiros entre 1 e K, e que cada inteiro entre 1 e K aparece o mesmo número de vezes.\r\n\r\nBaseado nisso, Naebbirac criou um jogo para entreter a si e aos seus colegas quando as águas estão calmas e não muito o que possam fazer para passar o tempo no meio do oceano.\r\n\r\nPrimeiro ele escolhe um inteiro positivo K e então ele usa giz para desenhar no convés uma sequência S contendo N inteiros entre 1 e K. Após isso ele desafia algum de seus camaradas. O objetivo do desafio é transformar a sequência S em uma sequência completa executando uma das três seguintes operações:\r\n\r\n\r\n\t”-x” : remove uma das ocorrências do inteiro x de S;\r\n\t”+x”: adiciona um novo inteiro de valor x em S; ou\r\n\t”-x +y”: substitui uma ocorrência do inteiro x de S por um inteiro de valor y.\r\n\r\n\r\nNaebbirac é bem esperto. Ele nunca escreve uma sequência já completa e frequentemente escreve inteiros que não seguem padrão algum, tornando bem difícil encontrar uma operação que resolva o enigma. Um de sus amigos, que frequentemente navega com Naebbirac, está cansado de sempre perder o jogo. Você é capaz de ajudar seu amigo e criar um programa que ache a solução ao enigma proposto antes que eles voltem a velejar?","id":"2697","category":"Strings","statistics":{"level":"7 / 10","submissions":572,"solved":201,"ratio":"35.14%"}}