{"output":"Imprima uma única linha com um inteiro D, que não comece com zeros, indicando o menor múltiplo de N que possua |S| dígitos e cujos dígitos em S coincidam com os dígitos correspondentes em D. Caso não exista tal inteiro D, imprima um “*” (asterisco) para a saída.","input":"A entrada consiste de uma única linha que contem uma string S não vazia com no maximo 1000 caracteres e um inteiro N (1 ≤ N ≤ 1000). Cada caractere de S é ou um digito ou o caractere “?” (question mark); o digito mais à esquerda não é “0” e no mínimo um caractere de S é “?”.","level":5,"name":"Enigma","has_images":false,"description":"O famoso pirato Cornelius “Cabeça Queijosa” Bakker foi um renomado astrônomo e matemático. Ele enterrou a maioria de seus tesouros na ilha caribenha de São Basil, onde o Pico Colombo é um conhecido marco geográfico. Cabeça Queijosa desapareceu quando sua frota de três navios foi pega em um furacão em 1617. Talvez por algum tipo de premonição, antes de sua excursão fatal, ele escreveu em uma carta para uma de suas sobrinhas na Holanda a distância exata ao seu tesouro oculto, partindo Pico Colombo em direção sul.\r\n\r\nPreocupado que seu mapa pudesse acabar nas mãos erradas, “Cabeça Queijosa” usou suas habilidades em matemática como seguro contra ladrões. Em vez de escrever na carta o número indicando a distância, ele multiplicou-o por um segundo número N, e escreveu o resultado D na carta, junto com o valor de N e uma explicação de como o cálculo deveria ser feito. Ele sabia que mesmo se uma pessoa indesejada obtivesse a carta, ela deveria saber como dividir dois números, coisa que poucos criminosos conseguiam fazer naquele tempo. Infelizmente, quando a carta chegou em seu destino na Europa, a sobrinha de Cabeça Queijosa havia entrado em um convento e nem se importou em abrir a carta.\r\n\r\nExatamente quatro séculos após o ocorrido, Maria por ventura veio a obter um baú com os pertences de sua ancestral freira. E você pode imaginar sua surpresa quando ela descobriu a carta, ainda lacrada! Maria está planejando uma viagem para buscar o tesouro de Cabeça Queijosa, mas ela precisa de sua ajuda. Apesar do valor de N estar intacto e ela poder lelo, o número D foi parcialmente comido por traças de forma que apenas alguns dos dígitos estão visíveis . A única pista que Maria tem é que o digito mais à esquerda de D não é zero pois Cabeça Queijosa disse em sua carta.\r\n\r\nDada a representação parcial de D e o valor de N, você deve determinar o menor valor possível de D de forma que este seja um múltiplo de N e que não comece com zeros.","id":"2699","category":"Iniciante","statistics":{"level":"5 / 10","submissions":311,"solved":152,"ratio":"48.87%"}}