{"output":"Imprima uma única linha com um inteiro indicando o número de maneiras diferentes de padrões teste para o dado circuito. Devido à possibilidade deste número ser muito grande, imprima o resto de sua divisão por 109 + 7.","input":"A primeira linha contem um inteiro N (1 ≤ N ≤ 105 ) representando o número de portas no circuito, o qual possui forma de uma árvore binaria. Portas são identificadas por inteiros distintos indo de 1 a N, porta um sendo a raiz da árvore. Para i = 1, 2,…,N, o i-ésimo das próximas N linhas descreve a porta i com três inteiros X, Y e F (0 ≤ X, Y ≤ N e −1 ≤ F ≤ 1). Os valores X e Y indicam as duas entradas da porta. Se X = 0 a primeira entrada é proveniente de uma entrada externa, senão a entrada é a saída produzida pela porta X. Analogamente, se Y = 0, a segunda entrada é uma entrada externa, senão a entrada é a saída produzida pela porta Y. O valor de F representa o estado da porta: -1 significa que a porta está normal, 0 significa que ela está emperrada em 0, e 1 significa que a porta está emperrada em 1.","level":8,"name":"Portas da Incerteza","has_images":true,"description":"Uma porta NAND (porta AND negada) é um circuito digital que produz uma saída que é falsa apenas se todas as entradas são verdadeiras; em outras palavras, a saída de uma porta NAND é o oposto para a saída de uma porta AND para as mesmas entradas. A seguinte figura mostra o símbolo usual de uma porta NAND de duas entradas e sua tabela verdade resultante, usando 1 para verdade e 0 para falso.\r\n\r\n\t\t\t  \r\n\r\nNeste problema nos temos uma árvore binaria representado o circuito composto apenas por portas NAND de duas entradas. Em uma árvore, cada nó interno representa uma porta NAND, a qual usa como entrada os valores produzidos pelas suas filhas. Cada folha na árvore representa uma entrada externa ao circuito, e é um valor em {0, 1}. O valor produzido pelo circuito é o valor produzido pela porta na raiz da árvore. A seguinte imagem mostra um circuito com 9 nós, o dos quais 4 são portas NAND e cinco são entradas externas.\r\n\r\n\r\n\r\nCada porta no circuito pode estar emperrada, quer dizer que ela apenas produzem 0 ou apenas produzem 1 independente das entradas do portão. Um padrão teste é um array de valores associados às entradas externas de forma que o valore produzido pelo circuito está incorreto devido ao emperramento de uma das portas.\r\n\r\nDada uma descrição do circuito, você deve escrever um programa que determine o número de maneiras diferentes de escrever um padrão de testes para o circuito.","id":"2701","category":"Ad-Hoc","statistics":{"level":"8 / 10","submissions":116,"solved":44,"ratio":"37.93%"}}