{"output":"Imprima Q linhas, cada uma contendo um inteiro indicando a resposta da requisição correspondente feita pelo rei na entrada, isso é, o custo mínimo para reparar um conjunto de estradas ( incluindo a estrada especificada ) de forma que os Cubicunianos estejam aptos a viajar entre qualquer par de estradas usando apenas estradas reparadas.","input":"A primeira linha contem dois inteiros N (2 ≤ N ≤ 105 ) e R (N − 1 ≤ R ≤ 2 × 105 ), representando respectivamente o número de cidades e o número de estradas em Cubiconia. Cidades são identificadas por um inteiro de 1 a N. Cada uma das próximas R linhas descreve uma estrada com três inteiros A, B (1 ≤ A < B ≤ N) e C (1 ≤ C ≤ 104), indicando que existe uma cidade entre A e B e que o custo de reparo é C. Existe no máximo uma estrada entre cada par de cidades. A próxima linha contem um inteiro Q (1 ≤ Q ≤ 105 ) representando o número de estradas específicas que podem ser requisitadas pelo rei para concerto. Cada uma das próximas Q linhas descreve uma demanda com dois inteiros U e V (1 ≤ U < V ≤ N), indicando a estrada especifica a ser reparada. Não existem estradas requisitadas repetidas.","level":9,"name":"Estradas Imperiais","has_images":false,"description":"As estradas de Cubiconia estão em um estado lastimável, após anos de negligência e falta de manutenção. Cada estrada conecta duas cidades distintas A e B e podem ser viajadas em ambos os sentidos ( de A para B, ou de B para A). Existe no máximo uma estrada entre cada par de cidades, e usando as estradas existentes é possível viajar entre qualquer par de cidades. O novo imperador de Cubiconia aumentou os impostos (novamente!), mas prometeu reparar pelo menos algumas estradas de forma a garantir que todos os Cubiconianos estejam aptos a viajar entre quaisquer duas cidades usando apenas as estradas restauradas.\n\nO departamento de trabalhos públicos tem de calcular os custos de reparo individual de cada rodovia. Agora eles devem calcular o custo mínimo para reparar um ser de rodovias de forma que a promessa do imperador seja verdadeira. Isto não é facil pois o imperador quer que o conjunto de estradas reparadas contenha uma estrada especifica, mas ele ainda não decidiu qual estrada em particular seja inclusa: pode ser a cidade que conecta seu castelo a cidade que sua filha mora, ou a estrada que conecta seu palácio de verão a uma praia, ou ….Temendo que o imperador demore demais para decidir, os engenheiros querem sua ajuda.\n\nDada a descrição das rodovias de Cubiconia, com seus respectivos custos de reparo, você deve escrever um programa para responder uma série de entradas. Cada entrada ira determinar uma estrada especifica que deve ser reparada e deve determinar o custo mínimo para reparar o conjunto de estradas ( incluindo a estrada especificada ) de forma que os Cubiconianos estejam aptos a viajar entre todas as cidades usando apenas estradas reparadas.","id":"2703","category":"Grafos","statistics":{"level":"9 / 10","submissions":541,"solved":180,"ratio":"33.27%"}}