{"output":"Imprima uma linha com a letra maiúscula “Y” caso seja possível resolver o quebra-cabeça como descrito, e a letra “N” caso contrário.","input":"A primeira linha contem dois inteiros R e C (1 ≤ R, C ≤ 20), indicando respectivamente o número de linhas e colunas do quebra-cabeça. As próximas R linhas contem uma string S de caracteres C cada, representando a grade do quebra-cabeça; nessas strings, a letra minúscula “o” indica que a célula marcada com um ponto, enquanto um “-” (hífen) representa uma célula vazia. Existem no máximo 15 células marcadas com um ponto.","level":5,"name":"Mantenha Coberto","has_images":true,"description":"Eva ama quebra-cabeça. Ela recentemente comprou um quebra-cabeça que se provou ligeiramente difícil. O quebra-cabeça é feito de um retângulo com uma grade com R linhas e C colunas. Algumas células podem estar marcadas com um ponto, enquanto as outras estão vazias. Quatro tipos de peças vem com este quebra-cabeças, e existem R x C unidades de cada tipo.\n\n\n\nO objetivo do quebra-cabeça é usar algum tipo de peça que preencha a grade; isto é, que cada célula deve estar coberta com uma peça. Fazendo isso, cada peça pode ser rotacionada em 90, 180 ou 270 graus. Mas claro, para deixar mais interessante, existem algumas restrições que devem ser respeitadas:\n\n\n\tPeças do tipo 1 podem apenas serem usadas em células marcadas com um ponto, enquanto as demais peças podem apenas ser usadas nas células brancas.\n\tDado qualquer par de células compartilhando uma borda, a linha desenhada deve combinar.\n\t As linhas desenhadas pelas peças não podem encostar nas paredes externas da grade.\n\n\n\nComo Eva está tendo dificuldades para resolver o quebra-cabeça, ela começou a questionar-se se ele não teria sido feito de forma descuidada e nenhuma solução existe. Você pode dizer a ela se o quebra-cabeça pode ser resolvido?","id":"2705","category":"Ad-Hoc","statistics":{"level":"5 / 10","submissions":64,"solved":40,"ratio":"62.50%"}}