{"output":"mprima Q linhas, cada linha contendo um inteiro indicando o comprimento do trajeto mais curto usando um caminho alternado como descrito no problema para o percurso correspondente da entrada.","input":"A primeira linha contem um inteiro N (2 ≤ N ≤ 105 ) representando o número de ruas em cada direção. Para cada direção, as ruas são identificadas por inteiros distintos de 1 a N começando no canto S-O da cidade. A segunda linlha contem N – 1 inteiros D1, D2, . . . , DN−1 (Di ∈ {1, 5} para i = 1, 2, . . . , N − 1) indicando as distâncias entre as ruas consecutivas indo S-N ( isto é, Di é a distância entre as ruas i e a rua i+1). A terceira linha contem N -1 inteiros E1, E2, . . . , EN−1 (Ei ∈ {1, 5} para i = 1, 2, . . . , N − 1) indicando as distancais entre ruas consecuticas indo O-L ( isto é, Ei é a distância entre as ruas i e a rua i+1). A quarta linha contem um inteiro Q (1 ≤ Q ≤ 105 ) representando o número de percursos a serem calculados. Cada uma das próximas Q linhas descreve um percurso com 4 inteiros Ax, Ay, Bx e By (1 ≤ AX, AY , BX, BY ≤ N), indicando que o começo é o cruzamento em Ax, Ay e que o destino final é o cruzamento em Bx, By; os valores de Ax e Bx são ruas indo S-N enquanto os valores de Ay e By são ruas indo W-E. Não existem percursos iguais.","level":8,"name":"Linearville","has_images":true,"description":"A cidade de Linearville possui N ruas de mão dupla paralelas indo de Oeste para Leste e N ruas de mão dupla paralelas indo de Sul para Norte, formando uma grade com (N-1)x(N-1) blocos. A distancia entre duas ruas paralelas consecutivas é ou 1 ou 5. As Autoridades de Trânsito de Linearville estão conduzindo um experimento e requerem que todos os carros sempre sigam um caminho que alterne entre as direções O-L e S-N em todos os cruzamentos, significando que eles devem ou pegar a esquerda ou a direita quando chegam em um cruzamento. A ATL está desenvolvendo um novo aplicativo de navegação e precisa de sua ajuda para escrever um algoritmo que calcule a distância do menor caminho entre diversos pontos de partida e chegada. O caminho alternado da figura, um exemplo para N=10, claramente não é o caminho mais curto. Mas esteja avisado! Linearville pode ser enorme…","id":"2706","category":"Grafos","statistics":{"level":"8 / 10","submissions":55,"solved":20,"ratio":"36.36%"}}