{"output":"Para cada caso, você deverá imprimir o valor de E, caso o valor de E não obedeça a seguinte pripriedade [0, M - 1] deverá imprimir -1. Vamos lá! Ajudem Rangel!!","input":"São vários casos de teste. Cada caso de consiste de três inteiros B, N, M, onde B e N (0 < B, N < 105) e M é um número primo (2 < M < 109).","level":10,"name":"Destravando o Celular","has_images":false,"description":"Aquela aula criptografia e Rangel está com tédio.\r\n\r\n-Gu, Oh Gu! - Rangel chamando seu amigo.\r\n\r\n-Fala Brother! - Responde Gustavo ao seu amigo.\r\n\r\n-Me empresta seu celular? - Diz esperançoso o entendiado Rangel.\r\n\r\n-Não hahaha.. Você vai ficar comentando as postanges das minhas redes sociais – Diz o jovem Gustavo.\r\n\r\n- OK, :d! - Responde Rangel todo triste.\r\n\r\nGustavo é uma pessoa muito legal e não que ver seu amigo triste! Pesando nisso, chama Vânia e os dois bolam um desafio para diminuir o tédio de Rangel e fazer com que ele passe a gostar de criptografia!\r\n\r\n-Vamos lá, Rangel! Nos te desafiamos! - Diz Gustavo e Vânia ambos sorridentes.\r\n\r\n-Desafio? Que tipo de desafio? - Diz Rangel.\r\n\r\n-Não quer mexer no meu celular? Vamos lá, temos um desafio para para você!\r\n\r\nDeseja aceitar? - Indagam os dois.\r\n\r\n-Sim! Vamos lá! - Diz Rangel ainda mais curioso.\r\n\r\n-Ok! Vamos te explicar o desafio:\r\n\r\nVamos mudar a senha do celular e você deverá descobrir essa senha! Para descobrir não será uma terefa muito simples! Te daremos três número B, N e M e queremos que você descubra um quarto número. Esse quarto número será a senha do meu celular! Mas não pense que será fácil, para descobrir esse quarto número basta resolver a seguinte equação:\r\n\r\nBE = N mod M\r\n\r\nSimples, não? Estamos interessados que você descobrua o valor de E, garantimos pra você que o valor de E está no intervalo [0, M - 1] e que M é um número primo! Hahaha – Vamos lá, você precisa ser rápido! Pois você só tem o tempo da aula pra resolver!\r\n\r\n-Eu topo! Mas irei usar meu computador para me auxiliar - Diz Rangel, todo animado.\r\n\r\n-Ok! Mostre do que você é capaz! - Diz Gustavo e Vânia.\r\n\r\n-Vou te dar uma dica!Lembre-se Rangel, o valor está entre [0, M – 1] inclusive, se não estiver a resposta é -1! - Diz Vânia.\r\n\r\nRangel está preparado para o desafio e resolveu utilizar programação para ajudar nesse desafio. Ele pediu a sua ajuda para auxilia-lo no código. Vamos lá você vai deixar passar esse desafio?","id":"2711","category":"Matemática","statistics":{"level":"10 / 10","submissions":363,"solved":129,"ratio":"35.54%"}}