{"output":"Para cada caso, você deverá imprimir uma linha contendo o tempo mínimo que Rangel gastará para mantar todos os monstros da partida com quatro casas decimais.","input":"São vários casos de teste. Cada caso começa com três inteiros N, K, V, onde N (1 ≤ N ≤ 103) indica o número de salas que há na partida, K (0 ≤ K ≤ 100) indiciando a quantidade de mana que o poderoso Mago possui e V (1 ≤ V ≤ 104) indica o valor do dano constante do Mago nesta fase. As próximas N linhas possui dois inteiros X (1 ≤ X ≤ 105) indicando os pontos de vida no monstro na i-ésima sala e Di (1 ≤ Di ≤ 105) indicado o quando o dano será aumentado na i-ésima sala, caso o Mago possua mana e deseje utilizar.","level":6,"name":"O Mago é Implacável!","has_images":false,"description":"Em jogos de RPG existem diversas classes de personagens que os jogadores podem escolher assim que iniciam um jogo. Uma das classes que os jogadores mais costumam optar é do Mago, pois o Mago é implacável! O Mago é um tipo de personagem que domina as artes místicas e assim, possui um dano constante V que varia para cada partida, às vezes, caso o Mago tenha mana, ele pode aumentar o seu dano em um determinado valor, que depende do tipo de monstro que ele batalha.\r\n\r\nRangel está jogando um novo RPG e está tentando subir de nível rapidamente, para isso acontecer, ele precisa jogar bastante! Entretanto, está com pouco tempo, pois está atolado de livros que pegou emprestado com sua amiga Vânia para ler, além disso, é a época de provas e ele precisa estudar para passar. Então ele quer minimizar o tempo que ele gasta com jogo. Calma, vamos explicar como funciona o jogo!\r\n\r\nPrimeiramente esse RPG funciona da seguinte maneira, são várias partidas, e cada partida possui N salas, cada sala, possui um monstro com X pontos de vida. Para cada monstro, caso o Mago tenha mana, ele pode aumentar o valor do dano constante em Di unidades, o custo para aumentar o dano é fixo de 1 unidade de mana. Para saber o tempo que se gasta para matar um i-ésimo monstro, é a razão entre a quantidade de pontos de vida do monstro pelo dano que o Mago pode causar (obedencendo o que foi descrito no texto).\r\n\r\nLembrando que, para ganhar a partida, é necessário chegar ao final da partida. É sempre garantido que Rangel joga até o final da partida, além disso, ele só pode avançar para a próxima sala no quando ele mata o monstro guardião da sala que ele se encontra.","id":"2713","category":"Paradigmas","statistics":{"level":"6 / 10","submissions":100,"solved":52,"ratio":"52.00%"}}