{"output":"A saída é composta de uma linha por caso de teste contendo o valor pago pelos elfos aos duendes na moeda local.","input":"A primeira linha da entrada contém um inteiro T que representa a quantidade de casos de teste a seguir. A primeira linha de um caso de teste contém dois números inteiros N (2 ≤ N ≤ 103) e K (1 ≤ K ≤ 103) representando respectivamente o número de elfos que moram em Vila Natalina e a taxa em moeda local cobrada por cada fio passante acima da casa de um duende. Segue, então, N linhas contendo dois inteiros X e Y (-104 ≤ X, Y  ≤ 104) cada, representando as coordenadas da casa de um elfo na cidade. Todas as casas em Vila Natalina estão em coordenadas inteiras e as dimensões das casas podem ser desconsideradas.","level":5,"name":"Vila Natalina","has_images":false,"description":"Após um dia de trabalho na fábrica do papai noel, elfos e duende retornam para suas casas na pacata cidade de Vila Natalina que se situa no polo norte, aos arredores da fábrica. A Vila Natalina é um lugar lindo e tranquilo de se viver. Branco por causa da neve e uma cidade bem planejada já que podemos imaginar as casas como vértices de uma enorme grade com todos os vértices contendo uma casa. E todos viviam em paz até o dia em que os elfos, que são em menor número, começaram a dizer que suas casas eram muito distantes umas das outras e que isso dificultava a comunição entre eles já que para simplesmente poderem conversar tinham que andar grandes distâncias por não haver linhas telefônicas e nem rede de celular no Polo Norte. Já os duendes não se incomodavam com isso por terem poderes telepáticos que eliminavam esse incoveniente.\r\n\r\n                Se considerando injustiçados os elfos decidiram instalar uma rede telefônica que funcionava por fio e conectava todas as casas élficas. E fizeram isso de forma inteligente: com a menor quantidade de fios possível e cada fio bem esticado para formar um segmento de reta que liga duas casas de elfos distintos. Porém, como os fios não eram subterrâneos e sim acima da altura das casas, alguns duendes se sentiram incomodados e decidiram cobrar uma taxa por cada fio passasse por cima da sua casa. Como os elfos estão tentando economizar, obviamente contruíram a rede de tal forma a pagar o menor valor possível.\r\n\r\n                Dado a localizacão da casa de todos os elfos e a taxa cobrada por um duende para cada fio que passe por cima da sua casa, determine o valor pago pelos elfos aos duendes.","id":"2725","category":"Grafos","statistics":{"level":"5 / 10","submissions":189,"solved":108,"ratio":"57.14%"}}