{"output":"A saída é composta de uma linha por caso de teste contendo um número inteiro que representa o número de formas de escolher um grupo segundo as exigências.","input":"A primeira linha da entrada contém um inteiro T que representa a quantidade de casos de testes. Seguem-se então T casos de testes. A primeira linha de um caso de teste contém dois inteiros N (1 ≤ N ≤ 50) e K (1 ≤ K ≤ 50) representando respectivemente o número total de Elfos e a quantidade determinada de Elfos que devem embarcar no trenó. A segunda linha de um caso de teste contém N números inteiros Pi (1 ≤ Pi ≤ 1018) representando o peso em mg dos Elfos. A terceira e última linha de um caso de teste contém dois números inteiros A e B (0 ≤ A ≤ B ≤ 1019) representando respectivamente o peso do grupo mais leve testado e o peso do grupo mais pesado testado.","level":9,"name":"Trenó Lotado","has_images":false,"description":"É chegada a véspera de Natal e está quase na hora de o trenó partir. Tudo já está guardado no saco do papai noel e as renas em posição, só resta uma coisa: decidir quais ajudantes irão trabalhar com noel esse ano. Sim, ao contrário do que se pensa, o bom velhinho não faz tudo sozinho. Ele sempre leva consigo um grupo de elfos na sua volta ao mundo em uma noite.\r\n\r\n\t\t\t\tPorém, devem ser escolhidos cuidadosamente os elfos que irão pois o peso deles vai afetar diretamente na aerodinâmica do Trenó. Se for muito leve balançará muito durante o voo e se for muito pesado cansará as renas muito cedo.\r\n\r\n\t\t\t\tComo está com pressa o Noel decidiu fazer uma tentativa e escolheu um grupo de ajudantes. Mas as Renas logo acusaram que estava muito leve. Então Noel fez uma segunda tentativa, escolheu outro grupo. Mas novamente as Renas reclamaram, contudo, afirmando que agora estava muito pesado. O bom velhinho, que tem hora marcada para seu compromisso, se irritou e deu um ultimato aos seus subordinados: \"Já chega! Escolham logo K elfos entre vocês para ir de tal forma que o trenó não fique nem muito leve e nem muito pesado! Ou seja, a soma dos pesos não pode ser menor que a do primeiro grupo que tentei e nem maior que a do segundo. E facam isso Rápido!\"\r\n\r\n\t\t\t\tNaturalmente os pequeninos se desesperaram. Além da restrição dos pesos e agora do número de Elfos que tem que ser exata, eles ainda tem o fato de que cada Elfo pesa o dobro ou mais que um Elfo mais novo que ele. O que obviamente só complica tudo.\r\n\r\n\t\t\t\tSabendo que todos os Elfos possuem idades diferentes você consegue ajudar esses pequeninos a dizer de quantas formas eles podem escolher um grupo para ir com o papai Noel respeitando todas as exigências?","id":"2726","category":"Matemática","statistics":{"level":"9 / 10","submissions":95,"solved":28,"ratio":"29.47%"}}