{"output":"Se a viagem durar menos que 2 horas, você deve imprimir \"Will not be late. Travel time - M - best way - C1 C... CN\" (\"Não irá atrasar. Tempo de viagem - M - melhor caminho - C...), onde M é o tempo de viagem e CN são a sequência de cidades que montam o melhor caminho. Caso contrário, você deve imprimir \"It will be L minutes late. Travel time - M - best way -  C1 C... CN\" (Irá se atrasar L minutos. Tempo de viagem - M - melhor caminho - C...), onde L são os minutos que Valentina irá se atrasar.","input":"A entrada consiste em diversas casos de teste. A primeira linha de cada caso contém dois inteiros C (1 ≤ C ≤ 15) e E (1 ≤ E ≤ 225), que indicam a quantidade de cidades e estradas. As E linhas seguintes contém três inteiros C1, C2 e T, que identificam o tempo médio T de deslocamento entre as cidades C1, C2. Por fim, um inteiro D identifica a cidade em que Valentina se encontra no momento. Uma linha com \"0 0\" finaliza a entrada.","level":4,"name":"Programação de Viagem","has_images":false,"description":"Valentina iniciou um novo desafio neste ano: ela irá dar aulas de programação! Ela está muito empolgada com essa atividade, uma vez que programar é uma de suas maiores paixões. Estas aulas ocorrerão durante a tarde em escolas de diversas cidades da sua região e ela deverá se deslocar de carro.\n\nComo Valentina está no 3º ano do curso de Ciência da Computação, ela deve voltar de seu trabalho a tempo de ir para a universidade. As aulas em que ela leciona terminam por volta das 17h30min, e as aulas da faculdade iniciam às 19h30min. Sendo assim, ela possui 2 horas para poder voltar para a sua cidade e chegar na universidade a tempo do início da sua aula.\n\nMuito esperta e organizada, ela coletou informações quanto o tempo médio, em minutos, de viagem entre as cidades onde ela tem que lecionar. Ela montou uma lista, onde ela enumerou as cidades que ela devia visitar, sendo a sua cidade de origem sempre a número 1. O tempo médio fornecido é bidirecional, ou seja, se da cidade 1 para a cidade 2 o tempo médio é 20 minutos, da cidade 2 para a cidade 1 é o mesmo.\n\nPercebendo que ela está muito atarefada organizando suas aulas, você se ofereceu para ajudá-la construindo um programa que descobre qual é a melhor rota para ela voltar para sua cidade e se ela se atrasará para sua aula na faculdade ou não. Você sabe que existe pelo menos um caminho que leva até cada cidade, e só haverá um único menor caminho possível.","id":"2731","category":"Grafos","statistics":{"level":"4 / 10","submissions":177,"solved":99,"ratio":"55.93%"}}