{"output":"Para cada arquivo da entrada, terá um arquivo de saída. O arquivo de saída tem doze linhas da forma descrita no item 7 e 8. Conforme mostra o exemplo de saída a seguir.","input":"A entrada consiste em vários arquivos de teste. Em cada arquivo de teste tem duas linhas. Na primeira linha tem dois números reais A e B (-1000.0 ≤ A, B ≤ 1000.0), separados por espaço em branco. Na segunda linha tem dois números reais C e D (-1000.0 ≤ C, D ≤ 1000.0), separados por espaço em branco. Conforme mostrado no exemplo de entrada a seguir.","level":7,"name":"Entrada e Saída de Números Reais","has_images":false,"description":"O seu professor gostaria de fazer um programa com as seguintes características:\n\n\n\tCrie duas variáveis para armazenar números reais de precisão simples;\n\tCrie duas variáveis para armazenar números reais de precisão dupla;\n\tLeia o primeiro número de precisão simples que sempre terá uma casa decimal;\n\tLeia o segundo número de precisão simples que sempre terá duas casas decimais;\n\tLeia o primeiro número de precisão dupla que sempre terá três casas decimais;\n\tLeia o segundo número de precisão dupla que sempre terá quatro casas decimais;\n\tImprima a letra A, um espaço em branco, o sinal de igual, um espaço em branco, o número armazenado na primeira variável lida no passo 3, uma virgula, um espaço em branco, a letra B, um espaço em branco, o sinal de igual, um espaço em branco, o número armazenado na segunda variável lida no passo 4. Não esqueça de pular linha;\n\tImprima a letra C, um espaço em branco, o sinal de igual, um espaço em branco, o número armazenado na primeira variável lida no passo 5, uma virgula, um espaço em branco, a letra D, um espaço em branco, o sinal de igual, um espaço em branco, o número armazenado na segunda variável lida no passo 6. Não esqueça de pular linha;\n\tRepita o procedimento 7, imprimindo os números com uma casa decimal;\n\tRepita o procedimento 8, imprimindo os números com uma casa decimal;\n\tRepita o procedimento 7, imprimindo os números com duas casas decimais;\n\tRepita o procedimento 8, imprimindo os números com duas casas decimais;\n\tRepita o procedimento 7, imprimindo os números com três casas decimais;\n\tRepita o procedimento 8, imprimindo os números com três casas decimais;\n\tRepita o procedimento 7, imprimindo os números com três casas decimais e em forma de notação cientifica com o carácter E;\n\tRepita o procedimento 8, imprimindo os números com três casas decimais e em forma de notação cientifica com o carácter E;\n\tRepita o procedimento 7, imprimindo somente a parte inteira do número;\n\tRepita o procedimento 8, imprimindo somente a parte inteira do número.","id":"2758","category":"Iniciante","statistics":{"level":"7 / 10","submissions":1960,"solved":700,"ratio":"35.71%"}}