{"output":"Escreva na saída uma linha contendo um número: o menor múltiplo de \\(M\\) que pode\nser obtido adicionando-se quantos dígitos forem necessários à direita ou esquerda de \\(N\\).","input":"A entrada contém apenas uma linha com os dois inteiros \\(N\\) e \\(M\\), separados por espaço.\n\n\\(1 \\leq N \\leq 10^{12}\\)\n\\(1 \\leq M \\leq 2 \\times 10^5\\)","level":10,"name":"Aula","has_images":false,"description":"Em uma aula de Teoria dos Números, a professora Gina estava mostrando algumas propriedades\nde múltiplos de um número. Ela anunciou aos alunos que escreveria no quadro um múltiplo de 823.\nPorém, em um súbito momento de distração enquanto refletia sobre as consequências do Lema de Burnside,\nela escreveu o número \\(234\\), que na verdade era a quantidade de dimensões do problema no qual\nela ficou pensando na madrugada anterior.\n\n\nImpacientes, os alunos começaram a rir. ``Mas professora, 234 não é múltiplo de 823!'', disse\no mais inteligente da turma, depois de usar uma máquina de calcular para verificar esta\ncomplexa relação entre esses dois inteiros positivos.\n\n\nMas Gina é uma matemática preparada para tudo. Sem pensar muito, ela respondeu:\n``Não terminei de escrever ainda''. Em seguida, adicionou um dígito 1 à esquerda do \\(234\\) e um dígito\n5 à direita. Agora sim, \\(12345\\) é um múltiplo de 823. Ela então seguiu com sua explicação.\n\n\nApesar de ter se saído bem nessa, Gina gostaria de estar melhor preparada para essas situações.\nComo ideias sobre problemas aleatórios surgem a qualquer momento, ela prefere ter um programa\npara salvá-la em situações parecidas e assim liberar sua mente para atingir o nirvana matemático em paz.\n\n\nAjude Gina. Dados dois números \\(N\\) e \\(M\\), diga qual é o menor múltiplo de \\(M\\) que pode ser obtido\nadicionando dígitos à direita e/ou à esquerda de \\(N\\). Note que você pode precisar de adicionar\nvários dígitos, e que não é permitido adicionar dígitos no meio de \\(N\\). Gina não quer apagar\no número que já escreveu, apenas escrever mais dígitos para torná-lo múltiplo de \\(M\\).\nAlém disso, é possível que não seja necessário escrever nenhum dígito adicional.","id":"2788","category":"Ad-Hoc","statistics":{"level":"10 / 10","submissions":225,"solved":17,"ratio":"7.56%"}}