{"output":"Escreva na saída uma linha contendo um inteiro: a maior quantidade possível de água que as casas\nque Abbade comprar irão receber, dado que ele comprará casas de forma a maximizar esse valor.","input":"A primeira linha contém dois inteiros \\(N\\) e \\(D\\) separados por espaço,\nrepresentando a\nquantidade de casas da cidade e o dinheiro que Abbade possui para a compra das casas.\nCada casa é identificada por um inteiro entre \\(1\\) e \\(N\\).\nSeguem \\(N-1\\) linhas. A \\(i\\)-ésima delas conterá dois inteiros, \\(A_i\\) e \\(B_i\\), significando que existe\numa rota direta entre essas casas.\n\n\nA linha seguinte conterá um inteiro \\(M\\), indicando a quantidade de casas que estão à venda.\nSeguem \\(M\\) linhas.\nA \\(i\\)-ésima delas conterá dois inteiros \\(C_i\\) e \\(V_i\\) , sendo \\(C_i\\) o número de uma das casas\ne \\(V_i\\) seu preço de venda.\nÉ garantido que uma casa não aparecerá mais de uma vez.\n\n\nA linha seguinte conterá um inteiro \\(Q\\), indicando a quantidade de caminhões-pipa que passarão pela cidade. \nSeguem \\(Q\\) linhas.\nA \\(i\\)-ésima dessas linhas conterá três inteiros \\(X_i\\), \\(Y_i\\) e \\(L_i\\),\nindicando que o \\(i\\)-ésimo caminhão partirá da casa \\(X_i\\) até a casa \\(Y_i\\) deixando \\(L_i\\) litros de\nágua em cada uma das casas do caminho.\n\n\\(1 \\leq N \\leq 5 \\times 10^3\\)\n\\(1 \\leq D \\leq 10^3\\)\n\\(1 \\leq M \\leq N\\)\n\\(1 \\leq V_i \\leq 100\\)\n\\(1 \\leq Q \\leq 5 \\times 10^5\\)\n\\(1 \\leq L \\leq 10^3\\)","level":8,"name":"Crise Hídrica","has_images":false,"description":"Montes Claros, uma cidade do norte de Minas Gerais, tem passado por uma grande crise hídrica nos\núltimos tempos. A escassez de água tem afetado a vida de muitos moradores, fazendo-os colocar\nsuas casas à venda por um preço bem abaixo do mercado. Abbade, um grande investidor,\nobserva esse momento de crise como uma oportunidade de investimento e pretende comprar várias dessas\ncasas.\n\n\nExistem \\(N\\) casas em Montes Claros e \\(M\\) delas estão à venda. Um fato curioso é que existe apenas um\núnico caminho entre qualquer par de casas e é possível, a partir de qualquer casa, chegar a todas as\noutras da cidade.\n\n\nPor causa da crise, \\(Q\\) caminhões-pipa passam mensalmente pelas ruas da cidade.\nO \\(i\\)-ésimo desses caminhões faz o caminho de uma determinada casa \\(X_i\\) até outra casa \\(Y_i\\),\ndeixando \\(L_i\\) litros de água em cada casa em seu caminho.\n\n\nAbbade possui \\(D\\) reais para investir na compra das casas.\nPorém, como ele tem receio de que a crise piore e os imóveis nunca sejam revendidos,\nele comprará as casas de modo que a soma da quantidade de água recebida pelos caminhões nessas\ncasas seja a maior possível. Para decidir quais casas comprar, ele pediu a sua ajuda.","id":"2789","category":"Ad-Hoc","statistics":{"level":"8 / 10","submissions":174,"solved":56,"ratio":"32.18%"}}