{"output":"Escreva na saída uma linha com \\(N\\) inteiros separados por um espaço, que representem a ordem dos índices a serem excluídos.","input":"A entrada começa com uma linha contendo um inteiro \\(N\\), indicando o número de elementos do array.\nA segunda linha de entrada possui \\(N\\) inteiros separados por espaço, indicando a ordem de exclusão dos elementos.\nÉ garantido que, nos valores da segunda linha de entrada, cada um dos inteiros de \\(1\\) a \\(N\\) aparece\nexatamente uma vez.\n\n\\(1 \\leq N \\leq 5\\times10^5\\)","level":8,"name":"Golnaldinho","has_images":true,"description":"Golnaldinho foi um brilhante jogador de futebol, tendo passagens marcantes em todas as equipes em que atuou durante sua carreira, sejam nacionais tais como Grêmio, Flamengo e Atlético-MG, ou internacionais, tais como Milan, PSG e Barcelona. Sua genialidade com a bola nos pés lhe rendeu diversas convocações para representar a Seleção Brasileira, além de uma legião de fãs espalhados pelo mundo. Este ano, em busca de novos desafios, Golnaldinho decidiu aposentar as chuteiras e se aventurar no mundo da Computação.\n\n\nTal notícia surpreendeu diversas pessoas que não conheciam o amor de Golnaldinho por algoritmos e estruturas de dados. Tamanho amor fazia com que o ex-jogador passasse horas estudando o assunto enquanto se concentrava para as partidas de futebol. Durante a entrevista coletiva em que anunciou sua aposentadoria, ele mesmo afirmou que à medida em que melhorava suas habilidades em programação, melhor era o seu desempenho em campo.\n\n\nDurante seus estudos, Golnaldinho encontrou um livro de problemas computacionais e intrigou-se com um problema em específico, pois não conseguiu solucioná-lo. Competitivo como ele é e sabendo de suas habilidades de programação, Golnaldinho lhe desafiou a resolvê-lo.\n\n\nO enunciado de tal problema é o seguinte:\n\nSuponha um array com \\(\\displaystyle{N}\\) inteiros, onde a i-ésima posição desse array é ocupada pelo valor \\(\\displaystyle{i}\\), ou seja, a posição 1 é ocupada pelo valor 1, a posição 2 é ocupada pelo valor 2 e assim por diante, como pode ser visualizado na figura abaixo:\n\n\n\nKaká gostaria de remover todos os números desse array.\n        Porém, as exclusões a serem efetuadas devem respeitar uma ordem específica.\n        Pensando nisso, Kaká implementou uma função que deleta um único elemento por vez,\n        dado o índice do elemento a ser excluído.\n        Ou seja, caso Cacá deseje excluir o elemento 2 no array acima, bastaria informar o índice do elemento, que neste caso é igual a 2.\n        Como resultado, a função retornaria o seguinte array após realizar a exclusão:\n\n\n\nAgora, se Kaká desejasse excluir o elemento 4 do array, bastaria informar o índice que neste caso é igual a 3. A função retornaria:\n\n\n\nTal procedimento é realizado até que não haja mais nenhum elemento no array.\nKaká está com problemas em automatizar as chamadas para essa função. Isso porque não conseguiu implementar um script que forneça a ordem dos índices a serem excluídos, respeitando a ordem de exclusão dos elementos. Ou seja, se para um array com \\(\\displaystyle{N=5}\\) a ordem de exclusão dos elementos for {2,4,5,1,3}, a ordem dos índices será {2,3,3,1,1}. Você poderia ajudá-lo nesta implementação?","id":"2792","category":"Ad-Hoc","statistics":{"level":"8 / 10","submissions":765,"solved":220,"ratio":"28.76%"}}