{"output":"Escreva na saída uma linha contendo dois inteiros separados por espaço:\no comprimento e a largura da\nda mesa de maior área que cabe na casa de Isabel.\nEm caso de empate, imprima as dimensões da mesa de maior largura.\nÉ garantido que sempre há pelo menos uma mesa que cabe na casa de Isabel.","input":"A entrada começa com uma linha contendo dois inteiros \\(N\\) e \\(M\\) separados\npor espaço, que são as\ndimensões da planta da casa.\nEm seguida, há \\(N\\) linhas contendo \\(M\\) caracteres\ndescrevendo a planta. Um caractere . (ponto) representa um espaço\nvazio, enquanto que o caractere # representa um espaço preenchido\n(parede ou outro móvel).\n\n\nA linha seguinte contém um inteiro \\(K\\) que representa o tamanho da lista\nde opções de mesa que Isabel pode comprar.\nAs próximas \\(K\\) linhas contém, cada uma,\ndois inteiros \\(C_i\\) e \\(L_i\\) separados por espaço,\nrepresentando o comprimento e largura da \\(i\\)-ésima mesa.\n\n\\(1 \\le N, M \\le 1000\\)\n\\(1 \\le K \\le 10^6\\)\n\\(1 \\le C_i \\le \\min(500, \\max(N, M))\\)\n\\(1 \\le L_i \\le \\min(500, \\max(N, M))\\)","level":4,"name":"Planta da Casa","has_images":false,"description":"Isabel reformou sua casa no bairro Ibituruna depois do aumento de \nfaturamento de sua loja. Agora ela quer comprar uma grande mesa de \njantar para comemorar. Ela deseja a maior mesa possível que caiba \ndentro de sua nova casa. E adivinhe quem irá realizar essa tarefa para ela?\n\n\nNão se desespere, Isabel forneceu tudo para que você resolva essa\ntarefa. Ela forneceu uma planta da casa informando quais espaços já estão\nocupados e que, portanto, não podem conter a mesa.\nAlém disso, ela fez uma lista com o comprimento e a largura de várias\nopções de mesa. Basta agora descobrir qual é a mesa de maior área que\npode ser comprada para que Isabel coloque em sua casa!\n\n\nIsabel pode rotacionar uma mesa em 90 graus, caso precise.","id":"2796","category":"Ad-Hoc","statistics":{"level":"4 / 10","submissions":1906,"solved":281,"ratio":"14.74%"}}