{"output":"Escreva na saída uma linha contendo apenas um caractere, que deve ser\nS caso todas as regras estejam sendo cumpridas e Bibika possa prosseguir com a prova\nou N caso contrário.","input":"A entrada começa com uma linha contendo três inteiros \\(N\\), \\(M\\) e \\(C\\) separados por espaço,\nsendo eles as dimensões da sala de aula e a quantidade de lugares que precisam estar vagos\nentre dois alunos com o mesmo tipo de prova.\nDepois disso, haverá \\(N\\) linhas, cada uma descrevendo os alunos de uma linha de cadeiras da sala.\nA \\(i\\)-ésima dessas linhas conterá \\(M\\) inteiros, descrevendo o tipo de prova que o aluno\nsentado na \\(i\\)-ésima cadeira de cada fila possui.\nO inteiro \\(0\\) significa que a cadeira está vazia,\n\\(1\\) significa que quem está sentado está fazendo a prova tipo 1\ne \\(2\\) significa que está fazendo a prova do tipo 2.\n\n\\(2 \\leq N, M \\leq 1000\\)\n\\(0 \\leq C \\leq N-1\\)","level":5,"name":"Aplicando Prova","has_images":true,"description":"Aplicar uma prova não é uma tarefa tão trivial como alguns pensam. Muitos alunos tentam colar e é difícil observar todos ao mesmo. Professora Bibika sempre faz dois tipos de provas completamente diferentes, que ela chama de prova tipo 1 e prova tipo 2. Além disso, ela tem usado uma técnica para posicionar os alunos de forma que a ocorrência das colas seja minimizada. Bibika aplica provas em várias salas de aulas diferentes. Vamos dizer que uma de suas salas tenha \\(M\\) fileiras com \\(N\\) cadeiras cada uma. A técnica de Bibika consiste em garantir duas regras:\n\n\n Não pode haver alunos em duas fileiras consecutivas.\n \n Com base na confiança na turma, Bibika escolhe um número $C$ e exige que, em cada fileira, existam pelo menos $C$ lugares vagos ou com tipo de prova diferente entre dois alunos que estão com o mesmo tipo de prova.\n \n\n\n\nComo estava difícil checar se os alunos estavam cumprindo as regras durante toda as provas, Bibika instalou uma câmera no teto da sala que tira uma foto e envia para o seu e-mail.\nSua tarefa é pegar essa foto, processá-la e dizer a Bibika se ela pode iniciar a prova ou não. Ela só poderá iniciar a prova se todas as regras estão sendo seguidas.\n\n\n\nAlguns exemplos de organização dos alunos onde todas as irregularidades estão circuladas.\n\nO exemplo 1 possui alunos em fileiras vizinhas. Os exemplos 2 e 3 possuem alunos com o mesmo tipo de prova e entre eles existem menos de \\(C\\) lugares vagos e/ou com alunos com o tipo de prova diferente. O exemplo 4 mostra uma configuração válida.","id":"2797","category":"Ad-Hoc","statistics":{"level":"5 / 10","submissions":196,"solved":85,"ratio":"43.37%"}}