{"output":"Escreva na saída uma linha contendo uma string que é o resultado da aplicação sucessiva das\nregras de substituições dadas na string \\(S\\), ou \\(-1\\), caso a string seja alterada indefinidamente\npela aplicação das regras. É garantido que, caso seja possível obter uma string que não possa mais\nser alterada pelas regras de substituição, ela conterá no máximo \\(5 \\times 10^6\\) letras.","input":"A entrada começa com uma linha contendo um inteiro \\(N\\): o número de regras de substituição.\nAs \\(N\\) linhas seguintes descrevem, cada uma, uma regra de substituição.\nA \\(i\\)-ésima dessas linhas conterá uma letra \\(L_i\\), seguida de um espaço e uma string \\(S_i\\)\npela qual a letra \\(L_i\\) deve ser substituída.\n\n\nA linha seguinte conterá um número \\(T\\): o tamanho do texto em que as regras de substituição devem\nser aplicadas.\nA última linha conterá uma string \\(S\\) com esse texto.\n\n\\(0 \\leq N \\leq 26\\)\n\\(1 \\leq |S_i| \\leq 100\\)\n\\(1 \\leq T \\leq 10^5\\)\n\n\nTodas as strings da entrada conterão apenas letras minúsculas.\n\n\nNunca será dada mais de uma regra de substituição para a mesma letra.","level":10,"name":"Lero-Lero da Mineira","has_images":false,"description":"Aos 45 do segundo tempo, faltava um problema para a Maratona Mineira de Programação de 2018.\nMas não era qualquer problema, era aquele problema.\nPara tocar o terror nos corações dos competidores.\nFazer os coaches quebrarem a cabeça na sala deles tentando resolvê-lo.\nBom, após muito trabalho, o Comitê de Prova conseguiu elaborar tal problema, e o resultado é\neste que você está lendo!\n\n\nChega de enrolação e vamos ao que interessa.\nVocê receberá uma lista de regras de substituição que devem ser feitas em um texto. Cada\nregra é formada de uma letra e uma string correspondente pela qual a letra\ndeve ser substituída. Depois disso, você receberá a string onde\nas regras devem ser aplicadas. Sempre que você encontrar nessa string\num dos caracteres que devem ser substituídos de acordo com as regras\nrecebidas, você deve fazer a substituição do caractere pela sua\nstring correspondente, até que não seja mais possível mudar a string fazendo substituições deste tipo.\nCaso sempre haja uma mudança a ser feita, você deve avisar que é impossível terminar o processo.","id":"2798","category":"Ad-Hoc","statistics":{"level":"10 / 10","submissions":266,"solved":46,"ratio":"17.29%"}}