{"output":"A saída consiste em um única linha contendo a mensagem decifrada, com seus símbolos separados por um único espaço em branco, caso seja possível decifrar cada símbolo do alfabeto de modo único. Ou a mensagem \"DECIFRAGEM AMBIGUA\" caso contrário.","input":"A primeira linha da entrada consiste de um número inteiro N (1 ≤ N ≤ 105) representando o tamanho da mensagem. A segunda linha da entrada consite de N números inteiros Mi (0 ≤ Mi < T) representando a mensagem. A terceira linha da entrada contém três inteiros: T (1 ≤ T ≤ 109) representando o tamanho do alfabeto; e A (1 ≤ A ≤ 109) e B (1 ≤ B ≤ 109) como especificado acima.","level":8,"name":"Cifra Affine","has_images":true,"description":"Um processo de cifragem consiste em trocar cada símbolo de uma mensagem por outro símbolo do mesmo alfabeto usado na mensagem original, de tal forma que haja uma correspondência um para um entre os símbolos, ou seja, dois símbolos diferentes não podem ser substituídos pelo mesmo símbolo.\n\nUma cifra Affine consiste em supor os símbolos de um alfabeto de tamanho T como números em um intervalo [0..T-1]. Então são escolhidos dois números positivos A e B. Para cifrar um símbolo é multiplicado o valor da sua posição no alfabeto por A e ao resultado é somado o número B. Ao fim, o resultado será a posição do símbolo a substituir o original na sequência. No caso dessa nova posição não se referir a uma posição dentro do tamanho do alfabeto, supõe-se o alfabeto repetido várias vezes à direita de modo a possuir todas as posições calculadas.\n\nPor exemplo, suponha um alfabeto de tamanho 7 e A=4 e B=2. Para cifrar qualquer símbolo desse alfabeto é preciso estender o alfabeto para direita 3 vezes como mostrado abaixo:\n\n\n\nNessa cifra o símbolo 6 é cifrado para o símbolo 5 pois A × 6 + B=26 e o símbolo na posição 26 é 5.\n\nVale notar que nem toda cifra Affine é válida. Uma cifra mal elaborada pode não produzir uma correspondência um para um entre os símbolos, assim não garantindo que a decifragem possa ser feita de modo único também.\n\nSua tarefa é, dado os parâmetros A e B da cifra e o tamanho do alfabeto, decifrar uma mensagem com N símbolos ou informar que não é possível fazê-lo.","id":"2801","category":"Matemática","statistics":{"level":"8 / 10","submissions":76,"solved":26,"ratio":"34.21%"}}