{"output":"A saída consiste de um único valor inteiro representando a estimativa do custo mínimo, em dezenas de milhares de reais, de se construir o projeto da malha ferroviária. Ou da mensagem \"*\" caso a matriz de distâncias tenha sido alterada.\n\n\t\t\t\tObs: É garantido que as ferrovias possuem tamanho inteiro em km.","input":"A primeira linha da entrada contém dois inteiros N (1 ≤ N ≤ 450) e K (1 ≤ K ≤ 102), representando respectivamente a quantidade de cidades estratégicas e o preço médio, em dezenas de milhares de reais, de se contruir uma ferrovia. As próximas N linhas contém N inteiros Di,j (0 ≤ Di,j ≤ 106) cada um representando a distância em km da cidade i à cidade j através da malha ferroviária. Di,j ≠ 0 para i ≠ j.","level":8,"name":"Ferrovias","has_images":false,"description":"O Norte é a maior região do país em área. Com tamanha extensão territorial e seus 450 municípios era de se esperar que houvessem mais Ferrovias, porém essa não é a realidade. Grande parte do transporte ainda é feito por rodovias ou vias fluviais.\n\n\t\t\t\tPara resolver esse problema, Farcos projetou uma malha ferroviária capaz de conectar N municípios do Norte que ele acredita serem estratégicos para o comércio e o turismo da região. Nessa malha uma ferrovia sempre liga dois municípios diferentes e possui duas linhas de trilho que tornam a ferrovia capaz de ser percorrida nos dois sentidos. Além de sempre ser possível chegar em todos os outros N-1 municípios a partir de qualquer município da malha, seja por uma ferrovia direta ou passando por outros municípios intermediários.\n\n\t\t\t\tAo terminar o desenho da sua malha ferroviária e sabendo a extensão em km de cada ferrovia, Farcos calculou qual seria o menor caminho entre todos os pares de municípios através da malha e gerou uma matriz de distâncias a qual foi anexada ao seu desenho e enviada para autoridades estimarem o custo de produção de tal projeto.\n\n\t\t\t\tComo o desenho da malha e a matriz não foram enviados digitalmente, o desenho da malha foi perdido e apenas a matriz de distâncias chegou às autoridades responsáveis.\n\n\t\t\t\tSua tarefa é, usando apenas a matriz de distâncias e o preço médio informado para se contruir uma ferrovia (independente do seu tamanho), estimar o menor custo para o projeto.\n\n\t\t\t\tContudo, é necessário cuidado. Há várias pessoas que tem interesse que o projeto de Farcos nem ao menos chegue à análise e podem ter alterado posições da matriz de distâncias fazendo com que ela não corresponda mais a uma possível malha desenhada por Farcos.","id":"2804","category":"Grafos","statistics":{"level":"8 / 10","submissions":86,"solved":29,"ratio":"33.72%"}}