{"output":"Para cada porção imprima uma linha contendo a frase \"porcao tipica\" caso a porção seja típica, ou \"porcao comum\" caso a porção não seja típica.","input":"A entrada inicia com um inteiro N, indicando quantos são os ingredientes típicos da região (1 <= N <= 50). Em seguida haverá N nomes, representando os N ingredientes típicos da região.\n\nEm seguida haverá um inteiro M, indicando quantas porções deverão ser analisadas (1 <= M <= 100).\n\nEm seguida haverá M conjuntos de entrada, cada um representando uma porção.\nCada um destes conjuntos iniciará com um nome Si e um número Ki, representando o nome da porção e a quantidade de componentes (típicos, comuns ou porções) que compõem esta porção (1 <= Ki <= 50).\nEm seguida haverá Ki nomes, cada um representando um dos componentes desta porção Si.\n\nOs nomes de todos os ingredientes e porções contém apenas letras do alfabeto (maiúsculas ou minúsculas) e hífen, e terão no máximo 50 caracteres.","level":10,"name":"Ingredientes Típicos","has_images":false,"description":"A região Norte do Brasil é berço de uma culinária muito rica e criativa. Com ingredientes típicos, temperos únicos, combinações e modos de preparo peculiares, os pratos da região sempre encantam os moradores e turistas.\n\nNesta culinária são usados dois tipos de ingrediente: ingredientes típicos do Norte, e ingredientes comuns ao resto do país. Uma porção é uma mistura de ingredientes (típicos e/ou comuns) e/ou outras porções, e só é considerada típica se mais da metade de seus componenetes forem típicos.\n\nRafael está visitando o Norte pela primeira vez, e após algumas refeições ficou muito satisfeito com a gastronomia do local. Ele percebeu que quanto mais componentes típicos a sua porção tivesse, mais ele era surpreendido pelo gosto.\n\nApós fazer algumas anotações Rafael pediu sua ajuda: Dada a lista de ingredientes típicos, e em seguida a descrição de várias porções, diga quais destas porções são típicas.","id":"2806","category":"Ad-Hoc","statistics":{"level":"10 / 10","submissions":194,"solved":24,"ratio":"12.37%"}}