{"output":"A saída consiste de uma única linha contendo a resposta de Rapboy, ou seja, o sibi-xor dos números fornecidos por Farcos. Como a resposta pode ser um número muito grande , imprima apenas seu módulo por 109+7.","input":"A primeira linha da entrada contém um inteiro N (1 ≤ N ≤ 2000) representando a quantidade de números na lista de Farcos. A segunda linha contém N números inteiros Ai (0 ≤ Ai < 264) correspondendo a listas de números de Farcos.","level":9,"name":"Sibi-Xor","has_images":false,"description":"Dabriel foi visitar seu amigo Farcos na cidade natal dele, Manaus, no estado do Amazonas. Ao chegar lá Dabriel estranhou a forma como as pessoas falavam por causa das expressões regionais bem específicas que usavam. Uma expressão bem curiosa que ouviu de uma conversa de Farcos com seu outro amigo RapBoy foi \"Sibicho ó\" que é uma redução da frase \"Olha esse bicho, ó\". Um regionalismo bem ultilizado para demonstrar desdém do que se ouve ou duvidar de uma afirmação de alguém.\n\nNa primeira vez que ouviu a expressão Dabriel pensou se tratar da operação bitwise sobres números chamada Sibi-Xor que havia aprendido recentemente na universidade e explicou a Farcos. Farcos por sua vez ficou muito feliz ao descobrir a operação porque, além de gostar de operações bitwise, encontrou um meio de fazer Rapboy parar de usar essa expressão com ele em tom de desdém. Agora toda vez que Rapboy falasse \"Sibicho ó\" ele teria que dizer a Farcos o Resultado do Sibi-Xor de uma lista de Números fornecida por este.\n\nA operação Sibi-Xor sobre uma lista de números consiste em 3 passos:\n\n\n1) fazer o AND-bitwise de todas as subsequências da lista. Chamaremos a cada resultado de subset-and.\n\n\n2) fazer o XOR-bitwise de todos os subset-and's que foram formados com a mesma quantidade de elementos.\n\n\n3) Somar todos os resultados do passo 2.\n\n\nPor exemplo, para a lista A={14, 15, 35, 7} fornecida por Farcos, Rapboy deve responder o\n\nSibi-Xor(A) =\n\n(14 ^ 15 ^ 35 ^ 7) +\n\n((15 & 35) ^ (14 & 35) ^ (15 & 7) ^ (35 & 7) ^ (14 & 7) ^ (14 & 15)) +\n\n((15 & 35 & 7) ^ (14 & 35 & 7) ^ (14 & 15 & 7) ^ (14 & 15 & 35)) +\n\n(14 & 15 & 35 & 7)\n\n= 57\n\nOnde '&' simboliza a operação and-bitwise e '^' a operação xor-bitwise.","id":"2811","category":"Paradigmas","statistics":{"level":"9 / 10","submissions":109,"solved":23,"ratio":"21.10%"}}