{"output":"Exiba um único inteiro, a maior quantidade possível de gasolina que os veículos que estão em um quadrado L irão abastecer, dado que deve existir ao menos um veículo de cada tipo. Caso não exista um quadrado que caracterize a dúvida do telespectador, imprima -1.","input":"A primeira linha da entrada possui dois inteiros N, M (1 ≤ N, M ≤ 1000), representando a quantidade de bombas e a quantidade de veículos enfileirados em cada bomba. Seguem N linhas, cada uma contendo M caracteres 'C' ou 'M' representando um carro ou uma moto, respectivamente. Após isso haverá um inteiro L (1 ≤ L ≤ 1000), sendo o tamanho do lado do quadrado que o telespectador deseja saber.","level":8,"name":"Posto do Darlan","has_images":true,"description":"Uma das consequências da greve dos caminhoneiros foi a falta de gasolina em todo o país. Em Santa Rita do Sapucaí, cidade do sul de Minas Gerais, não foi diferente. Centenas de carros e motos fizeram fila no último posto com gasolina disponível para conseguirem encher seus tanques antes que ela esgotasse, parecia cena de filme sobre apocalipse zumbi.\n\nO posto possui N bombas e em cada uma delas existe uma fila em linha reta com M veículos (carros ou motos). Segue uma ilustração de um posto com 4 bombas e uma fila de 2 veículos por bomba.\n\n\n\t\n\n\nDarlan, dono do posto, limitou a quantidade de gasolina que cada carro poderia abastecer em 25 litros e cada moto em 12 litros. Como todos os donos dos veículos das filas estavam com medo de nunca mais poderem abastecer, eles com certeza iriam colocar o máximo de gasolina permitido por Darlan.\n\nA equipe da emissora de TV local estava ao vivo com seu drone filmando as longas filas de veículos em torno do posto do  Darlan, quando um telespectador enviou uma pergunta um tanto quanto aleatória: \"Se levarmos em consideração que as fileiras de carros caracterizam uma matriz de N linhas por M colunas, qual a maior quantidade de gasolina que os veículos em um quadrado de tamanho L irão colocar? Dado que nesse quadrado deve existir ao menos um veículo de cada tipo (carro e moto).\"\n\nA equipe de TV não faz ideia de como responder essa pergunta e necessita de sua ajuda!","id":"2817","category":"Matemática","statistics":{"level":"8 / 10","submissions":142,"solved":60,"ratio":"42.25%"}}