{"output":"A saída consiste em uma linha por caso de teste contendo o número de formas de se escrever a carta módulo 109+7.","input":"A primeira linha da entrada contém um número inteiro T que representa a quantidade de casos de testes. A primeira linha de um caso de teste contém os números inteiros C (1 ≤ C ≤ 109), N (1 ≤ N ≤ 26) e Q (0 ≤ Q ≤ 103) representando respectivamente o número de caracteres na carta, a quantidade de letras a partir do comeco do alfabeto que podem ser usadas e quantidade de dígrafos proibidos. As próximas Q linhas de um caso teste contém duas letras minúsculas do alfabeto inglês cada, representando os dígrafos proibidos.","level":5,"name":"Cartas Para o Noel","has_images":false,"description":"Giovana é uma menina muito esperta e quer ganhar um bom presente de natal nesse ano. Para isso ela pretende mandar uma ótima carta ao Papai Noel.\n\n\t\t\t\tComo é muito inteligente, Giovana descobriu que quem recebe as cartas do Papai Noel são os Duendes, e eles conseguem dizer se uma criança é um bom menino ou uma boa menina analisando o uso de dígrafos! Isso mesmo, analisando o número de dígrafos proibidos de uma carta os Duendes conseguem dizer se a criança merece ou não um bom presente.\n\n\t\t\t\tPara não correr riscos Giovana quer enviar uma carta que não contenha nenhum dígrafo proibido. Mesmo sendo muito esperta, Giovana ainda é muito nova e não domina toda a gramática. Uma de suas estratégias para evitar erros é usar somente as primeiras letras do alfabeto.\n\n\t\t\t\tAlém do mais, os Duendes são muito rígidos! Mesmo que o primeiro caractere de um dígrafo esteja no final de uma palavra e o segundo esteja no começo da palavra seguinte, os Duendes ainda consideram isto como um dígrafo. Isso fez com que a menina tomasse a duvidosa decisão de não escrever nenhum caractere de espaço na carta.\n\n\t\t\t\tGiovana ainda está insegura e pediu sua ajuda. Dado o número de caracteres que a carta terá e quais letras do alfabeto ela usará, sua tarefa é determinar de quantas formas essa carta pode ser escrita sem conter nenhum dígrafo proibido.","id":"2819","category":"Matemática","statistics":{"level":"5 / 10","submissions":35,"solved":18,"ratio":"51.43%"}}