{"output":"Para cada caso de teste de entrada, o programa criado por você deve imprimir dois valores separados por um espaço em branco. O primeiro valor é o maior número de cartas recebido por um dos jogadores (pode ser qualquer jogador). O segundo valor é o maior valor possível considerando a soma de todas as cartas (esta soma pode se referir a qualquer um dos jogadores).","input":"A entrada é composta por duas linhas. A primeira linha contém um inteiro nCartas (1 < nCartas < 60) e um inteiro nJogadores (1 ≤ nJogadores  ≤ 10) indicando respectivamente a quantidade de cartas e de jogadores. A próxima linha contém cada uma das nCartas, separadas por um espaço em branco (não há espaço em branco após a última carta).","level":4,"name":"Distribuição de Cartas","has_images":false,"description":"Alan Parina adora criar novos jogos com cartas de baralho. Ele acabou de criar um novo jogo para jogar com seus amigos e quer sua ajuda para construir um programa que possa fazer uma distribuição das cartas com base nos seus valores (A vale 1, J vale 11, Q vale 12 e K vale 13) e em algumas pequenas regras que são apresentadas a seguir.\n\n\t\t\t\tAlan seleciona um número de cartas que estão em um monte e as distribui sequencialmente entre seus amigos, do primeiro ao último. Ele pode ver o valor de cada carta e tem que garantir que a divisão seja o mais balanceada possível entre os jogadores, considerando apenas a soma do valor de suas cartas. Para ficar mais claro, se por exemplo Alan tivesse 4 cartas (3, 6, 2 e 10) para distribuir entre dois jogadores, ele teria que dar as cartas 3, 6 e 2 para o primeiro jogador (somando 11) a carta 10 para o segundo jogador. A divisão 9 e 12 estaria descartada porque a primeira regra do jogo é que o valor máximo de soma tem que ser o menor possível (11 é menor do que 12).\n\n\t\t\t\tHá uma segunda regra que deve ser respeitada neste jogo: uma vez que o valor máximo de soma é estabelecido, cada um dos jogadores, iniciando pelo primeiro, deverá tentar ficar com uma soma o mais próxima possível deste valor. Isso pode ser observada no primeiro caso de teste (abaixo). Ao distribuir as cartas A, 7, 3, 2, 9, 5, 6, J, K, 10, 4 e A entre 3 jogadores, o primeiro jogador ficaria com as 6 primeiras cartas (A, 7, 3, 2, 9 e 5) cuja soma seria 27. O segundo jogador ficaria com as próximas duas cartas (6 e J) que somariam 17 e o último jogador ficaria com quatro cartas (K, 10, 4 e A) que somariam o valor 28. Uma divisão 22, 22 e 28 não respeitaria este critério pois o primeiro ainda poderia pegar a carta de valor 5 para ficar com 27 (menos que o limite 28, neste caso). Tampouco poderíamos dividir em 21, 30 e 15, pois estaríamos ultrapassando o menor valor máximo possível (que é 28). Como resposta então, temos que o máximo de cartas para um dos jogadores seria 6 e o máximo valor obtido da soma das cartas seria 28, que é a resposta para o primeiro caso de teste apresentado abaixo.\n\n\t\t\t\tExistem obviamente outras regras do funcionamento do jogo, mas isso fica para outra história.","id":"2821","category":"Estruturas e Bibliotecas","statistics":{"level":"4 / 10","submissions":22,"solved":9,"ratio":"40.91%"}}