{"output":"A saída é uma única linha contendo a mensagem corrigida para Atreus ler. Ela segue as mesmas regras que a entrada e precisa terminar com uma quebra de linha ('\\n'). Além disso, no caso de um empate entre duas palavras, escolha a que aparece primeiro dentre as da entrada.","input":"A entrada é composta por múltiplas linhas. A primeira contém um inteiro q (1 ≤ q ≤ 103) representando a quantia de palavras não-repetidas que você encontrou em um Edda. Cada uma das próximas q linhas contém uma dessas palavras. A próxima linha contém outro inteiro, c (1 ≤ c ≤ 102), que indica o comprimento em palavras do escrito que você precisa corrigir. A última linha é o próprio escrito. Cada palavra dele é separada por um único espaço.\n\nTodas as palavras da entrada são compostas apenas por caracteres ASCII e têm comprimento ≤ 102. Não há diacríticos, nem pontuação.","level":8,"name":"L de Atreus!?","has_images":false,"description":"No recentemente lançado e muito aclamado jogo God of War, Kratos está agora no mundo da mitologia Nórdica tentando esquecer seu passado. Lá ele conheceu Faye, uma mulher tão misteriosa quanto ele próprio, com quem teve um filho: Atreus. Mas com a chegada de um estranho, Kratos e seu filho embarcam em uma jornada de consequências inesperadas.\n\nAo longo de sua viagem, eles encontram vários escritos em paredes, painéis, pedras... Esses escritos contam interessantes histórias sobre o mundo nórdico e suas personalidades, mas também aconselham os viajantes desavisados. Infelizmente, Kratos não consegue lê-los, já que ele é de Esparta e não se interessou em aprender as várias línguas de seu novo lar. Então Atreus precisa traduzir toda mensagem escrita que eles encontram. E Atreus é muito bom em linguística, impressionando até Mimir, o homem mais sábio de todos!\n\nEntretanto, não é incomum que eles encontrem mensagens com runas (letras nórdicas) faltando ou danificadas, impossibilitando que Atreus saiba o que elas estão tentando dizer. Então você, sendo um jogador esperto e entusiasmado, foi escolhido para ajudá-los. Sua tarefa é corrigir esses erros para que Atreus possa ler os dizeres e então eles estarão melhor preparados para os perigos dessa jornada.\n\nMas como alguém faria isso? Bem, Mimir sugere o seguinte: a Edda em verso e a Edda em prosa, dois trabalhos literários islandeses medievais compostos em sua maioria por poemas, são as duas principais fontes de conhecimento sobre a mitologia nórdica*. Sendo assim, procure nestas coletâneas de poemas as palavras que sejam mais similares às que o Atreus não consegue ler e use-as para corrigir os dizeres. Uma palavra p1 é considerada mais similar a p2 do que a p3 se há menos inserções, deleções e substituições de letras a fazer para transformar p1 em p2 do que p1 em p3.","id":"2825","category":"Strings","statistics":{"level":"8 / 10","submissions":142,"solved":58,"ratio":"40.85%"}}