{"output":"Imprima o token mais frequente utilizando um token de tamanho dois (2). Também deve ser impresso a frequencia do token.\n Tokens em caixa alta devem ser convertidos para caixa baixa. Caso exista um empate na frequencia, deve ser impresso somente o primeiro token (seguindo a ordem alfabética).","input":"Somente uma linha da entrada que contém uma string S, representando o texto a ser processado, contendo somente caracteres imprimíveis e possivelmente terminando com caracter especial EOL.\n                O comprimento máximo desta linha é de \\(10^5\\) caracteres.","level":7,"name":"Contador de Tokens","has_images":false,"description":"Um hospital pretende migrar seus registros de pacientes para um novo sistema. No entanto, foi observado que a tabela clientes possui o problema registros duplicados. Ou seja, um mesmo paciente que ingressou duas vezes no hospital pode estar registrado duas vezes na base de dados. Tal problema ocorre devido a presença de erros de tipografia (por exemplo: “Ketlyn da Silva” ou “Ketlin da Silva”). \n\nUma alternativa para contornar esse problema é quebrar o texto (“string”) em unidades menores (“tokens”) de um determinado tamanho e  computar o númbero de tokens em comum. Por exemplo, os tokens de tamanho 3 para a string “Ketlyn” são: “ket”,”etl”, ”tly” e “lyn”; já para a string “Ketlin”  são gerados as substrings: “ket”, “etl”, “tli”,”lin”. Note que a geração de substrings é feita a partir de uma “janela deslizando” variando em 1 caractere. \nNote que não há distinção entre maiúsculas e minúsculas.\nPor fim, é necessário contabilizar quantos tokens as strings tem em comum. \n\nA tarefa a ser realizada é encontrar qual  o token (de tamanho 2) que mais se repete e a sua frequência em uma dada string. No caso de empate, o token em menor ordem alfabética deve ser recuperado.","id":"2827","category":"Iniciante","statistics":{"level":"7 / 10","submissions":373,"solved":116,"ratio":"31.10%"}}