{"output":"Imprima n valores separados por um espaço seguindo as especificações do problema, caso não exista resposta para o i-ésimo elemento de V,  imprima “*” sem as aspas.","input":"A primeira linha consiste de único inteiro n (1 ≤ n ≤ 100000) que indica o tamanho do vetor.\n\nA próxima linha contém n inteiros ai (1 ≤ i ≤ n) que é o i-ésimo elemento do vetor (1 ≤ ai ≤ 100).","level":9,"name":"Desafio de Rangel","has_images":true,"description":"Rangel é um engenheiro da computação que, nas horas vagas, adora criar jogos divertidos para entreter os seus amigos.\n\nCerto dia, um professor pediu que ele criasse um jogo que envolvesse estruturas de dados para que os calouros de sua universidade perdessem o medo de AEDs (Algoritmos e Estruturas de Dados).\n\nDevido à grande dificuldade dos alunos com AEDs, Rangel criou um jogo baseado nos índices de um vetor e deu o nome de “Desafio de Rangel” (um jogo muito interessante e que pode ser jogado em qualquer plataforma).\n\nO jogo Desafio de Rangel funciona da seguinte maneira:\n\n\n\tÉ gerado um vetor V com n elementos;\n\tPara todo ai  V do vetor você precisa achar um elemento aj  V que seja maior que o ai e deve aparece depois ai, ou seja, aj > ai e j > i, além disso, ele precisa estar o mais próximo possível de ai. É possível que não existe um aj que satisfaça a condição, logo a resposta é “*”;\n\tO jogador deve digitar um vetor M tal que |M| = |V| e o jogo diz se ele acertou ou não.\n\n\nPor exemplo o vetor V = [1, 4, 7, 5], para a1 = 1 a resposta será 4 que está na posição a2, pois a2 > a1 e o índice 2 > 1 e a2 é a o mais próximo do a1, para a2 = 4 a resposta será 7 que está na posição a3, pois a3 > a2 e o índice 3 > 2, já para a3 = 7 a resposta será “*” pois não existe um aj (j > 3 e j ≤ |V|) que satisfaça as condições do jogo o mesmo acontece para o a4 = 5. Logo a resposta a ser digita no console é o vetor M = [4, 7, *, *].\n\nRangel está sem tempo de alimentar o banco de dados com as respostas corretas, pois ele está se preparando para uma competição e pede a você que as crie as respostas para ele, pois o semestre está quase iniciando e o professor está esperando o jogo.\n\nDado o vetor V, você deve criar um algoritmo que gere a sequência M seguindo as regras do jogo.","id":"2851","category":"Ad-Hoc","statistics":{"level":"9 / 10","submissions":606,"solved":110,"ratio":"18.15%"}}