{"output":"Exiba um único inteiro, a quantidade de dias que serão necesários para infectar todo o Brasil. Caso seja impossível, imprima -1.","input":"A primeira linha contém dois inteiros N e M (1 ≤ N, M ≤ 1000), representando o tamanho do mapa do Brasil.\nCada uma das próximas N linhas conterão M caracteres '#' ou '@', onde '#' representa uma área qualquer do território brasileiro e '@' representa uma área com um robô invisível de Bibika.","level":7,"name":"Invenções de Bibika","has_images":true,"description":"Bibika, uma mineira bacana, foi expulsa do Brasil por estar encomodando os políticos brasileiros com suas invenções mirabolantes. Sua última invenção foi o VDH (Vírus da Honestidade) que, quando em contato com um humano, o faria ser uma pessoa honesta para sempre (funcionaria até com os políticos!).\n\nApós alguns meses vagando de país em país, ela conseguiu um lar fixo na China. Em um belo dia, quando estava tirando fotos na Muralha da China, teve uma ideia de como espalhar o VDH no Brasil. Sua ideia seria espalhar alguns robôs invisíveis (sim, ela inventou robôs invisíveis) pelas cidades do Brasil e esses robôs lançariam o VDH aos poucos (assim não chamaria tanta atenção) até que todo o Brasil fosse infectado.\n\nVeremos o Brasil como um grid NxM, onde em alguma(s) célula(s) desse grid existirá um robô equipado com o VDH.\n\nUm robô consegue lançar o vírus para as quatro direções (Norte, Sul, Leste e Oeste) e inicialmente possui uma potência de lançamento igual a 1. Isso significa que no primeiro dia ele conseguirá infectar 1 célula em cada uma das direções. A cada novo dia sua potência aumenta em uma unidade, fazendo com que o robô no terceiro dia, por exemplo, infecte até 12 células, 3 em cada uma das direções.\n\nSegue um exemplo das posições infectadas por um robô, representado pelo caracter @, em um total de quatro dias:\n\n\n\nMesmo inventando o vírus da honestidade e os robôs invisíveis, Bibika não sabe quantos dias serão necessários para infectar todo o território Brasileiro, dada uma configuração de robôs. Vale ressaltar que as células que possuem robôs já estão automaticamente infectadas.\n\nSua tarefa é ajudá-la nessa missão ou dizer que não é possível infectar todo Brasil dada a configuração de robôs de Bibika.","id":"2853","category":"Ad-Hoc","statistics":{"level":"7 / 10","submissions":209,"solved":87,"ratio":"41.63%"}}