{"output":"Exiba um único inteiro, a maior quantidade de pães de queijo, de no máximo dois tipos diferentes, que Adson poderá comprar sem exceder seus R reais.","input":"A primeira linha contém dois inteirios N e R, (1 ≤ N, R ≤ 1000), representando a quantidade de barracas de pães de queijo recheados e a quantidade de dinheiro que Adson possui para esse fim. Cada uma das próximas N linhas conterá três inteiros X Z Y representando a informação da promoção de uma barraca: X pães de queijos com recheio Z por apenas Y reais. (1 ≤ X, Y ≤ 100) e Z = 'B', 'C', ou 'G', representando recheio de Bacon, Cheddar e Goiaba, respectivamente.","level":6,"name":"Viagem do Pão de Queijo","has_images":false,"description":"Adson, cansado de ficar em casa, resolveu fazer uma viagem de moto pelo Brasil. Ele se preparou por semanas anotando todas as cidades que visitaria e todos os pontos em que pararia para comer na estrada. Adson decidiu que iria parar apenas nas barracas de pão de queijo da famosa empresa PqR (Pães de queijo recheados). \n\nPreocupado em não gastar muito com os pães de queijo, ele anotou apenas os lugares que vendiam com a famosa promoção \"Leve X pães de quejio e pague Y reais\".\n\nAdson separou R reais para gastar com os pães de queijo. Como a gasolina já está cara demais, ele precisa da sua ajuda para escolher em quais barracas parar para comprar os pãos de queijo recheados de forma que consiga comprar a maior quantidade possível com no máximo R reais.\n\nA empresa PqR vende pão de queijo com três tipos diferentes de recheios: \"Bacon, Cheddar ou Goiaba\". Adson acha que não é uma boa ideia misturar todos os três tipos na sua viagem e decidiu que comprará pães de queijo de no máximo dois tipos diferentes de recheio.\n\nDadas as informações da quantidade N de barracas ao longo da viagem, a quantidade R de reais que Adson possui e o tipo de promoção que cada barraca vende \"X pães de queijo com recheio Z por Y reais\", sua tarefa é ajudá-lo dizendo qual a maior quantidade de pães de queijo conseguirá comprar sem descumprir a regra de comprar no máximo de dois tipos diferentes. Considere que ele não poderá comprar mais de uma vez em uma mesma barraca.","id":"2856","category":"Paradigmas","statistics":{"level":"6 / 10","submissions":313,"solved":93,"ratio":"29.71%"}}