{"output":"Para cada estrada que o rei considera contruir, deve ser impressa a distância máxima entre alguma cidade e seu representante mais próximo.","input":"A primeira linha da entrada consiste de um número t (t <= 10) referente à quantidade de casos teste.\n\nCada caso inicia-se com uma linha contendo o número n (2<=n<=100000), o número de cidades do reino.\n\nAs n-1 linhas seguintes contém dois inteiros a e b (0<=a,b<n) indicando que as cidades a e b estão conectadas por uma estrada.\n\nA linha seguinte contém um número q (0<=q<=100000), o número de estradas que o rei considera contruir.\n\nAs q linhas seguintes contém dois inteiros i e j (0<=i,j<n) indicando que o rei considera contruir uma estrada entre as cidades i e j. É garantido que ainda não há uma estrada entre as cidades i e j e essa estrada não deve ser levada em consideração nas perguntas subsequentes.","level":8,"name":"A Paz em Spar-Ta","has_images":false,"description":"O reino de Spar-Ta está crescendo muito. O rei, não conseguindo mais administrar todas suas cidades, irá mandar representantes dele para algumas delas.\n\nAtualmente, o reino é composto de n cidades conectadas por estradas bidirecionais de maneira que há um caminho único entre qualquer par de cidades. O rei irá construir uma nova estrada entre duas cidades ainda não conectadas e escolher as cidades para as quais mandar seus representantes.\n\nPor motivos burocráticos, os representantes devem estar em constante comunicação, e, para isso, o rei demanda que cada representante tenha dois outros em cidades vizinhas. Para não exceder a verba, cada cidade pode ter no máximo um representante, e o número de cidades com representantes deve ser o mínimo possível.\n\nCaso tenha algum problema em alguma cidade, o representante que vive mais perto dela deverá ir até lá para averiguar a situação. O rei teme, porém, que se ele demorar demais os cidadãos daquela cidade ficarão bravos e poderão ameaçar a paz no reino. Seu trabalho é averiguar, para cada estrada que o rei considera construir, qual a maior distância no reino entre alguma cidade e um representante, garantindo, assim, a paz em Spar-Ta.","id":"2860","category":"Estruturas e Bibliotecas","statistics":{"level":"8 / 10","submissions":58,"solved":19,"ratio":"32.76%"}}