{"output":"Em uma única linha, deve-se escrever \"Y\" se de fato o Tasco foi um dos times que foram mais vezes vice-campeão considerando-se todos os campeonatos, ou \"N\" caso contrário.","input":"A primeira linha da entrada é composta do inteiro 2 ≤ N ≤ 106 que constitui o número de times. Cada time recebe um código distinto entre 1 e N, sendo o código 1 reservado para o Tasco. Em seguida, há dados de vários campeonatos. A primeira linha de cada campeonato é formada pelo inteiro 1 ≤ M ≤ 105, que representa o número de partidas que ocorreram em tal campeonato. Cada uma das M linhas seguintes possui os dados de uma partida, no formato \"Time1 Placar1 Time2 Placar2\", onde 1 ≤ Time1,Time2 ≤ N são os códigos dos times que disputaram a partida e 0 ≤ Placar1, Placar2 ≤ 100 são seus respectivos números de gols. A pontuação de cada time em um campeonato é a soma dos pontos obtidos em cada partida do campeonato. Em uma partida, a pontuação para o time que consegue a vitória é de 3 pontos, o empate é de 1 ponto e a derrota é de 0 pontos. Um time fica à frente de outro no campeonato se possui mais pontos ou, no caso de mesma pontuação, se possui uma maior quantidade de gols ou, em caso de mesma quantidade de gols, se seu código é menor do que o do outro. O fim da entrada de campeonatos se caracteriza pela leitura de um valor de M igual a 0.","level":8,"name":"O Tasco é Sempre Vice!","has_images":false,"description":"É bem conhecida a provocação que afirma que o Tasco, um dos melhores times de futebol do Brasil, é sempre vice-campeão das competições nas quais participa. Embora isso seja um elogio (estar em tal elevada colocação com regularidade sem dúvida é um mérito!), a mania do brasileiro de valorizar apenas a primeira colocação dá o efeito de provocação a esta afirmativa. É claro que isto não passa de mais uma das incontáveis brincadeiras que fazem parte do folclore futebolístico, mas Eurico, um fanático pelo Tasco, decidiu verificar se há algum fundamento nela de uma vez por todas, analisando o registro histórico de todas as competições em que o Tasco participou.","id":"2889","category":"Estruturas e Bibliotecas","statistics":{"level":"8 / 10","submissions":265,"solved":57,"ratio":"21.51%"}}