{"output":"A saı́da consiste um único inteiro representando o número de formas de levar o couro da cobra Norato da margem\naté a área de queimada. Como esse número pode ser muito grande, imprima apenas o resto da sua divisão por 109+7.","input":"A primeira linha da entrada contém um inteiro N (1 ≤ N ≤ 40) sendo a quantidade de soldados. A próxima linha contém N inteiros distintos Ti (1 ≤ Ti ≤ 1018) representando o tamanho em metros do pedaço que cada soldado carrega por viagem. A terceira linha de um caso de teste contém um inteiro C (1 ≤ C ≤ 1018) representando o comprimento em metros da cobra.","level":5,"name":"Cobra Norato","has_images":false,"description":"Cobra Norato é uma lenda do folclore brasileiro, de origem indígena da região norte do Brasil, principalmente da Amazônia.\n\n\nDe acordo com a lenda, uma índia tapuia da região amazônica ficou grávida de um boto. \n\nNasceram gêmeos (um menino e uma menina), que na verdade eram cobras. A menina ganhou o nome de Maria Caninana, e o menino foi batizado de Norato. \n\n\nOs gêmeos foram deixados no rio Tocantins e lá se criaram.\n\n\nCobra Norato era bom, salvava quem estava se afogando e ajudava os barqueiros e pescadores em perigo. Caninana era o oposto: atacava as pessoas. \n\n\nNorato costumava visitar a mãe e frequentar os bailes da cidade, pois adorava dançar. Nesses dias, saía da água, deixava a enorme pele de cobra na margem e se transformava em homem. No fim da noite, punha a pele de cobra e voltava para o rio.\n\n\nNorato queria se desencantar, para se tornar homem de vez e deu a receita para quebrar o encanto a diversos amigos, mas nenhum deles teve coragem de ir até o fim. Finalmente, um soldado conseguiu desencantá-lo. \n\n\nA lenda termina contando que a pele de Cobra Norato foi queimada e que o rapaz Honorato viveu durante muitos anos no Pará, onde era querido por todos.\n\n\nO que a lenda não conta é que houve todo um trabalho do soldado e seus companheiros de batalhão para dividir o enorme couro da cobra em partes e levar dali para outro lugar onde não causasse um incêndio na Mata.\n\n\nO comprimento do couro foi dividido em pedaços variados. Os tamanhos dos pedaços eram de acordo com o comprimento fixo que cada soldado levava em uma ida até a fogueira.\n\n\nAlém disso, o batalhão era de tal forma que um soldado mais forte sempre conseguia levar, em uma única viagem, exatamente várias vezes o tamanho que um soldado mais fraco conseguia, porém, nenhuma fração a mais ou a menos. E havia um soldado que sempre carregava pedaços de tamanho um.\n\n\nDado o comprimento da cobra e os tamanhos que cada soldado carrega, determine número de formas que os soldados podem ter levado o couro da cobra até a fogueira.\n\n\nUma forma é considerada diferente da outra se o número de viagens da margem do rio à fogueira é diferente para algum soldado.","id":"2937","category":"Matemática","statistics":{"level":"5 / 10","submissions":9,"solved":1,"ratio":"11.11%"}}