{"output":"A saída é um único inteiro representando a quantidade de folhas de vitórias-régias que ficaram com alguma grama de comida ao final da jornada do jaçanã.","input":"A primeira linha da entrada contém três inteiros: P (1 ≤ P ≤ 20000),  C (1 ≤ C ≤ 20000) e N (1 ≤ N ≤ 100). Representando respectivamente o peso do pássaro e o peso da comida que ele carrega. Ambos dados em gramas.  E a quantidade de folhas de vitória-régia alinhadas entre as margens. A próxima linha contém N inteiros V (1 ≤ V ≤ 40000) separados por um único espaço em branco. Representando os pesos em gramas que as folhas de vitória-régia, da esquerda para direita, suportam sem afundar.\n\n\t\t\tSaída\n\n\t\t\t\n\t\t\t\t A saída é um único inteiro representando a quantidade de folhas de vitórias-régias que ficaram com alguma grama de comida ao final da jornada do jaçanã.  \n\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\t\tExemplos de Entrada\n\t\t\t\t\t\tExemplos de Saída\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t5000 1200 5\n\t\t\t\t\t\t\t6100 5750 5500 5200 5050\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t4\n\n\t\t\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t\n\n\n    \n        \n        \n        \n            \n                \n\t\t\t\t\t800 300 4\n\t\t\t\t\t1200 1000 2000 900\n\n                \n                \n                    2\n\n                \n            \n        \n    \n\n        \n    \n    \n        \n        \n        \n            \n                \n\t\t\t\t\t800 300 4\n\t\t\t\t\t1050 1000 2000 900\n\n                \n                \n                    2\n\n                \n            \n        \n    \n\n    \n\n\n    \n        \n        \n        \n            \n                \n\t\t\t\t\t800 300 10\n\t\t\t\t\t1063 1075 1050 2000 1000 1024 989 900 961 932\n\n                \n                \n                    4\n\n                \n            \n        \n    \n    \n    \n    \n    \n        \n        \n        \n            \n                \n\t\t\t\t\t1000 500 7\n\t\t\t\t\t1400 1200 1123 1000 1000 400 100\n\n\n                \n                \n                    3\n\n                \n            \n        \n    \n    \n\n\t\t\t\n\t\t\t\tIII Maratona de Programação do Norte","level":5,"name":"Jaçanã","has_images":true,"description":"Jaçanã é uma ave encontrada na região amazônica e comumente vista buscando alimento sobre as vitórias-régias que são plantas aquáticas típicas dessa região também. Estas possuem uma grande folha em forma de círculo, com bordas levantadas, que fica sobre a superfície da água e pode chegar a até 2,5 metros de diâmetro e suportar até 40 quilogramas.\n\t\t\t\t\n\t\t\t\t\n\n\t\t\t\t Certo dia, um jaçanã de asa quebrada queria levar, da margem esquerda de um igarapé até a margem direita, um montante de insetos que havia coletado para comer. Para isso, ele decidiu pular com a sua comida no bico através de um caminho de vitórias-régias que se alinhou entre uma margem e outra. Porém, as vitórias-régias possuiam tamanhos variados, logo, aguentavam pesos diferentes. Então, sempre que o jaçanã pulou para uma vitória-régia que suportava menos peso do que ele carregava, ele precisou deixar parte da sua comida onde estava antes de pular. Caso contrário, afundaria ao pousar na próxima planta. \n\n\t\t\t\t Observe que, dependendo da capacidade das vitórias-régias no caminho, o passáro pode nem ter alcançado a margem direita. Contudo, é da natureza dele seguir em frente em qualquer situação, nunca voltando atrás e sempre tentando levar o máximo de comida até a outra margem.\n\t\t\t\t\n\t\t\t\t Sua tarefa é, dado o peso do jaçanã, o peso da seu montante de insetos e as capacidades das vitórias-régias da esquerda para direita, dizer em quantas folhas de vitória-régia o pássaro deixou alguma parte da sua comida.","id":"2938","category":"Ad-Hoc","statistics":{"level":"5 / 10","submissions":229,"solved":81,"ratio":"35.37%"}}