{"output":"A saída consiste em uma linha por consulta. Cada linha contém \"S\" (sem aspas) se a respectiva viajem é possível ou \"N\" (sem aspas), caso contrário.","input":"A primeira linha da entrada consiste de dois números inteiro N (2 ≤ N ≤ 105) e M (2 ≤ M ≤ 105) representando respectivamente a quantidade de botões no painel \\(A\\) e no painel \\(B\\). A segunda linha da entrada consiste N inteiros Ai (1 ≤ Ai ≤ 109) representando os botões no painel \\(A\\). A terceira linha da entrada consiste M inteiros Bi (1 ≤ Bi ≤ 109) representando os botões no painel \\(B\\). A quarta linha da entrada consiste de um número inteiro Q (1 ≤ Q ≤ 105) representando o número de consultas sobre possíveis viajens. Cada uma das Q linhas seguintes contém dois inteiros S (1 ≤ S ≤ 109) e T (1 ≤ T ≤ 109) representando respectivamente o ano de partida da máquina e o ano pretendido de chegada. Cada consulta é independente da outra.","level":5,"name":"Máquina do Tempo Quebrada","has_images":false,"description":"Farcos possui uma máquina do tempo, e ela pode viajar\ttanto para o futuro quanto para o passado, porém ela está quebrada e não consegue\tfazer duas viajens seguidas do mesmo tipo, ou seja, ela não pode fazer duas viajens consecutivas para o futuro e nem duas viajens consecutivas para o passado. Além do mais, ela não pode viajar uma quantidade arbitrária de anos no tempo. O tamanho em anos de um salto para o futuro é determinado pelos botões no painel \\(A\\) onde apertar um botão \\(X\\) significa fazer uma viajem de \\(X\\) anos para o futuro. Da mesma forma os tamanhos do salto para o passado são determinados pelos botões no painel \\(B\\). \n\n\t\t\t\t Apesar de possuir dois painéis, a máquina foi projetada inicialmente para possuir apenas um único painel. Onde todos os botões estariam ordenados de forma não-descrescente da esquerda para direita. Mas essa idéia foi logo descartada visto que os botões de ao menos um dos dois tipos (\\(A\\) e \\(B\\)) nunca ficavam todos juntos, formando assim um padrão estético não muito agradável.  \n\t\t\t\t\n\t\t\t\t Sua tarefa é, dado o valor dos botões que estão no painel \\(A\\) e \\(B\\), e o ano atual em que Farcos está, responder se ele consegue viajar para determinado período de tempo.\n\n\t\t\t\t O primeiro salto da máquina sempre é para o futuro.","id":"2940","category":"Ad-Hoc","statistics":{"level":"5 / 10","submissions":15,"solved":4,"ratio":"26.67%"}}