{"output":"A saída consiste em um única linha contendo o menor custo em milhares de reais de montar a rede de acordo com as especificações.","input":"A primeira linha da entrada contém um inteiro N (1 ≤ N ≤ 450) representando a quantidade de sedes participantes da Maratona. As próximas N linhas contém N inteiros separados por espaço em branco cada uma.\n\t\t\t\tNa \\(i\\)-ésima linha da \\(j\\)-ésima coluna há um inteiro C que tem seu significado dependente da sua posição: \n\t\t\t\t\n\t\t\t\t\t Se \\(i\\) > \\(j\\) , C (0 ≤ C ≤ 1) tem valor 1 se já existe um cabo de fibra ótica entre a \\(i\\)-ésima e a \\(j\\)-ésima sede, ou 0, caso contrário.\n\n\t\t\t\t\t Se \\(i\\) < \\(j\\) , C (1 ≤ C ≤ 103) representa o custo, em milhares de reais, de construir uma conexão direta entre a \\(i\\)-ésima e a \\(j\\)-ésima sede caso ela não exista, ou de remover o cabo, em caso contrário. \n\t\t\t\t\n\t\t\t\t Se \\(i\\) \\(=\\) \\(j\\) , C vale 0 e pode ser ignorado já que nunca haverá a necessidade de colocar ou retirar um cabo de fibra ótica entre uma sede e si mesma. \t\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\t\n\t\t\t\tObserve que as linhas são numeradas de cima para baixo a partir de 1 e as colunas, da esquerda para direita também a partir de 1.","level":5,"name":"Fibra Ótica","has_images":true,"description":"A Região Norte é uma das cinco regiões do Brasil definidas pelo Instituto Brasileiro de Geografia e Estatística (IBGE) em 1969. Com uma área de 3 853 676,948 km² - a maior entre as cinco regiões - cobre 45,25% do território nacional, sendo superior à área da Índia e pouco inferior à União Europeia. Se fosse um país, seria o 7º maior do mundo em área. Sua população, também de acordo com o Instituto Brasileiro de Geografia e Estatística (IBGE), era de 18,1 milhões de habitantes em 2018, equivalente à população do Chile. Ela é formada por sete estados, sendo estes: Acre, Amapá, Amazonas, Pará, Rondônia, Roraima e Tocantins, os quais possuem 22, 16, 62, 144, 52, 15 e 139 municípios respectivamente.\n\t\t\t\t\n\t\t\t\t\n\n\t\t\t\t É nessa Região que é sediada a Maratona de Programação do Norte. Uma competição que devido ao fato de possuir várias sedes fazendo a prova simultaneamente - no máximo uma por munícipio - necessita de uma boa conexão de internet em todas elas para garantir condições iguais de prova. \n\t\t\t\t\n\t\t\t\tPara tentar resolver esse problema, os coordenadores da Maratona pretendem fazer um projeto ambicioso: conectar todas as sedes através de cabos de fibra ótica. Porém, essa é uma tecnologia muito cara, então eles querem projetar essa rede de conexões de forma a minizar os custos.\n\n\t\t\t\t Essa rede será uma rede ponto-a-ponto minimal, o que significa que a comunicação entre quaisquer dois pontos deverá ser possível e de forma única. Não havendo duas rotas diferentes para tráfego de dados entre o mesmo par de pontos.\n\n\t\t\t\t Ainda no intuito de diminuir os custos, contudo manter a conexão minimal, o projeto leva em consideração aproveitar alguns cabos já existentes entre sedes ou até remover alguns.\n\n\t\t\t\t Sua tarefa é, dado os custos de colocar os cabos inexistentes e os de remover os que já tem, calcular o menor custo para fazer essa rede nas condições especificadas.","id":"2941","category":"Grafos","statistics":{"level":"5 / 10","submissions":78,"solved":39,"ratio":"50.00%"}}