{"output":"Você deve imprimir um inteiro que representa a quantidade mínima de estradas a serem construídas pelo governo.","input":"A entrada consiste em um único caso de teste.\n\t\t\t\tA primeira linha é composta por três inteiros V (1 ≤ V ≤ 2\\(\\times\\)104), E (0 ≤ E ≤ 2\\(\\times\\)105), S (1 ≤ S ≤ V), o número de empresas na Zona Franca de Manaus, a quantidade de estradas não alagas e a empresa que será o centro da operação de distribuição respectivamente.\n\t\t\t\tSegue então S linhas, cada uma com dois inteiros X e Y (1 ≤ X,Y ≤ V) que indicam que existe uma estrada que conecta a empresa X a empresa Y.","level":5,"name":"Emergência em Manaus","has_images":false,"description":"Na cidade de Manaus existe um importante polo industrial que contém uma grande variedade de empresas de diversos setores. Tal região é conhecida como Zona Franca de Manaus.\n\t\t\t\tPara facilitar o fluxo de matéria prima vindo da cidade até o polo industrial, o governo de Manaus, construiu várias estradas que conectam as empresas entre si.\n\t\t\t\tDevido ao grande volume pluvial repentino, várias das estradas construídas pelo governo foram alagadas, assim, gerando lentidão na distribuição da matéria prima.\n\t\t\t\tO governo de Manaus juntamente com o Conselho Estadual de Engenharia de Trânsito do Amazonas desenvolveram uma solução, à curto prazo, com a finalidade de não congelar por completo a Zona Franca. Essa medida consiste em construir algumas estradas emergenciais e manter todas as fábricas conectada mesmo que indiretamente, mas diferente da configuração anterior, o novo sistema terá as seguintes restrições:\n\t\t\t\t\n\t\t\t\t\tTodas as estradas agora só poderão ser utilizadas em um único sentido, com a esperança de usar a outra faixa para aumentar o fluxo;\n\t\t\t\t\tTodos os caminhões chegarão por uma única empresa S e será distribuído às demais empresas a partir das estradas que partem de S.\n\t\t\t\t\n\t\t\t\tO governo precisa ser ágil, pois cada dia custa milhões, assim, eles contam com você para determinar a quantidade mínima de estradas que precisam ser construídas com a finalidade de que todas as demais empresas possam ser alcançadas a partir da empresa S.","id":"2944","category":"Ad-Hoc","statistics":{"level":"5 / 10","submissions":151,"solved":29,"ratio":"19.21%"}}