{"output":"A saída consiste em um única linha contendo a maior soma de notas que a turma pode obter.","input":"A primeira linha da entrada consiste de um número inteiro K (1 ≤ K ≤ 102) representando a quantidade de questões na prova. A segunda linha da entrada consiste K carecteres maiúsculos do alfabeto inglês sem espaços em branco representando as respostas de Desafortunato. A terceira linha contém um inteiro N (1 ≤ N ≤ 102) representando a quantidade de colegas de classe de Desafortunato. As próximas N linhas contém K caracteres maiúsculos do alfabeto inglês cada uma, sem espaços em branco. Cada linha corresponde a folha de respostas de um colega de Desafortunato.","level":5,"name":"Gabarito","has_images":true,"description":"Desafortunato é um aluno de ensino médio em uma prestigiada escola. As provas nessa escola são famosas por terem um formato bem definido mas também por serem de um nível bem elevado. Elas são sempre objetivas, ou seja, são composta por um enunciado e por várias opções de resposta enumeradas com letras maiúsculas, porém, diferente das provas objetivas tradicionais, cada questão da prova nesse colégio tem 26 opções de resposta, usando assim todas as letras do alfabeto inglês. E somente uma dentre essas opções está correta.\n\n\n\n\nEsse ano a turma de Desafortunato pretende ganhar o prêmio de melhor turma do colégio o qual concede algumas regalias em relação à atividades extra-classe. E para atingir esse objetivo a turma precisa ter a maior soma de notas na prova final. O que preocupou bastante Desafortunato que após ter feito a prova final teme não ter tido um bom desempenho.\n\n\nPreocupados também com o prêmio em jogo e sabendo que Desafortunato é bem conhecido pela sua falta de sorte, a turma quer estimar quais suas chances de ganhar considerando o pior dos casos em relação ao colega azarado: Ele errando todas as respostas.\n\n\nDado a cópia das folhas de respostas de todos os alunos da turma e considerando que Desafortunato errou todas as questões da prova, calcule qual a maior soma de notas que a turma ainda pode atingir.\n\n\nLembre-se que em uma folha de resposta a primeira letra corresponde à resposta do aluno à primeira questão da prova, a segunda letra corresponde à resposta da segunda questão e assim por diante.","id":"2947","category":"Ad-Hoc","statistics":{"level":"5 / 10","submissions":144,"solved":97,"ratio":"67.36%"}}