{"output":"Número máximo de tempo que Ethan conseguiu se manter vencedor do Jogo.","input":"A primeira linha da entrada contém um inteiro N(0 < N ≤ 10), indicando o número de frases ditas na conversa. As próximas N linhas contém as frases ditas nas conversas dos amigos de Ethan.\n\nCada frase irá conter no máximo 100000 caracteres, sendo eles letras, maiúsculas e minúsculas, espaços ou pontuação (vírgula e ponto final).","level":1,"name":"O Jogo","has_images":false,"description":"Se você está lendo este problema, você perdeu O Jogo. Sim, a regra do Jogo é: se você lembrar do Jogo, você perde.\nEthan Hawke era um garoto intrigado demais com O Jogo, e queria bolar formas de ficar o máximo de tempo possível sem perder, então percebeu que, para perder, basta que algum de seus amigos digam “Jogo” ou “Perdi” em suas conversas virtuais, que automaticamente ele lembra e perde o Jogo, podendo ser com letras maiúsculas ou minúsculas.\nEthan gostaria de calcular o tempo em que vence o Jogo. O cálculo de tempo se efetua da seguinte forma: As conversas dos amigos são virtuais, e para ler uma letra, ele demora 1 segundo, o qual caracteres especiais como pontuação e espaços não são considerados. Se em algum momento, as palavras que fazem Ethan perder aparecerem, ele perde o Jogo e o cálculo se reinicia.\nPor exemplo, na frase: “Estava jogando um jogo ontem, e ele era bom”. Ethan venceu o jogo em: “Estava jogando um jogo”. Totalizando 19 segundos em que venceu (contagem das letras). Como a palavra “jogo” apareceu, aqui ele perde e a contagem de tempo reinicia. E continua vencendo em “ontem, e ele era bom”, por mais 15 segundos. Assim, o máximo de tempo em que ele era vencedor foi de 19 segundos. O mesmo valeria se a palavra “perdi” aparecesse. Lembrando que essas duas palavras só irão fazer a pessoa perder, se forem inteiras, e não sub palavras de outras, pois quando isso acontece, as pessoas não as percebem e, assim, não perdem o jogo.\nDada uma lista de frases ditas por Ethan e seus amigos, indique qual foi o maior tempo em que ele conseguiu ficar como vencedor do Jogo, em cada uma delas.","id":"2954","category":"Strings","statistics":{"level":"1 / 10","submissions":30,"solved":17,"ratio":"56.67%"}}