{"output":"A saída contém dois inteiros, indicando o número de possibilidades de vencer e o número mínimo de rodadas para Josh vencer o jogo de forma perfeita.\n\nDetalhe: O número de possibilidades pode ser muito grande, então deve-se mostrar o valor que esse número deixaria de resto ao ser dividido por 109 + 7.","input":"A entrada contém um inteiro X(1 < X ≤ 1000), indicando o número de pontos necessários para vencer a partida de Truco.","level":1,"name":"Truuuuuco!","has_images":false,"description":"Ninguém nunca fez essa tese, mas é intuitivo dizer que os cursos de Técnico em Informática e Ciência da Computação possuem as maiores lendas do jogo tradicional Truco.\n\nA galera dos “computer” ama tanto esse jogo que ao longo dos anos foram propondo novas regras e novos sistemas de pontuação para tornar o jogo cada vez mais desafiador.\n\nNão entraremos nos detalhes das regras do jogo, primeiramente porque todo mundo deve conhecer, dado o nicho dessa prova; em segundo lugar que, para este problema, não estamos interessados nas regras, mas no sistema de pontuação.\n\nO jogo é feito em rodadas, e a equipe que alcançar ou ultrapassar X pontos vence (arcaicamente eram 12 ou 15 pontos, mas com o tempo tornaram o truco uma experiência mais dinâmica). Em cada rodada, uma equipe pode ganhar 1 ou uma quantidade múltipla de 3 em pontos (a famosa gritaria).\n\nSe não for necessário “trucar”, ou seja, faltar apenas 1 ponto para vencer, é proibido trucar. Regra universal, não questione.\n\nLembrando que se o múltiplo de 3 da trucada for maior ou igual ao restante dos pontos para vencer o jogo, não é necessário que o oponente aumente-o mais. (Muita gente gosta de continuar a gritaria, mesmo não fazendo sentido, mas aqui temos pessoas civilizadas e inteligentes).\n\nConsidera-se, também, que uma pessoa venceu de forma perfeita, quando consegue alcançar exatamente o número de pontos, sem ultrapassar.\n\nJosh Homme é um calouro do curso de computação e quer chegar “mitando” no truco. Ele já conhece programação e deseja criar um programa que dada a quantidade de pontos para vencer, indique quantas possibilidades existem para vencer (chegar a X pontos ou ultrapassar) e o número mínimo de rodadas para se vencer de forma perfeita.","id":"2955","category":"Matemática","statistics":{"level":"1 / 10","submissions":5,"solved":5,"ratio":"100.00%"}}