{"output":"A saída contém um único inteiro representando a quantidade de técnica obtida por César após seu estudo, utilizando o truque de seu avô para estudo.","input":"A primeira linha da entrada é composta por dois inteiros N (0 < N ≤ 100) e D (0 < D ≤ 31), que indicam, respectivamente, quantas músicas havia na lista do vô de César e em qual dia do mês César estava aprendendo. As próximas N linhas indicam os nomes das bandas da lista, o qual cada nome é uma cadeia de caracteres podendo ter espaços separando os nomes. O nome de cada banda não irá superar 100 caracteres. Pode-se considerar que letras maiúsculas e minúsculas são iguais. (A == a).","level":1,"name":"Sir Vô","has_images":false,"description":"César é um rapaz destemido, aprendeu a tocar baixo inspirado pelo seu avô, um dos maiores baixistas de todos os tempos, e deseja ser bom o suficiente para tocar todas as músicas do Rainhas da Era da Pedra, sua banda favorita.\n\n\t\t\t\tCerto dia, seu avô lhe apresentou diversas bandas que curtia quando mais novo, e César se vê inspirado a aprender mais sobre elas para melhorar sua própria técnica.\n\n\t\t\t\tCésar estava confuso e sem saber em quais bandas iniciar o estudo e pediu ajuda a seu avô, quem lhe prometeu ensinar um truque milenar passado de gerações em gerações, que foi o segredo de muitos músicos.\n\n\t\t\t\tO truque, afinal de contas, não era muito complexo. Cada banda agrega um valor de técnica ao ser estudada, e esse valor se dá pela quantidade de letras no nome da mesma, assim, basta, dentre as bandas, escolher um conjunto limitado (pois obter a técnica de muitas bandas pode ser prejudicial), de forma a maximizar o ganho de técnica. O truque revela que o tamanho máximo desse conjunto deve ser com base no dia do mês em que se estiver estudando.\n\n\t\t\t\tApós aprender o truque, César estava cansado e foi dormir. Durante o sono, Ronnie James Dio (se você não conhece, saindo dessa prova, vá conhecer!), aparece em seu sonho, e diz que a técnica do seu vô estava certa, porém, faltou um detalhe: não se deve escolher mais de uma banda com a mesma letra inicial! César sabia que não podia duvidar de Dio, pois quem duvidaria, não é mesmo?!\n\n\t\t\t\tDada uma lista de bandas que o vô de César lhe apresentou, e o dia em que César está estudando, indique quanto de técnica César obteve ao final de todo seu estudo, sabendo que ele escolheu um conjunto de bandas de forma a maximizar a técnica total obtida, respeitando as restrições do truque de seu vô.","id":"2957","category":"Ad-Hoc","statistics":{"level":"1 / 10","submissions":43,"solved":15,"ratio":"34.88%"}}