{"output":"Deve conter o relatório apresentado na descrição do problema. A ordem das informações pode ser vista no caso de teste. O nome da linguagem deve ser apresentado em letras maiúsculas, e as palavras, em minúscula. O resultado da fórmula deve ser apresentado com uma casa decimal. Se o total de consoantes for nulo, em vez do total de horas, deve ser mostrado a mensagem “Linguagem Ruim”, no final do relatório.","input":"A primeira linha contém um inteiro N, indicando o número de seleções aleatórias que fez. As próximas N linhas descrevem as seleções. Cada seleção inicia com um inteiro M, indicando a quantidade de livros que escolheu para esta seleção. Cada uma das M linhas seguintes descreve o título de um livro, que é uma cadeia de caracteres, podendo conter letras maiúsculas, minúsculas e espaços.\n\nLimites: 1 ≤ N ≤ 100;\n\n 1 ≤ M ≤ 20;\n\n Cada nome de livro não supera 100 caracteres.","level":1,"name":"Era Uma Vez…","has_images":false,"description":"Desde criança, histórias nos fascinam. Seja aventura, ficção científica, romance... independente do gênero, toda história, se bem contada, nos proporciona conhecimento, escape e muito divertimento.\n\nMuitas histórias nos são apresentadas em formato de livro, e este é um dos bens mais valiosos de nossas vidas. Infelizmente, muitas pessoas menosprezam livros, pois elas não têm conhecimento do quão importante essa mídia é.\n\nCate é uma garota que adora leitura, e quanto mais livros consome, mais quer consumir. Com o tempo, adquiriu muitos, e tem quase uma biblioteca em casa. Certo dia, estava buscando formas de aproveitar ainda mais seus livros, e percebeu algo interessante: se pegasse a primeira letra de cada título, conseguia formar palavras interessantes. Então, decidiu pegar alguns livros de forma aleatória e, com a primeira letra do título de cada um, formar palavras.\n\nApós gerar várias palavras, decidiu que iria criar uma nova linguagem, baseada nestas palavras. O nome da linguagem seria o conjunto de letras iniciais das palavras geradas. Como é uma pessoa muito perfeccionista, gostaria de gerar, para sua nova linguagem, um relatório que contém: Qual a quantidade distinta de vogais e consoantes existem na sua linguagem. Ela também gosta de exatas (apesar de não ser muito boa), e propôs uma fórmula que dita quanto tempo uma pessoa demoraria para aprender essa nova linguagem. A fórmula é a seguinte: (número total de letras distintas + número de vogais) dividido pela quantidade total de consoantes. A métrica usada, para este valor, é horas. O resultado dessa fórmula também deve estar presente no relatório.\n\nComo o mais novo livro de Dão Brão, seu autor favorito, foi publicado, está muito ocupada lendo, mas pediu para você criar um programa, que dadas as seleções aleatórias de livros que fez, indique as palavras criadas e gere o relatório descrito acima.","id":"2960","category":"Strings","statistics":{"level":"1 / 10","submissions":84,"solved":9,"ratio":"10.71%"}}