{"output":"For each case, output the case number followed by the minimum time required. If it is impossible to move them as described, print ‘trapped’ instead of the time. Note that the first case corresponds to the above picture.","input":"The first line of input is an integer, T (T < 50), that indicates the number of test cases. Each case starts with an integer N (2 < N < 10).  Each of the next N lines contain N characters each that fills up the maze.","level":8,"name":"Going Together","has_images":true,"description":"You are playing a computer game in which three robots (Aneed, Ben and Cindy) are trapped in a labyrinth. Initially all three are \nsituated in three different locations in the maze. There are three outlets through which the robots have to exit. As expected, \nthere are several obstacles in the maze and the robots can't go through them.  \n  \t\n    \nThe maze can be modeled as a square grid with NxN. cells. The robots are placed on three different cells into the maze. You \ncan command them to move. A single command will be activated for the three robots simultaneously. A robot will move to a \nnew position if it is an empty cell within the maze or it is one of the target cells, otherwise the command will be ignored for \nthat robot. Your task is to command them such a way that all of them are on three exit cells (in any order). \n\t\n    \n\tA move consists of one of the following\t(Each move takes 1 unit of time):\n\tMove North - The robots move one cell north.\n\tMove East  - The robots move one cell east.\n\tMove South - The robots move one cell south.\n\tMove West  - The robots move one cell west.\n    \n\tEach cell consists of one of the following characters:\n\tA – Initial position of Aneed\n\tB – Initial position of Ben\n\tC – Initial position of Cindy\n\t. – An empty cell\n\t# - An obstacle\n\tX – A target cell\n    \n\tAssume that for every maze each of the letters (A B C) will appear exactly once and the letter X will appear exactly 3 times.","id":"1057","category":"Graph","statistics":{"level":"8 / 10","submissions":908,"solved":264,"ratio":"29.07%"}}