{"output":"For each test case in the input, your program must print one line containing:\n\n\t\n\t\tthe word divisa (means border in Portuguese) if the residence is on one of the border lines (North-South or East-West);\n\t\n\t\tNO (means NW in Portuguese) if the residence is in Northwestern Nlogonia;\n\t\n\t\tNE if the residence is in Northeastern Nlogonia;\n\t\n\t\tSE if the residence is in Southeastern Nlogonia;\n\t\n\t\tSO (means SW in Portuguese) if the residence is in Southwestern Nlogonia.","input":"The input contains several test cases. The first line of a test case contains one integer K indicating the number of queries that will be made (0 < K ≤ 103). The second line of a test case contains two integers N and M representing the coordinates of the division point (-104 < N, M < 104). Each of the K following lines contains two integers X and Y representing the coordinates of a residence (-104 ≤ X, Y ≤ 104).\n\n\tThe end of input is indicated by a line containing only the number zero.","level":1,"name":"Division of Nlogonia","has_images":true,"description":"After centuries of hostilities and skirmishes between the four nations living in the land generally known as Nlogonia, and years of negotiations involving diplomats, politicians and the armed forces of all interested parties, with mediation by UN, NATO, G7 and SBC, it was at last agreed by all the way to end the dispute, dividing the land into four independent territories.\n\n\tIt was agreed that one point, called division point, with coordinates established in the negotiations, would define the country division, in the following way. Two lines, both containing the division point, one in the North-South direction and one in the East-West direction, would be drawn on the map, dividing the land into four new countries. Starting from the Western-most, Northern-most quadrant, in clockwise direction, the new countries will be called Northwestern Nlogonia, Northeastern Nlogonia, Southeastern Nlogonia and Southwestern Nlogonia.\n\n\t \n\n\tThe UN determined that a page in the Internet should exist so that the inhabitants could check in which of the countries their homes are. You have been hired to help implementing the system.","id":"1091","category":"Ad-Hoc","statistics":{"level":"1 / 10","submissions":9136,"solved":5802,"ratio":"63.51%"}}