{"output":"For each test case in the input, your program must print a single line. The line must contain a real number representing, in terms of percentages, the probability that Vampire 1 wins the combat. The result must be printed as a real number with exactly one decimal figure.","input":"The input contains several test cases. Each test case is given in one single line, containing four integers EV1, EV2, AT and D separated by spaces (1 ≤ EV1, EV2 ≤ 10, 1 ≤ AT ≤ 5 and 1 ≤ D ≤ 10). The end of input is indicated by one line containing only four zeros, separated by spaces.","level":4,"name":"Vampires","has_images":false,"description":"Felipinho is thrilled with his new RPG game, about wars between clans of vampires. In this game he plays a vampire that repeatedly comes into combat against vampires from other clans. Such battles are won or lost based on some characteristics of the opponents, with the help of a standard six-faced dice. For simplicity, we will consider only the fight between two vampires, Vampire 1 and Vampire 2. Each vampire has a vital energy (denoted respectively by EV1 and EV2). Besides, an attack force AT and a damage capacity D are also given.\n\n\tThe combat is fought in turns, in the following way. At each turn, the dice is rolled; if the result value is less than or equal to AT, Vampire 1 wins the turn, otherwise Vampire 2 wins. The winner then sucks the value D from the loser\\'s vital energy. That is, D points are subtracted from the loser's vital energy and added to the winner's vital energy. The combat continues until one of the fighters has EV less than or equal to zero.\n\n\tFor example, suppose EV1=7, EV2=5, AT=2 and D=4. The dice is rolled and the result value is 3. Then, Vampire 2 wins the turn, and therefore 4 points are subtracted from EV1 and added to EV2. The new values for the vital energies would be EV1=3 and EV2=9. Notice that, if in the next turn Vampire 2 wins again, the combat ends. The values of AT and D are constant throughout the combat; only EV1 and EV2 vary.\n\n\tDespite loving the game, Felipinho thinks that the combats are too long, and suspects that, given the initial values of EV1, EV2, AT and D, it is possible to determine the probability of one of the players winning the combat, and that could help shorten the combat time. Felipinho has asked your help to verify his suspicion.","id":"1093","category":"Mathematics","statistics":{"level":"4 / 10","submissions":2212,"solved":1280,"ratio":"57.87%"}}