{"output":"For each test case in the input your program must print a line containing a single number, printed with precision of two decimal digits, indicating the minimum distance between the two spacecrafts. The distance between the two ships is always greater than zero.","input":"The input contains several test cases. The first line of the input contains an integer T, indicating the number of test cases. Each of the T test cases consists of eight lines, each line describing the coordinate of a vertex of a ship. The first four lines describe the vertices of the rebel spacecraft, the following four lines describe the vertices of the spacecraft of the Empire.\n\t\n\tEach coordinate description is a line containing three integers X, Y, Z indicating the coordinate of the vertex in space (−103 ≤ X ≤ 103, −103 ≤ Y ≤ 103, −103 ≤ Z ≤ 103). The four corners of each ship always define a tetrahedron of nonzero volume, and the two ships are always disjoint.","level":9,"name":"Star War","has_images":false,"description":"A long time ago, in a galaxy far, far away, there was an empire that dominated all others. A rebel alliance, unhappy with this situation, decided to fight these forces, with the objective of restoring democracy and peace for all nations.\n\t\n\tCaptain Cael, one of the rebel commanders, is sailing through space with his space cruiser, when he suddenly detects the presence of a ship of the Empire (according to the aesthetic standards of the time, all ships are tetrahedra). After a moment of surprise, Cael realizes he is in firing range and may place a cannon at any point of his ship.\n\t\n\tAs the power of his gun is fixed, Cael wants to position the cannon so that the distance traveled by the energy beam to the Empire\\'s ship is minimal, to maximize the damage. Therefore, he asked that you, sub-master Cin Talig, compute the shortest distance between the rebel spacecraft and the spacecraft of the Empire.","id":"1126","category":"Computational Geometry","statistics":{"level":"9 / 10","submissions":265,"solved":76,"ratio":"28.68%"}}