{"output":"For each test case print a single line with a single integer representing the size of the largest sequence of photos that can be produced.","input":"Each test case is given using several lines. The first line contains an integer N representing the number of strings in the set (1 ≤ N  ≤ 104). Each of the following N lines contains a different non-empty string of at most 1000 lowercase letters of the English alphabet. Within each test case, the sum of the lengths of all strings is at most 106.\n                    \n                    The last test case is followed by a line containing one zero.","level":9,"name":"Growing Strings","has_images":false,"description":"Gene and Gina have a particular kind of farm. Instead of growing animals and vegetables, as it is usually the case in regular farms, they grow strings. A string is a sequence of characters. Strings have the particularity that, as they grow, they add characters to the left and/or to the right of themselves, but they never lose characters, nor insert new characters in the middle.\n                    \n                    Gene and Gina have a collection of photos of some strings at different times during their growth. The problem is that the collection is not annotated, so they forgot to which string each photo belongs to. They want to put together a wall to illustrate strings growing procedures, but they need your help to find an appropriate sequence of photos.\n                \n                    \n                    Each photo illustrates a string. The sequence of photos must be such that if si comes immediately before si+1 in the sequence, then si+1 is a string that may have grown from si (i.e., si appears as a consecutive substring of si+1). Also, they do not want to use repeated pictures, so all strings in the sequence must be different.\n                \n                    \n                    Given a set of strings representing all available photos, your job is to calculate the size of the largest sequence they can produce following the guidelines above.","id":"1141","category":"Strings","statistics":{"level":"9 / 10","submissions":3126,"solved":374,"ratio":"11.96%"}}