{"output":"Print, for each test case, how many years would be necessary to the city A became greater than the city B (in inhabitants).\n\tRemember that if this time is greater than 100 it will be necessary printing the message: \"Mais de 1 seculo\". \n\tIn each one of these cases, maybe would be interesting interrupt the counting, otherwise you'll get \"Time Limit Exceeded\".","input":"The first line of the input contains a single integer T, indicating the number of test cases (1 ≤ T ≤ 3000).\n\tEach test case contains four numbers: two integers PA and PB (100 ≤ PA < 1000000, 100 ≤ PB ≤ 1000000, PA < PB) \n\tindicating respectively the population of A and B and two numbers G1 and G2 \n\t(0.1 ≤ G1 ≤ 10.0, 0.0 ≤ G2 ≤ 10.0, G2 < G1) with one digit after the decimal point each, indicating the populational growing (in percentual) for A and B respectively.  \n\tPay attention please: The population always is an integer number. So, a growing of 2.5% over a population of 100 will result in 102 (instead of 102.5) and  a growing of 2.5% over a population of 1000 will result in 1025. In addition, use double variables to the growing rate.","level":4,"name":"Population Increase","has_images":false,"description":"Mariazinha wants to solve an interesting problem. Given the population and growing rate of 2 cities (A and B), she would like to know how many years would be necessary to the smaller city (always A) to be greater than the larger city (always B) in population. Of course, she only wants to know the result for cities that the growing rate for city A is bigger than the growing rate for city B, therefore, she separated these test cases for you. Your job is to build a program that print the time in years for each test case.\n\t\n\tHowever, in some cases the time can be so big and Mariazinha don't want to know the exact time for these cases. In this way, for these test cases, it is enough printing the message \"Mais de 1 seculo\", that means \"More than a Century\".","id":"1160","category":"Beginner","statistics":{"level":"4 / 10","submissions":50411,"solved":17243,"ratio":"34.20%"}}