{"output":"For each instance print two lines. The first line should contain the first point of contact of the ball with the side of the field and the second line should contain the second point of contact. One point of contact should be printed as two rational numbers separated by a space. Print numbers with exactly 3 decimal places.","input":"The input consists of several instances and ends with the end of file (EOF). Each instance consists of a row containing six integers, X, Y, Dx, Dy, (-1000 <= Dx,Dy <= 1000), A e B, (1 <= A,B <= 500). The initial position of the ball is given by the point (X, Y) inside the ellipse and the direction vector (Dx, Dy).\n\t The field is shaped like an ellipse described by the equation\n\t\n\tx²    y² \n\t    -  +  -  = 1.\n\tA²    B² ","level":9,"name":"Myachowski, Russian Football","has_images":true,"description":"Many different sources are assigned to football. The oldest activity resembling football was practiced in China between the century. II and III BC and was called ts'uh Kuh (cuju), and was to play a little ball with feet to a network. In Japan there is kemari practiced today in cultural events. In Rome threw up harpastum, and in Greece the epislcyros. With the discovery of the new world was discovered Mayan also a game very similar to football, pok pok ta that have more than 3000 years of history. In the Middle Ages played in Florence the Florentine calcio, They consider many to be the birthplace of modern football. Until today the Amazon Indians play a very similar game in which a ball is pushed using just head toward enemy targets. Anyway, it's almost impossible to say which game gave the football played today, whose rules were formally established by the British in the late nineteenth century.\n\tLittle has news of a Russian game, also ancestor of football and with very clear rules (as Arnold would say). It is Myachowski, also known as Otskok. The name probably comes from My÷ (reads myach) which means \"ball\" in Russian. In the game a player enters a field that is a closed ellipse and must hit a hole located in the wall of the field. But the point is only computed if the ball goes into the hole after being kicked against the walls of the field, being diverted into the hole.\n\tGiven the initial position of the ball, the direction in which it is moving and the description of the field, your task is to determine next two points of contact of the ball with the side of the field. Consider that the center of the field is the position (0, 0).\n\tBall Reflection: Assume for this problem that is reflected perfectly the ball when it hits the wall of the field. That is, the angle of the input vector causes the tangent line to the wall of the field at the point of contact is the same as the departure angle. The Figure 1 illustrates this behavior.\n\t\n\t\n\t\n\t\n\tInput angle is the same that output angle","id":"1204","category":"Computational Geometry","statistics":{"level":"9 / 10","submissions":229,"solved":96,"ratio":"41.92%"}}