{"output":"For each test case, print a line with the word SIM (YES) if the white king is in checkmate, or the word NAO (NO), otherwise.","input":"The input consists of several test cases and ends with the end of file (EOF). The first line of each test \n\tcase contains one integer N (2 ≤ N ≤ 10) indicating \n\tthe number of black chess pieces. The next line contains the description of the positions of N black chess \n\tpeaces separated by a space. The third line contains the description of the white king.\n\tA description of one chess piece consists of 3 characters. The first indicates whether the chess piece is a pawn (P)(Peão), rook(T)(Torre), Bishop (B)(Bispo), Queen(R)(Rainha) or King (W)(Rei). Note that the great master did not use horses to facilitate who was still just learning the game. The second character between 'a' and 'h', indicates the column in which the chess peace is and the third, from '1 'to '8' \n\tindicates the line.\n\tNeither of the test cases is the situation in which the white king and the black king are adjacent.","level":10,"name":"Challenge of St. Petersburg","has_images":false,"description":"The Russia has always been the cradle of great chess masters. Few people know that the FIDE (World Chess Federation), which is the highest body regulating the game of chess was founded in 1924 from a movement begun 10 years before in the world championship of the sport that took place in St. Petersburg in 1914. Today, the top 10 players in the world, according to FIDE, three are Russians.\n\t\n\tThe tournament of St. Petersburg was also known by the attempts of the great masters of popularizing the game. At the time the greatest masters (like Capablanca) took to the streets to propose challenges for people in order to interest them to practice the game. One of these challenges was known as the Challenge of St. Petersburg. The great master rode a situation where the white pieces had only the king, and the goal was the person who said if the white king was or not in checkmate.\n\t\n\tIn the situation described above, the white king is checkmated if he is being attacked, and every move he makes leads him to a square that is also being attacked.\n\t\n\tWhat you need to know about chess\n\t\n\tConsider that initially the black chess pieces are at lines 7 and 8 while the white chess pieces starts at lines 1 and 2. There aren’t two chess pieces in the same square. The chess pieces considered in the problem (pawn, rook, bishop, queen and king) can’t go over to other parts, in other words, if during chess pieces’ movement there is any other chess piece on its way you must stop before or attacking the chess piece (if it is the opponent), taking its place. The movement and the attack of each type of chess peace are as follows:\n\t\n\t# Pawn: walking just one square forward (toward the line 1) can attack in any of the two diagonals immediately in front;\n\t# Rook: walk / attacks how many squares you want horizontally or vertically;\n\t# Bishop: walking / attacking how many squares you want diagonally;\n\t# Queen: walk / attacks how many squares you want horizontally or vertically, or diagonally;\n\t# King: walk / attacks just a square or horizontally, or vertically, or diagonally.","id":"1206","category":"Ad-Hoc","statistics":{"level":"10 / 10","submissions":943,"solved":232,"ratio":"24.60%"}}