{"output":"For each test case print a line containing a integer number, that is the minimum number of текущий needed to partition all the imperators of that test case.","input":"The input have many test cases and ends with the end of file (EOF). \n                    The first line of each test case contains two integers N (1 ≤ N ≤ 1000) and \n                    (M 0 ≤ M ≤ 10000) representing, respectively, the amount of \n                    emperors and the number of relationships that forum membership. The emperors are identified by numbers from 1 to \n                    N. Each of the next M lines of the test case contains two integers \n                    Pi (1 ≤ Pi <Fi) and \n                    Fi (Pi <Fi ≤ N), \n                    indicating that Pi's father Fi. A particularity of genealogy \n                    is given in case of paternity doubts, all possible parents were listed, ie a person can have any \n                    number of parents.","level":7,"name":"St. Petersburg Dynasties","has_images":false,"description":"St. Petersburg was founded on May 27, 1703 by Tsar Peter the Great, and was the imperial capital of Russia for a \n                    short period immediately after (1713 to 1728) and then for nearly two centuries, from 1732 to 1918. In the latter period \n                    the Russian imperial throne was eventually occupied by various emperors, often from different lines dynasty. In Russian \n                    imperial tradition called for текущий (reads текущий 1*) within a sequence of descendants of a dynasty, ie an element, \n                    his son, his grandson, and so on. The determination of these текущий is key when you want to determine the successor of the current emperor, as the next emperor is the living element of a текущий that is closest to the current emperor.\n                    \n                    Of course, a tree can be divided into текущий in several different ways. The interesting thing is to find a partition that minimizes the number of текущий necessary to cover all elements of the dynasty.\n                    \n                    Your task in this problem is to determine, given the family tree imperial Russia, the fewest текущий that partition the entire imperial family, that is, all the emperors must belong to exactly one текущий and these have to be the smallest possible number .","id":"1208","category":"Graph","statistics":{"level":"7 / 10","submissions":264,"solved":137,"ratio":"51.89%"}}