{"output":"For each test case print two lines. At first, print the minimum cost for the given period. \n\tIn the second, an increasing sequence of integers, separated by spaces, indicating\n\tthe years in which the machines are exchanged. If the machine is never exchanged, then print only a 0. \n\tIf there is more than one possible sequence, choose one in which machines are exchanged\n\tas soon as possible and whenever possible (eg, between the sequences \"1 4 7\" and \"1 2 8 10 14\" second choice).","input":"The input contains many test cases and ends with EOF. The first line of each test case contains 4 \n\tintegers, N (1 ≤ N ≤ 2000), I (1 ≤ l ≤ M), \n\tM (1 ≤ M ≤ 2000) and P (1 ≤ P ≤ 1000) representing, respectively, \n\tthe period of production, the initial distiller age, the maximun destiler age and the price of a new distiller.\n\t\n\tThe second line of each test case contains M integers, separated by spaces, corresponding to \n\tthe maintenance cost Ci (1 ≤ Ci ≤ 1000), for i = 0,1,2, ... M - 1. \n\tThe next and last line contains M integers, separated by spaces, corresponding to the sell \n\tvalue Vi  (1 ≤ Vi ≤ P), for i = \n\t1,2, ..., M.","level":6,"name":"Optimal Production of Great Vodka","has_images":false,"description":"The production of vodka from the city of St. Petersburg is famous around the world. The legend is that the vodka produced is distributed directly into the home of some of the most senior officers of the company through the water supply system. That is, just open the tap and pours ice cold vodka (after all the pipes are running at a negative temperature most of the year) of the barrel. This causes many security problems, after all people dig the streets looking for the alleged pipes vodka leaving the \n\tcompany.\n\n\tThis is not the only problem faced in the production of vodka in town. To ensure the quality standards required of the drink, it is produced in only one still having a life well-defined M years. Maintaining varies depending on the age of the equipment. The maintenance cost is Ci, where i is the age of the distiller, and must be paid every year, even for new distillers. These stills have a price when purchased new P (age 0) and distillers used in Russian factories are played by distilleries worldwide, where they are still used for many years, and museums. \n\tThe selling price of a distiller with age i is Vi.\n\n\tNote that a distiller with agie M can't longer be used and must be sold. \n\tYour task in this problem is deciding which moments in the company will replace the distiller to minimize \n\tthe cost of production at the end of N years (from year 1). Consider that the exchange of \n\tstills can be done only at the \n\tbeginning of the year.\n\n\n                Input\n\n                \n                    \n\tThe input contains many test cases and ends with EOF. The first line of each test case contains 4 \n\tintegers, N (1 ≤ N ≤ 2000), I (1 ≤ l ≤ M), \n\tM (1 ≤ M ≤ 2000) and P (1 ≤ P ≤ 1000) representing, respectively, \n\tthe period of production, the initial distiller age, the maximun destiler age and the price of a new distiller.\n\t\n\tThe second line of each test case contains M integers, separated by spaces, corresponding to \n\tthe maintenance cost Ci (1 ≤ Ci ≤ 1000), for i = 0,1,2, ... M - 1. \n\tThe next and last line contains M integers, separated by spaces, corresponding to the sell \n\tvalue Vi  (1 ≤ Vi ≤ P), for i = \n\t1,2, ..., M.\n\n                \n\n                Output\n\n                \n                    \n\tFor each test case print two lines. At first, print the minimum cost for the given period. \n\tIn the second, an increasing sequence of integers, separated by spaces, indicating\n\tthe years in which the machines are exchanged. If the machine is never exchanged, then print only a 0. \n\tIf there is more than one possible sequence, choose one in which machines are exchanged\n\tas soon as possible and whenever possible (eg, between the sequences \"1 4 7\" and \"1 2 8 10 14\" second choice).\n\t                \n\n                \n\n                \n                    \n                        \n                            Input Sample\n                            Output Sample\n                        \n                    \n                    \n                        \n                            \n                                \n\t4 2 6 100\n\t30 50 65 80 100 120\n\t60 50 40 30 20 10\n\t5 5 6 200\n\t1 100 100 100 100 200\n\t50 100 100 100 100 100\n\n                            \n                            \n                                \n\t260\n\t1 3\n\t501\n\t1\n\n                            \n                        \n                    \n                \n                \n\t\tXVI Maratona de Programação IME-USP, 2012. Thanks to Carlos E. Ferreira.","id":"1210","category":"Paradigms","statistics":{"level":"6 / 10","submissions":946,"solved":416,"ratio":"43.97%"}}