{"output":"Translate each input text into HTML as demonstrated by the examples above (and below). To render a span of text in italics in HTML, you must start with the <i> tag and end with the <\/i> tag. For boldface text, start with <b> and end with <\/b>. Print one translated text per line at standard output.","input":"The input contains several test cases. Each test case is composed by one line \n                    that contais a string text, containing zero or more usages of the italic \n                    and boldface shortcuts. Each text is between 1 and 50 characters long, inclusive. \n                    The only characters allowed in text are the alphabetic characters 'a' to 'z' and 'A' to 'Z', the underscore '_', the asterisk '*', the space character, and the punctuation \n                    symbols ',', ';', '.', '!', '?', '-', '(', and ')'. The underscore \n                    '_' occurs in text an even number of times. The asterisk '*' occurs \n                    in text an even number of times. No substring of text enclosed \n                    by a balanced pair of underscores or by a balanced pair of asterisks may contain \n                    any further underscores or asterisks. \n                     The end of input is determined by EOF.","level":3,"name":"Bloggo Shortcuts","has_images":false,"description":"You are helping to develop a weblog-management system called bloggo. Although bloggo pushes all content to the front end of a website in HTML, not all content authors enjoy using HTML tags in their text. To make their lives easier, bloggo offers a simple syntax called shortcuts to achieve some HTML textual effects. Your job is to take a document written with shortcuts and translate it into proper HTML.\n                \n                \n                    One shortcut is used to make italicized text. HTML does this with the <i> and <\/i> tags, but in bloggo, an author can simply enclose a piece of text using two instances of the underscore character, '_'. Thus, where a content author writes\n                  You _should_ see the baby elephant at the zoo!\n                \n                \n                    bloggo will publish the following instead.\n                  You <i>should<\/i> see the baby elephant at the zoo!\n                \n                \n                    Another shortcut serves to render text in boldface, which HTML accomplishes with <b> and <\/b> tags. Bloggo lets content authors do the same with paired instances of the asterisk character, '*'. When a content author writes the text\n                  Move it from *Receiving* to *Accounts Payable*.\n                \n                \n                    it will end up on the website as\n                  Move it from <b>Receiving<\/b> to <b>Accounts Payable<\/b>.","id":"1239","category":"Strings","statistics":{"level":"3 / 10","submissions":6063,"solved":3135,"ratio":"51.71%"}}