{"output":"Compute the average length of words in the statement of the problem, and show the classification of the problem,\n                    for more details see the example below.","input":"The entry contains several test cases. Each test case is composed of a line containing the\n                    statement of a problem, is a string containing between 1 and 50 characters ('A'-'Z','a'-'z','0'-'9', ' ', '.')\n                    inclusive.\n                    The end of input is determined by EOF.","level":6,"name":"How Easy","has_images":false,"description":"TopCoder decided to automate the process of assigning levels of difficulty to the problems.\n                    TopCoder developers concluded that the difficulty of the problem is related only to\n                    average length of the words in the problem statement.\n                    If the average length of the words of the statement is less than or equal to 3, the problem difficulty receives 250 points.\n                    If the average length of the words of the statement is 4 or 5, the problem difficulty receives 500 points.\n                    If the average length of utterance of words is greater than or equal to 6, the problem difficulty receives 1000 points.\n                \n                \n                    Definitions:\n                    Symbol: A set of characters linked by spaces from both sides, or at the beginning of the\n                    description of the problem, or even the end of the description of the problem.\n                    Word: a symbol that contains only letters a-z or A-Z, and can be finished with a single point.\n                    Word length: number of letters in a word (a point is not a letter).\n                \n                    Examples of symbols are words (quotes just to exemplify): \"AB\", \"ab\".\n                    Example of symbols that are not words: \"ab..\", \"a.b\", \".ab\", \"a.b.\", \"a2b.\", \".\".\n                \n                    The average length of the words is given by the sum of the sizes of the utterance of words divided by the\n                    number of words, the division is made by integers. If the word count is zero, then the average length of the words is zero.\n                \n                \n                    Your task is given the problem statement, compute its classification of difficulty of the problem, which can be 250, 500, or 1000.","id":"1243","category":"Strings","statistics":{"level":"6 / 10","submissions":5749,"solved":1247,"ratio":"21.69%"}}