{"output":"Convert the text of the document is given in the input, using to specifications given above and print \n                    in a single line, the new text document with the new tags, for more information see the example below.","input":"There is many test cases. Each test case consist of three lines. The first line contains the original tag in the text of this document, \n                    which will only contain letters (a-z, A-Z), and its size will be between 1 and 10 characters inclusive. The second line contains the tag \n                    number by which the original tag is to be replaced, which is a number between 1 and 1000 inclusive. The third and last line will be between \n                    1 and 50 characters inclusive, and \tmay contain letters (a-z, A-Z), numbers (0-9), less-than sign (<), greater-than sign (>), signs equals \n                    (=), bars (/), or blanks. All '<' and '>' are only used in tags.","level":4,"name":"Tag Replacement","has_images":false,"description":"You are in command of a document system that uses tags numeric code to render documents for printing. \n                    There are a lot of documents with text based tags, you must analyze and convert to numeric tags for \n                    entry into the system. A tag is initiated by a character '<', which may be followed by letters, \n                    numbers, spaces or bars, and the tag to complete a character '>'. The tags can not be nested into each other.\n                \n                    The following tags are not valid:\n                    \">HI\", \"<a<b>c>\", \"<a b c><\", \"<a<b>\".\n                \n                \n                    The following tags are valid:\n                    \"/=<>HI\", \"/<>H=I<>/\", \"<><><><>\", \"<a=/><b==//bb><c223>\", \"<a b c>\".\n                \n                \n                    For comparisons between the characters should be disregarded case sensitive.","id":"1254","category":"Strings","statistics":{"level":"4 / 10","submissions":2457,"solved":954,"ratio":"38.83%"}}