{"output":"Test cases must be answered in the order that they were presented. For each test case you must print:\n\t• a single line containing ﬁve stars ***** indicating the beginning of the case\n\t• for each employee i, one line with two integers i and s, separated by a blank, meaning that i has a salary of s.","input":"The input contains several test cases. The ﬁrst line of a test case contains two integers T and E indicating respectively the number of tasks and the number of employees (1 ≤ T ≤ 1000 and 1 ≤ E ≤ 1000). Tasks are numbered from 1 to T and employees from 1 to E.\n    \n\tThen it will come a sequence of lines describing the tasks 1 to T in ascending order. Each task is described by two lines. The ﬁrst of these lines contains three integers BS, ND and NE, representing respectively the basic signiﬁcance of the task, the number of tasks that depend directly on it, and the number of employees who perform it (1 ≤ BS ≤ 1000, 0 ≤ ND < T and 1 ≤ NE ≤ E). The second line contains ND + NE integers corresponding ﬁrst to the ND directly dependent tasks and then the NE employees who perform the task. The end of input is indicated by T = E = 0.","level":9,"name":"ICPC Strikes Again","has_images":false,"description":"International Concrete Projects Company (ICPC) is a construction company which specializes in building houses for the high-end market. The company is the most proﬁtable company in the world due to a very effcient land division method which has been used in its housing development projects since last year. Recently there was a chaos at ICPC, because employees refused to work arguing that they did not earn enough. Worried about the loss in proﬁt due to the strike, the company board proposed a new method to calculate the salaries which was luckily accepted by everyone.\n\tThe salary of a worker reﬂects the signiﬁcance of the tasks that he/she has to perform and is inﬂuenced by the way tasks depend on each other.\n    \n\tA task X depends on a task Y if either (i) X depends directly on Y , or (ii) there exists a task T such that X depends directly on T and T depends on Y . Since in ICPC all tasks must be performed, there is no circularity in the task dependence relation. Also, a task may be performed by more than one worker. A basic signiﬁcance is associated with each task reﬂecting its importance (for example, developing the effcient land division method is more important than building the houses themselves). The signiﬁcance of a task T is then deﬁned as the basic signiﬁcance of T plus the signiﬁcance of every task which depends directly on T. \n    Note that if no other tasks depend directly on task T, the basic signiﬁcance and the signiﬁcance of T are the same.\n    \n\tThe salary of a worker is the sum of the signiﬁcances of all the tasks he/she performs which do not depend on any other task performed by him/her. In other words, a value equal to the signiﬁcance of task X will be added to the salary of a worker W that works in task X if there is no other task Y on which X depends, and W works also in Y .\n    \n\tICPC wants you to help them to determine the salary of each of its employees.","id":"1269","category":"Paradigms","statistics":{"level":"9 / 10","submissions":191,"solved":56,"ratio":"29.32%"}}