{"output":"For each test case in the input your program must produce one line, containing the string ‘PRODUCT requires N containers’, where PRODUCT is the final substance and N is the number of containers needed to produce it.","input":"The input consists of several test cases. Each test case starts with a line containing a single integer R, indicating the number of reactions to be considered (1 <= R <= 5000). The following R lines are of the form:\n                \n                    S1 + S2 → S3\n                \n                    Describing a reaction that consumes S1 and S2 and produces S3 as a result. The names of all substances are case-sensitive alphanumeric strings of size at most 5. A test case with R = 0 indicates the end of the input.","level":7,"name":"Chemistry","has_images":false,"description":"International Chemical Products Company (ICPC) is a company known world-wide for its good and affordable products, which include shampoos, cleaning products, bug-killing products, and even some types of vaccines. The ICPC engineers are always researching new ways of reducing their products’ manufacturing costs, without lowering their quality.\n                \n                    One of their engineers, Mr. Poucher, has a new idea to reduce the cost, which aims at reducing the number of containers necessary to hold the substances during the sequence of chemical reactions to obtain a final substance. These final substances are obtained through a sequence of reactions of the form X + Y → Z, where X and Y are either initial substances or intermediate substances that were already generated from previous reactions. These reactions are done inside a reaction container, which once emptied can be cleaned up and used again. The process for generating a final substance can be described via a sequence of two simple operations:\n                \n                    Put an available substance in an empty reaction container C;\n                    Perform the reaction X + Y → Z either by putting X in the reaction container holding Y, or by putting Y in the reaction container containing X. The order does not affect the end result of the reaction.\n                \n                \n                    What Mr. Poucher noticed was that by choosing smartly the sequence of reaction, ICPC could drastically cut out on the number of reaction containers needed in the company. For example, consider the following sequence of chemical reactions used to obtain final substance P:\n                \n                    1) A + B -> T1\n                    2) C + D -> T2\n                    3) E + F -> T3\n                    4) T2 + T3 -> T4\n                    5) T4 + T1 -> P\n                \n                    In this example, A, B, C, D, E, and F are the initial substances (only appear on the left side of reactions), T1, T2, T3 and T4 are the intermediate substances (appear on the left side of at least one reaction, and exactly once on right side of some other reaction) and P is the final substance (only appears on the right side of a single reaction, which will be the last one listed).\n                    If the sequence of reactions is performed as given then three reaction containers are necessary in order to produce the final substance P:\n                \n                    Containers\n                    Operations C1 C2 C3\n                \n                    put A in C1: A - -\n                    add B to C1: T1 - -\n                    put C in C2: T1 C -\n                    add D to C2: T1 T2 -\n                    put E in C3: T1 T2 E\n                    add F to C3: T1 T2 T3\n                    put T2 in C3: T1 - T4\n                    put T4 in C1: P - -\n                \n                    Note, however, that if the reactions are performed in the sequence 2, 3, 4, 1, 5, two reaction containers are sufficient:\n                \n                    Containers\n                    Operations C1 C2\n                \n                    put C in C1: C\n                    add D to C1: T2\n                    put E in C2: T2 E\n                    add F to C2: T2 T3\n                    put T2 in C2: - T4\n                    put A in C1: A T4\n                    add B to C1: T1 T4\n                    put T1 in C2: - P\n                \n                    You have been hired by ICPC, and your task is to create a computer program to determine the minimum number of reaction containers necessary to perform the sequence of reactions needed to obtain the final substance.\n                \n                    You should assume that:\n                \n                    The reaction producing the final substance is the last listed, and the reaction producing an intermediate substance will always precede reactions where that intermediate substance is used.\n                    A sequence of reactions producing the final substance is always possible.\n                    ICPC has an unlimited supply of initial substances.\n                    At the beginning of the production process, each initial substance is in a storage container, used to hold all ICPC stock of this substance. Such containers cannot be used as reaction container to hold intermediate products of reactions.\n                    All the reaction containers are large enough to hold all the resulting substances.\n                    The amount of substance generated by a single reaction is just enough to be used as input to a single other reaction. For instance, if an intermediate product Z is necessary as input for two different reaction, this product must be produced twice.\n                    Every reaction uses exactly two distinct substances and generates also a distinct substance, i.e. all the reaction have the form X + Y ! Z, where X, Y and Z are all distinct.","id":"1326","category":"Data Structures and Libraries","statistics":{"level":"7 / 10","submissions":79,"solved":23,"ratio":"29.11%"}}