{"output":"For each test case output the results of the hash commands in the input. In the i-th line write an integer representing the result of the i-th hash command. Print a line containing a single character '-' (hyphen) after each test case.","input":"Each test case is described using several lines. The first line contains four integers B, P, L and N, where B is the number of possible values of a Jovian byte, P is the modulus of the Jovian hash (2 ≤ B < P ≤ 109 and P prime), L is the length (number of Jovian bytes) of the spacecrafts’ firmware, and N is the number of commands to simulate (1 ≤ L, N ≤ 105). At the beginning of the simulation the value of every byte in the firmware is fi = 0 for 1 ≤ i ≤ L. Each of the next N lines describes a command to simulate. Each command description starts with an uppercase letter that is either ‘E’ or ‘H’, with the following meanings.\n\n                \n                    'E': The line describes an edit command. The letter is followed by two integers I and V indicating that the byte at position I of the firmware (that is, fI ) must receive the value V (1 ≤ I ≤ L and 0 ≤ V ≤ B − 1).\n                    'H': The line describes a hash command. The letter is followed by two integers I and J indicating that H(fI, . . . fJ ) must be computed (1 ≤ I ≤ J ≤ L).\n                \n\n                The last test case is followed by a line containing four zeros.","level":7,"name":"Jupiter Attacks!","has_images":true,"description":"Jupiter is invading! Major cities have been destroyed by Jovian spacecrafts and humanity is fighting back. Nlogonia is spearheading the counter-offensive, by hacking into the spacecrafts’ control system.\n\n                \n                    Unlike Earthling computers, in which usually a byte has 28 possible values, Jovian computers use bytes with B possible values, {0,1,...,B−1}. Nlogonian software engineers have reverse-engineered the firmware for the Jovian spacecrafts, and plan to sabotage it so that the ships eventually selfdestruct.\n\n                \n                    As a security measure, however, the Jovian spacecrafts run a supervisory program that periodically checks the integrity of the firmware, by hashing portions of it and comparing the result against known good values. To hash the portion of the firmware from the byte at position i to the byte at position j, the supervisor uses the hash function\n\n                \n                    ​\n                \n\n                where P is a prime number. For instance, if B = 20 and P = 139, while bytes 2 to 5 of the firmware have the values f2 = 14, f3 = 2, f4 = 2 and f5 = 4 then\n\n                \n                    H(f2, . . . f5) = B0 f5 + B1 f4 + B2 f3 + B3 f2 (mod P)\n                                                         = 200 × 4 + 201 × 2 + 202 × 2 + 203 × 14 (mod 139)\n\t\t\t\t\t               = 4 + 40 + 800 + 112000 (mod 139)\n                    = 112844 (mod 139)      \n                    = 115                            \n\n                \n                    The Nlogonian cryptologists need to find a way to sabotage the firmware without tripping the supervisor. As a first step, you have been assigned to write a program to simulate the interleaving of two types of commands: editing bytes of the firmware by the Nlogonian software engineers, and computing hashes of portions of the firmware by the Jovian supervisory program. At the beginning of the simulation the value of every byte in the firmware is zero.","id":"1356","category":"Data Structures and Libraries","statistics":{"level":"7 / 10","submissions":285,"solved":151,"ratio":"52.98%"}}