{"output":"For each line, print the actual number being counted, when the m-th person claps for the k-th time. If this can never happen, print '-1'.","input":"There will be at most 100 test cases in the input. Each test case contains three integers n, m and k ( 2 ≤ n ≤ 100, 1 ≤ m ≤ n, 1 ≤ k 100) in a single line. The last test case is followed by a line with n = m = k = 0, which should not be processed.","level":4,"name":"Counting Game","has_images":false,"description":"There are n people standing in a line, playing a famous game called \"counting\". When the game begins, the leftmost person says \"1\" loudly, then the second person (people are numbered 1 to n from left to right) says \"2\" loudly. This is followed by the 3rd person saying \"3\" and the 4th person say \"4\", and so on. When the n-th person (i.e. the rightmost person) said \"n\" loudly, the next turn goes to his immediate left person (i.e. the (n - 1)-th person), who should say \"n + 1\" loudly, then the (n - 2)-th person should say \"n + 2\" loudly. After the leftmost person spoke again, the counting goes right again. There is a catch, though (otherwise, the game would be very boring!): if a person should say a number who is a multiple of 7, or its decimal representation contains the digit 7, he should clap instead! The following tables shows us the counting process for n = 4 ('X' represents a clap). When the 3rd person claps for the 4th time, he's actually counting 35.\n\t\t\t\t\n                        \n                            \n                                Person\n                                1\n                                2\n                                3\n                                4\n                                3\n                                2\n                                1\n                                2\n                                3\n                            \n                            \n                                Action\n                                1\n                                2\n                                3\n                                4\n                                5\n                                6\n                                X\n                                8\n                                9\n                            \n                            \n                                Person\n                                4\n                                3\n                                2\n                                1\n                                2\n                                3\n                                4\n                                3\n                                2\n                            \n                            \n                                Action\n                                10\n                                11\n                                12\n                                13\n                                X\n                                15\n                                16\n                                X\n                                18\n                            \n                            \n                                Person\n                                1\n                                2\n                                3\n                                4\n                                3\n                                2\n                                1\n                                2\n                                3\n                            \n                            \n                                Action\n                                19\n                                20\n                                X\n                                22\n                                23\n                                24\n                                25\n                                26\n                                X\n                            \n                            \n                                Person\n                                4\n                                3\n                                2\n                                1\n                                2\n                                3\n                                4\n                                3\n                                2\n                            \n                            \n                                Action\n                                X\n                                29\n                                30\n                                31\n                                32\n                                33\n                                34\n                                X\n                                36\n                            \n                        \n                    \n                Given n, m and k, your task is to find out, when the m-th person claps for the k-th time, what is the actual number being counted.","id":"1400","category":"Mathematics","statistics":{"level":"4 / 10","submissions":1018,"solved":473,"ratio":"46.46%"}}