{"output":"For each test case in the input your program must produce one line of output, containing the identification number of the player who is second best in number of appearances in the rankings. If there is a tie for second best, print the identification number of all second best players in increasing order. Each identification number produced must be followed by a blank space.","input":"The input contains several test cases. Players are identified by integers from 1 to 10000. The first line of a test case contains two integers N and M indicating respectively the number of rankings available (2 ≤ N ≤ 500) and the number of players in each ranking (2 ≤ M ≤ 500). Each of the next N lines contains the description of one weekly ranking. Each description is composed by a sequence of M integers, separated by a blank space, identifying the players who figured in that weekly ranking. You can assume that:\n\n                \n                    in each test case there is exactly one best player and at least one second best player,\n                    each weekly ranking consist of M distinct player identifiers.\n                \n\n                The end of input is indicated by N = M = 0.","level":5,"name":"Grandpa is Famous","has_images":false,"description":"The whole family was excited by the news. Everyone knew grandpa had been an extremely good bridge player for decades, but when it was announced he would be in Guinness Book of World Records as the most successful bridge player ever, whow, that was astonishing!\n\n                The International Bridge Association (IBA) has maintained, for several years, a weekly ranking of the best players in the world. Considering that each appearance in a weekly ranking constitutes a point for the player, grandpa was nominated the best player ever because he got the highest number of points.\n\n                Having many friends who were also competing against him, grandpa is extremely curious to know which player(s) took the second place. He needs a program which, when given a list of weekly rankings, finds out which player(s) got the second place according to the number of points.","id":"1403","category":"Ad-Hoc","statistics":{"level":"5 / 10","submissions":2042,"solved":843,"ratio":"41.28%"}}