{"output":"For each input test case, your program must produce one output line, containing an integer number, the minimum amount of initial necessary mana. In case that is not possible to recover the treasure, you must print -1.","input":"The input contains several test cases. The first line of each test case contains four integers M, N, G and K, indicating respectively the number of spells (1 ≤ M ≤ 1000), of halls (1 ≤ N ≤ 1000), of galleries (0 ≤ G ≤ 1000000) and of monsters (0 ≤ K ≤ 1000).\n\n                Each one of the following M lines describes one spell. The description of a spell contains two integer numbers, the amount of consumed mana (between 1 and 1000) and the number of inflicted damage points (also between 1 and 1000).\n\n                Next, there are G lines, each one describing a gallery. A gallery is described by two integers numbers A and B (A ≠ B), representing the halls that the gallery connects. Zak can use the gallery on both ways, in other words, to go from A to B or from B to A.\n\n                Finally, the last K lines of a test case describe the monsters. The description of a monster contains two integers numbers representing respectively the hall on which he lives (between 1 and N inclusive), and your initial number of life points (between 1 and 1000 inclusive).\n\n                The final input is indicated by M = N = G = K = 0.","level":9,"name":"Zak Galou","has_images":false,"description":"Zak Galou is a famous wizard that kills monsters. The legend says that there is a hidden cave on the jungle confines that contains a millennial treasure. Until today, no adventurer managed to recover the treasure, because it is well guarded by terrible monsters. But Zak Galou is not an ordinary adventurer, and decided to prepare himself to recover the dreamed treasure.\n\n                Zak Galou features a certain amount of mana (a sort of magical energy) and a list of M spells. Each monster has a determined number of life points. Each time that Zak Galou casts a spell against a monster, Zak spends a certain amount of mana (the spell’s cost) and inflicts a certain amount of damage to the monster. The inflicted damage leads to a loss of life points from the monster (the number of life points loss depends on the spell). A monster is dead if he has zero or less life points. Zak always fights against one monster at a time. As a powerful wizard, he can cast the same spell several times, since he has enough amount of mana.\n\n                In his researches, Zak Galou found the treasure map. The cave is represented as a set of halls connected by galleries. The halls are identified sequentially from 1 to N. Zak always starts on the hall 1, and the treasure is always on the hall N. There are K monsters identified sequentially from 1 to K. Each monster lives inside a hall, from which he doesn’t leave (notice that is possible that more than one monster live on the same hall). During the search for the treasure, Zak Galou can only come out or recover a treasure from a hall if the hall is empty (with no monster). In other words, Zak must always, before leaves or recover the treasure from a hall, kill the monster(s) that lives in there.\n\n                Given the description of the spells, the monster and the cave, your task is to determine the minimum amount of initial mana necessary so Zak Galou can recover the treasure.","id":"1409","category":"Graph","statistics":{"level":"9 / 10","submissions":858,"solved":255,"ratio":"29.72%"}}