{"output":"For each test case, output a single line containing 'Let me try!' If it's possible to get to Rock m, otherwise, output a single line containing 'Don't make fun of me!'","input":"The input will contain no more than 2000 test cases. Each test case contains a single line. It contains two positive integers N (2 ≤ N ≤ 106), and M (1 ≤ M ≤ N), M indicates the number of the rock on which the gift is located. A test case in which N = 0, M = 0 will terminate the input and should not be regarded as a test case.","level":6,"name":"Gift?!","has_images":false,"description":"There is a beautiful river in a small village. N rocks are arranged in a straight line numbered 1 to N from left bank to the right bank, as shown below.\n\n                [Left Bank] - [Rock1] - [Rock2] - [Rock3] - [Rock4] ... [Rock n] - [Right Bank]\n\n                The distance between two adjacent rocks is exactly 1 meter, while the distance between the left bank and rock 1 and the distance between Rock n and the right bank are also 1 meter.\n\n                \n                    Frog Frank was about to cross the river, his neighbor Frog Funny came to him and said:\n                    'Hello, Frank. Happy Children's Day! I have a gift for you. See it? A little parcel on Rock 5.'\n                    'Oh, that's great! Thank you! I'll get it.'\n                    'Wait...This present is for smart frogs only. You can't get it by jumping to it directly.'\n                    'Oh? Then what should I do?'\n                    'Jump more times. Your first jump must be from the left bank to Rock 1, then, jump as many times as you like - no matter forward or backward, but your ith jump must cover 2 × i - 1 meters. What's more, once you return to the left bank or reach the right bank, the game ends, and no more jumps are allowed.'\n                    'Hmmm, not easy... let me have a think!' Answered Frog Frank, 'Should I give it a try?'","id":"1425","category":"Data Structures and Libraries","statistics":{"level":"6 / 10","submissions":2491,"solved":493,"ratio":"19.79%"}}