{"output":"For each instance print a line containing the K-factor of N.\n\n                It is guaranteed that no instance in the input has a result greater than 1018.","input":"The input is composed of several instances. The first line of input contains an integer T indicating the number of instances.\n\n                The first (and only) row of each instance contains an integer N followed by K points exclamation, where 1 ≤ N ≤ 100 and 1 ≤ K ≤ 20.","level":3,"name":"Oracle of Alexandria","has_images":false,"description":"Every Computer Scientist worth his salt knows the book \"The Hitchhiker's Guide to the Galaxy\" and knows the answer to the fundamental question about life, the universe and everything. But what few know is that the story of Douglas Adams is based on an Egyptian legend, of an oracle located in Eskendereyya (Alexandria). Alexandria today is the largest city of Egypt, with more than 4 million inhabitants. It is in the Nile Delta, and stretches for 32km along the Mediterranean coast. In the past, the city founded in 331 BC by Alexander the Great, was one of the main cities in the world and there was the Lighthouse of Alexandria (one of the 7 Wonders of the Ancient World), the Library of Alexandria (the largest in the ancient world) and other fantastic works. The legend also says that there was the great oracle of Alexandria. The townspeople delivered the oracle small tickets with numbers noted, and received back a number, that would be the answer to a fundamental question of the universe related to the two given numbers.\n\n                In his treatise of 227 AD Cleomenes of Naucratis (who became administrator of Alexandria when Alexander departed for his conquests) reports some results of the oracle:\n\n                \n                    Given 8 and 1 the oracle returned 40320;\n                    Given 10 and 3, returned 280;\n                    Given 4 and 2, returned 8;\n                    Given 21 and 19, returned 42.\n                \n\n                Modern studies realized that what the oracle returned was nothing more than a generalization of the factorial of an integer. As we know,\n\n                N! = N x (N-1) x ... x 1.\n\n                What the oracle returned for the data N and K, was the K-factor of N, in other words,\n\n                N x (N-K) x (N-2K) x (N-3K) x ...,\n\n                in which the product was made while the difference is greater than or equal to 1. We can represent the K-factor of a number for him followed by K exclamations:\n\n                \n                    8! = 40320;\n                    10!!! = 280;\n                    4!! = 8;\n                    21!!!!!!!!!!!!!!!!!!! = 42\n                \n\n                They say that when reading about the legend of oracle Eskendereyya, Douglas Adams got his inspiration for his work. Also, in Egypt is the inspiration of the restaurant at the end of the universe, but that's another story ...\n\n                Given the integers N and K your task is  determine K-factor of N.","id":"1457","category":"Mathematics","statistics":{"level":"3 / 10","submissions":4161,"solved":2034,"ratio":"48.88%"}}