{"output":"For each value of the input, your program should print an identifier Instancia h, where h is an integer, and increasing sequentially from 1. On the next line, separated by a blank space, the five numbers that prove the quadripartite condition when n is quadripartite. Follow the order: m p1 p2 p3 p4.\n\n                If n is not quadripartite, your program should print the message n nao e quadripartido. In the first case, it is possible that there is more than one sequence that meets the conditions. If this occurs, your program should choose the one with the highest possible value for m.\n\n                A blank line should separate the output of each instance.","input":"Each line of the input contains an integer n (0 ≤ n ≤ 500000) that your program should analyze and classify as quadripartite or not. The value n = 0 corresponds to the end of the input file and should not be processed.","level":8,"name":"Magic Numbers?","has_images":false,"description":"\"Os números sempre desempenharam um papel de acentuado relevo não só nos altos campos da Fé e da Verdade, como no humílimos terreiros da Superstição e do Erro.\" (Prof. Marão)\n\n                Malba Tahan, in his classic \"The Man Who Counted\", tells a tale of superstition involving the quadripartite numbers. Little did he know that centuries before the ancient Czech civilization superstition surrounding the quadripartite numbers was already present. In the antiquity, an important community living around Neratovice, used the properties of the quadripartite numbers to predict the future, baptize children and even to choose their leaders.\n\n                An integer n is quadripartite if there is some division of that number in four parcels integer (p1 + p2 + p3 + p4 = n) and an magical operator (m) so that the first portion added to the magical operator, the second reduced by it, the third multiplied by it and the fourth divided by it gives the same result (p1 + m = p2 − m = p3 * m = p4 / m).\n\n                Thus, 128 is quadripartite because we can divide 128 into four parts (31, 33, 32 and 32) so that exists a magical operator (in this case, 1) that makes p1 + m, p2 − m, p3 * m e p4 / m equal. In fact: 31 + 1 = 33 - 1 = 32 * 1 = 32 / 1 = 32.\n\n                A group of researchers from Prague is reconstructing the past of Neratovice, and asked for your help. They want you to make a program that identifies when a number is quadripartite or not and what is the magic operator associated do it.","id":"1488","category":"Mathematics","statistics":{"level":"8 / 10","submissions":335,"solved":150,"ratio":"44.78%"}}