{"output":"For each test case print one line, containing one integer, representing the maximum amount that is possible to achieve in the game if the patterns are choosen in an optimal way.","input":"There are several test cases. Each test case starts with two integers, N and M (1 ≤ N, M ≤ 100), indicating the number of lines and columns of the board, respectively.\n\nFollowing there will be N lines, containing M integers each, representing the values from the board. Be v the value of any cell of the board, 1 ≤ v ≤ 100.\n\nFollowing there will have an integer K (1 ≤ K ≤ 100), indicating the number of patterns. After that, there will be K lines, each containing M characters, representing each of the patterns, as the symbology given above.\n\nThe last test case is indicated when N = M = 0, which should not be processed.","level":8,"name":"Board With Prizes","has_images":true,"description":"You are at a television program, and there is a huge chance for you to win a lot of money. You are there to play a game, with some peculiar rules, and the resulting amount of money depends on your smartness, where you may even lose money if you play badly.\n\nThe game works as follows: there is a board, with N lines and M columns, and in each cell of this board there is a positive integer, representing an amount of money. At each cell you can choose one of the following signs to put there:\n\n\n\t'+' - Means that the value of that cell must be added to your prize.\n\t'-' - Means that the value of that cell must be subtracted from your prize.\n\t'.' - Means that such cell must be ignored.\n\n\nLife would be too easy if you could choose to put the '+' sign at all positions, so there are two additional rules to the game: for each row of the board, you must fill the cells with one of a few patterns of signs made by the game producers; and for each column of the board, it's not allowed for two vertical adjacent cells to have the same sign (applies to the signs '+' and '-'). It is possible to use the same pattern more than once, since it doesn't disrespect the second rule above.\n\nSee an example in the picture below, where the patterns are: “++”, “--”, “.+” e “+.”.\n\n\n\nConsider that there is always at least one way to fill the board.\n\nAs the game is new, they let you use your computer to help you make the decision, without knowing that you were a programmer. Write an algorithm that tells you what is the maximum amount that is possible to achieve in the game.","id":"1543","category":"Paradigms","statistics":{"level":"8 / 10","submissions":557,"solved":192,"ratio":"34.47%"}}