{"output":"For each query you should print two lines. The first line contains the value of P(i, j) with five digits after the decimal and the second line contains a round number which is the number of recursive calls needed if the function mentioned above was used to determine the value of P(i, j). If the value of P(i, j) is undefined you should print -1 as its value with similar formatting. A blank line should be printed between the outputs of two consecutive sets.","input":"The input file contains several sets of input. The first line of a set contains one floating-point number P(0 < P < 1), and an integer N(0 ≤ N < 1001) where P is the winning probability of Abahoni and N is the number queries to follow. Each of the next N lines contains two integers i(0 ≤ i ≤ 1000) and j(0 ≤ j ≤ 1000). Input is terminated by a set, which has zero as the value of N. This set should not be processed.","level":10,"name":"The Unreal Tournament","has_images":false,"description":"In this particular problem, The Unreal Tournament is a tournament, which consists of only two teams. Let these two teams be Abahoni and Mohamedan. They play in between them not more than 2N - 1 games, the winner being the first team to achieve n victories. You can assume that there are no tied games, the result of each game is independent and for any match there is a constant probability P that team Abahoni will win and hence there is a constant probability Q(Q = 1 - P) that team Mohamedan will win.\n\nP(i, j) is the probability that team Abahoni will win the series given that they still need i more victories to achieve this, whereas team Mohamedan still need j more victories if they are to win. The P(i, j) can be computed with a function like the following:\n\nFunction P(i, j){\n   if i = 0 then return 1\n   else if j = 0 then return 0\n   else return pP(i-1,j) + qP(i,j-1)\n}\n\nYou will have to write a program that gives the probability of winning for any P, i and j and also gives the number of recursive calls required if the function above is used to get the probability P(i,,j).","id":"1572","category":"Mathematics","statistics":{"level":"10 / 10","submissions":301,"solved":41,"ratio":"13.62%"}}