{"output":"Print a line revealing the final scoreboard of the game according to the given events and to the described rules. The sample clarify the format in which the scoreboard must be printed.","input":"The input consists of several test cases. The first line of each test case consists of two integers N and E (1 < N < 2,551,805, 1 < E < 104), which terminate the input when are both null. N is a even number which states for the numbers of  fortalezenses who joined the game. E is the number of events that happened during the game. The teams are called A and B, and the players are called A1, A2, A3… and B1, B2, B3… All positions are determined by the distance in milimetres from the goal line of team A, i.e. the goal line of team A is in position 0 and the goal line of team B is in position 2,000,000. The second line of a test case contain N / 2 integers xiA (0 ≤ xiA ≤ 2,000,000, 1 ≤ i ≤ N / 2), indicating each xiA the position of player Ai at the beginning of the match. Similarly, third line contains N / 2 integers xiB (0 ≤ xiB ≤ 2,000,000, 1 ≤ i ≤ N / 2), indicating each xiB the initial position of player Bi. Follow then E lines, each describing an event of the game. The table below list all possible events and how each is described in the input.\n\n                    \n                        \n                            I Xi the referee gives the ball to the player Xi (X ∈ {A, B}, 1 ≤ i ≤ N / 2 ) to initiate a play;\n                        \n                        \n                            M Xi x\n                            player Xi (X ∈ {A, B}, 1 ≤ i ≤ N / 2) moves to position X (0 ≤ X ≤ 2000000);\n                        \n                        \n                            P Xi\n                            the ball passes to the hands of player Xi (X ∈ {A, B}, 1 ≤ i ≤ N / 2);\n                        \n                        \n                            G X\n                            the ball enters the goal of team X (X ∈ {A, B});\n                        \n                        \n                            S\n                            the ball leaves the pool.\n                        \n\n\n                    \n\n                    Assume that an event I occurs if and only if is the first event of the match or the preceding event is and event G or S.","level":10,"name":"BIT Park","has_images":true,"description":"The 2014 ACM ICPC South America Contest in Brazil will take place in Fortaleza, and the brave contestants from Chapecó, excited, have already started packing their bags, hoping that they will pass in the Subregional Contest. The state capital of Ceará, with a population of 2,551,805 inhabitants (according to the 2013 IBGE Census), is worldwide known for its beautiful beaches, its luxury hotels, inns and restaurants, its magnificent Architecture masterpieces, its cheerful and hospitable people, as also for its extraordinary water parks. Longing to defeat the hegemony of the biggest water park in town, a local IT company, named NCC (Núcleo de Computação Cearense), has built a water park even bigger, named BIT Park, which is going to be opened this year. For the opening the entire population of the city was invited, and NCC promises many activities in order to entertain the people the whole afternoon.\n\n                    One of the scheduled activities for the opening is going to be placed at the biggest pool in BIT Park: a huge game of waterfootball, in which all inhabitants of Fortaleza will be able to participate, since the referred pool has width and length of nothing more, nothing less than 1 km and 2 km, respectively. Waterfootball works roughly as usual football (a.k.a. soccer), but with some differences:\n\n                    \n                    \tthe game takes place inside the water, so, the ball is passed with the hands, rather than with feet;\n                    \tthe game can be played by any even number of players, as long as there is the same number of players in both teams — and as long as all players fit in the pool;\n                    \tthere is no goalkeeper, since every player can defend the ball with the hands;\n                    \tas in usual football, the validity of a player's position is judged according to the line parallel to the adversary goal line where the player is, considering also the lines where the adversary player are: the position of a player J — and thereafter the player oneself — is considered offside if less than 2/11 of the adversary players are in lines closer to the adversary goal line than the line where J is;\n                    \tonly a player in onside position is allowed to catch the ball, in opposite of what happens in usual football, in which inside/offside positioning is judged in passing time, not in reception time.\n                    \n\n                    In Figure, with team A playing against team B, players A4 and A5 are offside.\n\n                    \n\n\n                    NCC realised that judging the validity of players' positions during the game would be hard-boiled; after all, the whole population of Fortaleza could be in the pool. The decision then was to leave the game go on, so a program would later rejudge all events and recalculate the final scoreboard. Once an offside player receives the ball, next goal in match must be disregarded, unless the ball leaves the pool. At the beginning of the game, and every time the balls leaves the pool or some goal comes to pass, the referee draws a player — not necessarily offside — and gives the ball to him or her so the game can continue.","id":"1587","category":"Data Structures and Libraries","statistics":{"level":"10 / 10","submissions":552,"solved":124,"ratio":"22.46%"}}