{"output":"Output the sorted scoreboard team names, one per line. It is not necessary to print anything between the test cases!","input":"In the first line, there is an integer T (T ≤ 100), that indicates the number of test cases.\n                    In the first line of each test case we have two numbers, N (2 ≤ N ≤ 20* or 2 ≤ N ≤ 100**) and M (1 ≤ M ≤ 100* or 1 ≤ M ≤ 1000**), indicating how many teams are in the championship and how many matches were already played. The next N lines contain the team names. They are all unique and contain only lowercase letters of the English alphabet. The following M lines contain the match information with the following format: X teamA Y teamB, indicating that the teamA played against the teamB and the first scored X goals and the second Y goals.The strings have size between 1 and 20 and the number of goals of a team during a match will be between 0 and 100. A team never plays with itself, but it can play any number of times with another team.\n\n                    *for around 90% of the test cases;\n                        **for the other cases.","level":5,"name":"Help the Federation","has_images":false,"description":"The football federation hired you to organize the scoreboard of the tournament. You will receive a list with some past matches and you must sort the teams accordingly. A win grants 3 points, a draw 1 point and if the team lost it receives nothing.\n                    Read carefully the regulation on how the scoreboard should be organized: First comes the team with more points. Then if there is a draw, the team with more wins should come first. If there is still a draw, the team with more goals should come first. At last, if none of the above sorting criterias is fulfilled, the team that comes first in the input should appear first.\n                    Given the teams and the games, sort them and output the scoreboard.","id":"1588","category":"Ad-Hoc","statistics":{"level":"5 / 10","submissions":2081,"solved":745,"ratio":"35.80%"}}