{"output":"For each instance print one line with the players ordered according to the classification of Yusuf II. If there is more than one possible classification, anyone of them will be accepted. If there are no classifications according to Yusuf II's scheme, print \"inclassificavel\" without quotes.","input":"The input is composed by several instances and ends with end of file (EOF).\n\n                    The first line of each instance contains an integer N (2 ≤ N ≤ 1.000) corresponding to the number of players of the tournament. The players are numbered from 1 to N. For each i = 1, . . . , N , the (i + 1)-th line contains an integer di ≥ 0 followed by the identification of the di players beaten by player i.","level":10,"name":"Yusuf II's Tournament","has_images":false,"description":"Marrakech is one of the citadels of the Arab world. The city was fortified between 1122-1123 by Ali ibn Yusuf, son of one of the first leaders of the city. One of the great city leaders was Califa Abu Yaqub Yusuf 'al-Munstansit' also known as Yusuf II. The Califa lived only until his 21 (1203-1224) and reigned since he was 10. Known as a lover of the arts and sports, he was a great supporter of the construction of palaces and museums. He idealized a great chess competition, one of his passions, disputed all over the kingdom.\n\n                    The scheme imagined by Yusuf II to determinate the classification of the chess championship was very interesting. All the N competitor played against each other. A player K is called ملك (malik) if for every player J differ from K, or K beats J or K beats any player J' whom beats J. The classification of the championship is an ordination of the players J1 , J2 , . . . , JN  that each player Ji , 1 ≤ i < N , wins Ji+1 and it is ملك if we consider the players who appear after him in the ordination, this mean, ignoring the previous ones.\n\n                    Your task will be, given the results of the matches from a chess tournament in Marrakech, determinate if it is possible to obtain a classification of Yusuf II for that championship.","id":"1596","category":"Paradigms","statistics":{"level":"10 / 10","submissions":67,"solved":1,"ratio":"1.49%"}}