{"output":"For each instance print a single line. If you can push the block to its final position this line should consist of two integers, which are the minimum number of doors that must be open to perform this action and the minimum number of moves that are necessary with this number of open boxes. Print '-1' if you can not push the block to its final position.","input":"The input consists of several instances and ends with the end of file (EOF).\n\n                    Each instance starts with a line containing two integers separated by a space, M and N (1 ≤ N, M ≤ 25).\n\n                    The following are N rows, each character belonging to the set M {*, j, b, x #.}, where:\n\n                    \n                        '*' represents a wall;\n                        '.'represents an empty position;\n                        'j' represents the initial position of the cat (Each instance contains exactly one character 'j');\n                        'b' represents the initial position of the block (Each instance contains exactly one character 'b');\n                        'x' represents the final desired position for the block (Each instance contains exactly one character 'x');\n                        '#' represents a door (Each instance contains at most 5 characters '#');","level":9,"name":"The Cat of The Caretaker of The Warehouse","has_images":false,"description":"Sokoban is a well-known game. What few people know is that the game was invented by Berbers, Arab peoples who inhabited the north of Africa, where today is Morocco. For these people the cats are considered an animal that brings bad omen, mainly because of his selfish behavior (as evidenced by the saying highlighted above).\n\n                    In this original version of sokoban the character is a cat that is pushing blocks of earth around it. There is a board consisting of N rows and M columns. You control the cat that can move in any of the four adjacent squares, since this is free, or it may push a block in any of these four directions.\n\n                    As the best-known version, your goal is to push the block to a final specified position. Note that you can only push the block and never pull it.\n\n                    The Berber version of the game has a particularity. There are some houses that are special doors. Where the cat door occupies a position with the first time the door is opened. The block can not be pushed to the position of a door if it is closed. After the open door behaves like a free position.\n\n                    You want to push the block to the final position opening the fewest possible doors.\n\n                    Consider every position off the board as a wall.","id":"1600","category":"Paradigms","statistics":{"level":"9 / 10","submissions":170,"solved":70,"ratio":"41.18%"}}