{"output":"For each instance print -1 if it is not possible to tranform the closed canal in the opened canal, or the lowest index of the vertex of the closed canal which coincides with the first vertex of the opened canal after the transformation.","input":"The input consists of several instances and ends with the end of file (EOF). \n\n                    The first line of each intance contains two integers Nf (3 ≤ Nf ≤ 20,000) and Na (2 ≤ Na ≤ 5.000), corresponding to the number of vertices of the closed and opened canals. The next line contains Nf pairs of integers (xi, yi) (-10000 ≤ x, y ≤ 10,000), each pair representing the coordinate of a vertex of the closed canal. In the closed canal water always flows in a counterclockwise direction and the vertices are numbered from 1 to Nf. The third and last line contains Na pairs of integers (xi, yi) corresponding to the vertices of the opened canal.","level":10,"name":"Qanat Canals","has_images":true,"description":"The medina of Marrakech is formed by the fortified city, considered an universal heritage of UNESCO since 1995 The beginning of its construction dates back to the founding of the city in the eleventh century and includes many impressive monuments such as the Koutoubia mosque, madrassa Ben Youssef, and the Palace Bahia. Several stories surround the monuments that make up the medina. The most interesting concerns the Menara gardens. The park has gardens and artificial lakes built in the time of Sultan. Abd-el-Rhaman, who was passionate about math challenges. One of the brightest are the sets of qanat (قناة) canals. Each set consists of a closed canal and an opened canal. The closed canal has the shape of a polygon and the opened canal consists of a sequence of edges forming a path. The challenge is whether it is possible to transform the closed canal in the opened canal through mental operations on the closed canal, such as removal of vertices and edges, translations and rotations (in the plane). \n\n                    The canals are given by the coordinates of its vertices and the order in which the vertices are given indicate the direction of water flow. We believe it is possible to transform the closed canal in the opened canal after several operations if the resulting canal has the same coordinates and the water flows in the same direction.\n\n                    \n\n                    Figure 1. Illustration of the first (left) and second (right) input sample.","id":"1603","category":"Paradigms","statistics":{"level":"10 / 10","submissions":44,"solved":10,"ratio":"22.73%"}}