{"output":"For each test case, output a line containing a single integer representing the maximum number of moves the player can do in order to check the king using a single piece and get rid of the shot of tequila. If the number is not finite, output “INF” (without quotation marks).","input":"The input consists of several test cases, each of them consisting of 3 lines. The first line contains a single positive integer N, which represents the number of white pieces the dealer has placed at the board. The second line describes the N white pieces, following Chess Algebraic¹ Notation. The third line, at last, indicates the position of the black king. The input is ended when N = 0.","level":10,"name":"ChessGuess","has_images":true,"description":"A new game is becoming the biggest sensation in Nlogony. Named ChessGuess, this chess-like game is defined by the following rules, which make up ChessGuess Manifest:\n\n                    \n                    \tChessGuess can be played by any number of players greater than 1, one of them chosen by the group to be the dealer.\n                    \tIn each round, the dealer prepares a chessboard with any positive number of white pieces and a single black king, provided that no white king is placed at the board. The number of pieces of each kind is not limited as in traditional chess, i.e. there is no problem in placing, for example, 63 white pawns and 1 black king.\n                    \tAfter setting up the chessboard to a round, the dealer picks one of the other players up, so that each player, except for the dealer himself, is chosen exactly once.\n                    \tThe player must then choose a single white piece and move it as many times as necessary to check the black king. The piece movements are the same as in traditional chess, with the only exception that it is not allowed a pawn to move two squares in its first move.\n                    \tIf the player can guess an optimal choice, which checks the king in a minimal number of moves using a single piece, the dealer must drink a whole shot of tequila at once. Otherwise, who drinks up the tequila is the player. In the example shown in the Figure, 1 is the maximum number of moves the player might do in order to check the king using a single piece and get rid of the tequila.\n                    \n\n                    \n\n                    A problem, however, is risking the success of the new game. As the play evolves, people get really drunk, particularly the dealer, who cannot decide any longer whether the choice made by the player is optimal or not. Therefore, the Federation and Association of ChessGuess for the Environment (FACE) needs a program that, given the starting board set up by the dealer, outputs the maximum number of moves the player can do in order to get the dealer even drunker.","id":"1628","category":"Graph","statistics":{"level":"10 / 10","submissions":104,"solved":18,"ratio":"17.31%"}}