{"output":"For each given expression, print the expression with the equivalent result when using the algorithm with the queue instead of the stack. To make the solution unique, you are not allowed to assume that the operators are associative or commutative.","input":"The first line of the input contains a number T (T ≤ 200). The following T lines each contain one expression in postfix notation. Arithmetic operators are represented by uppercase letters, numbers are represented by lowercase letters. You may assume that the length of each expression is less than 10000 characters.","level":3,"name":"Expressions","has_images":false,"description":"Arithmetic expressions are usually written with the operators in between the two operands (which is called infix notation). For example, (x + y) * (z - w) is an arithmetic expression in infix notation. However, it is easier to write a program to evaluate an expression if the expression is written in postfix notation (also known as reverse polish notation). In postfix notation, an operator is written behind its two operands, which may be expressions themselves. For example, x y + z w - * is a postfix notation of the arithmetic expression given above. Note that in this case parentheses are not required.\n                    To evaluate an expression written in postfix notation, an algorithm operating on a stack can be used. A stack is a data structure which supports two operations:\n                    1. push: a number is inserted at the top of the stack.\n                    2. pop: the number from the top of the stack is taken out.\n                    During the evaluation, we process the expression from left to right. If we encounter a number, we push it onto the stack. If we encounter an operator, we pop the first two numbers from the stack, apply the operator on them, and push the result back onto the stack. More specifically, the following pseudocode shows how to handle the case when we encounter an operator O:\n                    a := pop();\n                    b := pop();\n                    push(b O a);\n                    The result of the expression will be left as the only number on the stack.\n                    Now imagine that we use a queue instead of the stack. A queue also has a push and pop operation, but their meaning is different:\n                    1. push: a number is inserted at the end of the queue.\n                    2. pop: the number from the front of the queue is taken out of the queue.\n                    Can you rewrite the given expression such that the result of the algorithm using the queue is the same as the result of the original expression evaluated using the algorithm with the stack?","id":"1653","category":"Graph","statistics":{"level":"3 / 10","submissions":69,"solved":47,"ratio":"68.12%"}}