{"output":"For each query word, print one line with the query word followed by one of the following possibilities:\n\n                    \n                    \tis correct, if the word occurs in the dictionary.\n                    \tis a misspelling of X, where X is a word of the dictionary similar to the query word, and the query word is not in the dictionary. In the case that there are several possibilities, select the word from the dictionary which appeared earlier in the input.\n                    \tis unknown, if cases 1 and 2 do not apply.","input":"The first line of the input file will give the number N of words in the dictionary (N ≤ 10000). The next N lines contain the dictionary words. The following line contains an integer Q ≤ 1000, the number of query words. The next Q lines contain the query words. You may assume that each word in the input consists of 1 to 25 lower case letters ('a' to 'z').","level":9,"name":"Automatic Correction of Misspellings","has_images":false,"description":"Some text editors offer a feature to correct words which seem to be written incorrectly. In this problem you are asked to implement a simple Automatic Correction of Misspellings (ACM).\n\n                    ACM takes care of the following misspellings of words:\n\n                    \n                    \tOne letter is missing (e.g., letter is written leter) or too much (e.g., letter is written lettter).\n                    \tOne letter is wrong (e.g., letter is written ketter).\n                    \tThe order of two adjacent letters is wrong (e.g., letter is written letter).\n                    \n\n                    ACM is based on a dictionary of known words. When a text contains a word which is not in the dictionary, ACM will try to replace it by a similar word of the dictionary. Two words are similar if we can transform one word into the other by doing exactly one of the misspellings listed above. An unknown word is left unchanged if there is no similar word in the dictionary.","id":"1657","category":"Ad-Hoc","statistics":{"level":"9 / 10","submissions":190,"solved":78,"ratio":"41.05%"}}