{"output":"For each test case print one line containing the abbreviated format of the sequence with the minimum number of operations which results in the same configuration of points as the input sequence. In case of multiple optimal solutions, print any solution.","input":"The input file consists of several test cases. Each test case starts with a line containing n (3 ≤ n ≤ 108), the number of points. The second line of each test case consists of an abbreviated sequence of operations as described above. All numbers will be positive and less than 108. There will be no empty line in the input file, and no line will contain more than 100000 characters. The last test case is followed by a line containing 0.","level":6,"name":"Dihedral Groups","has_images":true,"description":"Consider n points on a unit circle with numbers k = 0, 1, ..., n-1. Initially point k makes an angle of 360 · k / n degrees to the x-axis, measured in counter-clockwise direction. We are going to perform two different kind of operations on that set of points:\n\n                    \n                    \trotation by 360 / n degrees in clockwise direction\n                    \treflection with respect to the x-axis\n                    \n\n                    The following picture shows an example of these operations:\n\n                    \n\n                    Given a sequence of operations, we are interested in the shortest sequence of operations which gives the same result, i.e., the position of every single point is the same after performing either of those sequences of operations.\n\n                    The sequence is given as a string consisting of the characters 'r' and 'm' which represent clockwise rotation and reflection respectively (\"to the right\" and \"mirror\"). Multiple consecutive occurrences of the same character are collected into the representation <character><number>, and for convenience this will also be done for single occurrences. So \"rrmrrrrrrrrrrrr\" will be abbreviated to \"r2 m1 r12\". The representations of different operations are always separated by a single space.","id":"1658","category":"Mathematics","statistics":{"level":"6 / 10","submissions":59,"solved":26,"ratio":"44.07%"}}