{"output":"For each test case output a single line containing the number of soldiers that survive.","input":"The input file consists of several test cases. Each test case consists of a single line containing the three integers N (2 ≤ N ≤ 109), A and B (0 ≤ A, B < N) separated by white space. You may safely assume that the first soldier dies after no more than one million (106) steps. The input is terminated by a single number 0 which should not be processed.","level":6,"name":"Flavius Josephus Reloaded","has_images":false,"description":"Flavius Josephus once was trapped in a cave together with his comrade soldiers surrounded by Romans. All of Josephus' fellow soldiers preferred not to surrender but to commit suicide. So they all formed a circle and agreed on a number K. Every K-th person in the circle would then commit suicide. However, Josephus had different priorities and didn't want to die just yet. According to the legend he managed to find the safe spot in the circle where he would be the last one to commit suicide. He surrendered to the Romans and became a citizen of Rome a few years later.\n\n                    It is a lesser known fact that the souls of Josephus and his comrades were all born again in modern times. Obviously Josephus and his reborn fellow soldiers wanted to avoid a similar fiasco in the future. Thus they asked a consulting company to work out a better decision scheme. The company came up with the following scheme:\n\n                    \n                    \tFor the sake of tradition all soldiers should stand in a circle. This way a number between 0 and N-1 is assigned to each soldier, where N is the number of soldiers.\n                    \tAs changing numbers in the old scheme turned out to be horribly inefficient, the number assigned to a soldier will not change throughout the game.\n                    \tThe consulting company will provide two numbers A and B which will be used to calculate the number of the next soldier as follows: Let X be the number of the current soldier, then the number of the next soldier is the remainder of A·X2< + B mod N.\n                    \tWe start with the soldier with number 0 and each soldier calculates the number of the next soldier according to the formula above.\n                    \tAs everyone deserves a second chance a soldier will commit suicide once his number is calculated for the second time.\n                    \tIn the event that the number of a soldier is calculated for the third time the game will end and all remaining soldiers will surrender.\n                    \n\n                    You are to write a program that given the number of soldiers N and the constants A and B determines the number of survivors.","id":"1660","category":"Mathematics","statistics":{"level":"6 / 10","submissions":216,"solved":123,"ratio":"56.94%"}}