{"output":"For each test case output on a line the minimal number of DVD changes required to install all packages. By convention, the DVD drive is empty before the installation and the initial insertion of a disc counts as one change. Likewise, the final removal of a disc counts as one change, leaving the DVD drive empty after the installation.","input":"The input contains several test cases. Every test case starts with three integers N1, N2, D. You may assume that 1 ≤ N1,N2 ≤ 50000 and 0 ≤ D ≤ 100000. The first DVD contains N1 packages, identified by the numbers 1, 2, ..., N1. The second DVD contains N2 packages, identified by the numbers N1+1, N1+2, ..., N1+N2. Then follow Ddependence specifications, each consisting of two integers xi, yi. You may assume that 1 ≤ xi,yi ≤ N1+N2 for 1 ≤ i ≤ D. The dependence specification means that the installation of package xi requires the previous installation of package yi. You may assume that there are no circular dependences. The last test case is followed by three zeros.","level":9,"name":"All Discs Considered","has_images":false,"description":"Operating systems are large software artefacts composed of many packages, usually distributed on several media, e.g., discs. You probably remember the time when your favorite operating system was delivered on 21 floppy discs, or, a few years later, on 6 CDs. Nowadays, it will be shipped on several DVDs, each containing tens of thousands of packages.\n\n                    The installation of certain packages may require that other packages have been installed previously. Therefore, if the packages are distributed on the media in an unsuitable way, the installation of the complete system requires you to perform many media changes, provided that there is only one reading device available, e.g., one DVD-ROM drive. Since you have to start the installation somehow, there will of course be one or more packages that can be installed independently of all other packages.\n\n                    Given a distribution of packages on media and a list of dependences between packages, you have to calculate the minimal number of media changes required to install all packages. For your convenience, you may assume that the operating system comes on exactly 2 DVDs.","id":"1669","category":"Graph","statistics":{"level":"9 / 10","submissions":1280,"solved":263,"ratio":"20.55%"}}