{"output":"For each test case print a single line with \"Case #A: B\" where A is the number of the test case (starting from 1) and B is the minimum possible P that makes the level possible to complete. B should be rounded to 4 digits after the decimal point. The input will be in a way that errors up to 10-5 will still give the correct answer.","input":"The first line contains T (T ≤ 100) – the number of test cases. After this line, T test cases follows. The first line of a test case contains one integer N (1 ≤ N ≤ 104) – the number of sets of walls. Next N lines contain the description of the set of walls in the following format: First the number K (0 ≤ K ≤ 10) – the number of walls present in this set. Next, there are K tuples of floating point numbers in the form: X,Y (0 ≤ X, Y < 2π) – the wall starts at an angle X and extends along the circumference in clockwise direction until angle Y. Walls of the same set do not intersect. None of the sets will never be a full circumference. When the game starts, the first set will hit the center after P seconds and the black point can start at any position.\n\n                    The figure above illustrates the first sample test case.","level":9,"name":"Super Circumference","has_images":true,"description":"Skyrk has developed a game called Super Circumference. Its simplicity is only rivalled by its monumental difficulty. The goal of Super Circumference is to control a point which runs around a central circumference while attempting to avoid contact with incoming circular walls.\n\n                    \n\n                    The black point circles around the red circumference at the speed of one full revolution per second. A level has several sets of incoming circular walls from which the point has to avoid contact. An incoming wall can be regarded as a circumference sector. The set of walls approach the center at the speed of one set every P seconds. The player wins the game if he successfully evade all walls.\n\n                    A brand new level has been created with N sets of walls. To adjust its difficulty properly, you are asked to find the minimum possible value of P that still makes the level possible to complete.  ","id":"1691","category":"Ad-Hoc","statistics":{"level":"9 / 10","submissions":29,"solved":8,"ratio":"27.59%"}}