{"output":"For each test case output on a single line, the length of the longest pair of antenas, such that both antennas have the same length, and can be built using the toothpicks Joãozinho as described above.","input":"The input consist of a series of test cases. \n                    Each test case consis of two lines. The first contain a integer N ( 1 <= N <= 1000 ), the number of toothpicks found. The second line has a sequence of N integers, S1, ..., Sn, where Si  (1 <= Si <= 100) is the length of the ith toothpick found by Joãozinho.\n\n                    The input will be terminated by a test case starting with N = 0. This test case should not be processed.","level":9,"name":"Antennas","has_images":false,"description":"The kindergarten teacher asked the class, as a homework, to make a robot only using toothpicks and glue. Joãozinho  likes to personalize his stuff, so he decided to make his robot with as long antennas as he could. When Joãozinho was constructing his robot, he got out of toothpicks, exactly when he was starting to build the antennas, as it was too late, he could not buy more toothpicks. Joãozinho racked his brains to find out a way to finish his robot, then he realized that his neighbour, mr. Silva, has a bar, and maybe he could have some toothpicks to give him. \n                     Unfortunately Joãozinho was not on a lucky day, when he got to the bar, mr. Silva told him that he was out of toothpicks either, because all his toothpicks were used by his clients in that day, they were all over the floor, and some of them were dirty and broken. As Joãozinho is a very persistent boy, and a little bit grubby too, he decided to use this\n                    sticks anyway, and he made a deal with mr. Silva, he would sweep the floor of the bar in exchange for all the toothpicks he find. \n\n                    As it was even latter when Joãozinho finished his task, he asked you to help him to find out, what was the longest pair of equal size antennas, he could make.\n\n                    You are given the number of toothpicks he found, N, and the length of each toothpick. Determine the length of the longest pair of antenas, such that both antennas have the same length, and they can be built concatenating any number of toothpicks by its ends.","id":"1700","category":"Paradigms","statistics":{"level":"9 / 10","submissions":999,"solved":198,"ratio":"19.82%"}}