{"output":"For each query, output a line saying \"M is x km off A/B equidistance.\" with M,x,A,B appropriately replaced, M by the Meeting point, x  the calculated distance rounded to the nearest integer, A by Alice's home location and, B by Bob's home location.\r\n\r\n                    p>If one of the locations in the query didn't occur in the list of locations replace x by \"?\" .","input":"The input file consists of two parts: a list of locations and a list of queries.\r\n\r\n                    The location list consists of up to 100 lines, one line per location. Each contains a string S and two floating-point numbers, La, Lo, separated by whitespace,  representing the name of the location(S), its latitude (La) and its longitude (Lo). Names are unique and shorter than 30 characters and do not contain whitespace. Latitudes are between -90 (South Pole) and 90 (North Pole) inclusive. Longitudes are between -180 and 180 inclusive where negative numbers denote locations west of the meridian and positive numbers denote locations east of the meridian. (The meridian passes through Greenwich, London.) The location list is terminated by a line consisting of a single \"#\".\r\n\r\n                    Each line in the query list contains three names of locations, A, B, M. You can assume A the first location to be Alice's home, B, the second location to be Bob's home and , M the third location to be a possible meeting point. The query list is terminated by a line consisting of a single \"#\".","level":9,"name":"Equidistance","has_images":false,"description":"Alice and Bob haven't met for some time. Bob isn't very happy about this, so he urges Alice to finally make time for a meeting. Let's listen to an extract from a phone call:\r\n\r\n                    Alice: ... maybe we should meet on neutral territory. \r\n                    Bob: I've already heard this from you --- two years ago. \r\n                    Alice: I know ; I just haven't found yet a suitable place that is roughly at the same distance from both yours and mine. \r\n                    Bob: Well, the geometric place of the points that are equidistant from two given points on the surface of a sphere (and the earth is a sphere rather than a disc) is a great circle (namely the one which intersects the great circle through the given points orthogonally at the center of them). If you insist only on approximately equal distances though, we get a zone of some kilometers width and about 40000 km length. Not everything in this zone is water. Thus I think it is a feasible task to find a fitting place. \r\n                    Alice: Now, if I tell you to pick any, we'll certainly land up in Honolulu. \r\n                    Bob: Which is not a too bad idea. So, may I pick any ? \r\n                    Alice: As long as I don't have to accept --- but I'm open to suggestions. \r\n                    Bob: Honolulu ? \r\n                    Alice: Is it situated on aforementioned geometric place at all ??! \r\n                    Bob: Not quite ...\r\n\r\n                    Nice. Now let's stop the preliminaries and come to the facts: Given two locations on the earth's surface you can find the geometric place of all equidistant points on the surface. For another given location calculate its distance on the surface to this geometric place. Assume that the earth is a sphere with a radius of 6378 km.","id":"1721","category":"Computational Geometry","statistics":{"level":"9 / 10","submissions":101,"solved":32,"ratio":"31.68%"}}