{"output":"For each test case, output a line containing some optimal common ancestor and the minimal total costs.","input":"The input file contains several test cases. Each test case starts with two integers N and L, denoting the number of sequences at the leaves and their length, respectively. Input is terminated by N = L = 0. Otherwise, 1 ≤ N ≤ 1024 and 1 ≤ L ≤ 1000. Then follow N words of length L over the amino acid alphabet. They represent the leaves of a complete binary tree, from left to right.","level":10,"name":"Phylogenetic Trees Inherited","has_images":false,"description":"Among other things, Computational Molecular Biology deals with processing genetic sequences. Considering the evolutionary relationship of two sequences, we can say that they are closely related if they do not differ very much. We might represent the relationship by a tree, putting sequences from ancestors above sequences from their descendants. Such trees are called phylogenetic trees.\r\n\r\n                    Whereas one task of phylogenetics is to infer a tree from given sequences, we'll simplify things a bit and provide a tree structure - this will be a complete binary tree. You'll be given the n leaves of the tree. Sure you know, n is always a power of 2. Each leaf is a sequence of amino acids (designated by the one-character-codes you can see in the figure). All sequences will be of equal length l. Your task is to derive the sequence of a common ancestor with minimal costs.\r\n\r\n                        \r\n                        \r\n                            \r\n                                \r\n                                    Aminoácido\r\n                                    Alanine AlaA  \r\n                                    ArginineArgR \r\n                                    AsparagineAsnN \r\n                                    Aspartic Acid AspD \r\n                                    CysteineCysC \r\n                                    Glutamine     GlnQ \r\n                                    Glutamic Acid GluE \r\n                                    Glycine       GlyG \r\n                                    Histidine     HisH \r\n                                    Isoleucine    IleI \r\n                                \r\n                            \r\n                            \r\n                                \r\n                                    Aminoácido\r\n                                    Leucine       LeuL\r\n                                    Lysine        LysK\r\n                                    Methionine    MetM\r\n                                    Phenylalanine PheF\r\n                                    Proline       ProP\r\n                                    Serine        SerS\r\n                                    Threonine     ThrT\r\n                                    Tryptophan    TrpW\r\n                                    Tyrosine      TyrY\r\n                                    Valine        ValV\r\n                                \r\n                            \r\n                        \r\n                    \r\n\r\n                    \r\n\r\n                    The costs are determined as follows: every inner node of the tree is marked with a sequence of length L, the cost of an edge of the tree is the number of positions at which the two sequences at the ends of the edge differ, the total cost is the sum of the costs at all edges. The sequence of a common ancestor of all sequences is then found at the root of the tree. An optimal common ancestor is a common ancestor with minimal total costs.","id":"1723","category":"Graph","statistics":{"level":"10 / 10","submissions":42,"solved":9,"ratio":"21.43%"}}