{"output":"For each test case output a single line containing the integer that represent the least number of visible routes that Donkey will have to take.","input":"The first input line containts the number of test cases T (1 ≤ T ≤ 100).\n\n                    The first line of each test case contains the integers  N (1 ≤ N ≤ 100) and V (0 ≤ V < N2/2), the number of cities and the number of visible routes, respectively.\n\n                    The next V lines will contain the integers Ai e Bi (Ai ≠ Bi; 0 ≤ Ai, Bi < N) , indicating that the route between the barrels of cities Ai and Bi​ are currently visible from the ground. There pair Ai, Bi will never appear more than once per test case.","level":6,"name":"Barrel Travel","has_images":true,"description":"Donkey Kong has unfinished business around the country and since he is in hurry to solve them, he opted to move through the UBTS (Unified Barrel Transportation System). \n\n                    \n\n                    Each city has a single barrel. This barrel can aim and fire to any other city's barrel \"the passenger\" wish.\n\n                    Donkey wants to make a discreet trip and asked your help to find a set of routes that minimizes the number of times he will be seen in the shots.\n\n                    The set of routes Donkey wants to find will depend on how the clouds are positioned in a given moment. As shown in the picture above, the barrels are located above the clouds. Donkey's plan is to use the clouds to hide his path. To assist you in your task, Donkey borrowed you a radar that shows which routes can be seen from groudn in a given moment.\n\n                    Your task is to tell Donkey what is the least number of visible routes that he will need to take to assure that he will be able to move to any city he wish.\n\n                    Each route is considered a single time in the counting, despite the direction it is used. In other words, if route A-B is visible and he takes this route 10 times, it still counts as a single route.","id":"1757","category":"Graph","statistics":{"level":"6 / 10","submissions":633,"solved":195,"ratio":"30.81%"}}