{"output":"For each student print a single line containing the average obtained by him after the Professor Charles' rounding rules. The average must contain 2 digits after decimal point.","input":"The first input line contains the integer T ( 1 ≤ T ≤ 5000), the number of test cases.\n\n                    The first line of a test cases contains the integers P (2 ≤ P ≤ 5) and N (2 ≤ N ≤ 50), indicating the number of exams the professor applied and the number of students enrolled in the course, respectively.\n\n                    The following N lines will have P floating point numbers (with 1 number after decimal point) each, indicating the grades (0.0 ≤ grade ≤ 10.0) obtained by the ith student in each of the exams.","level":4,"name":"Bonus Grade Points","has_images":false,"description":"Professor Charles teaches in a school whose evalutation criteria is the following:\n\n                    \n\n                    average ≥ 7.0 = PASS\n\n                    4.0 ≤ average < 7.0 = FINAL EXAM\n\n                    average < 4.0 = FAIL\n\n                    \n\n                    Professor Charles decided to round the student grades based on their perfomance and the following rules:\n\n                    1 - If the result of a rounding is lower than the original grade, the original grade will be final result. \n\n                    2 - Roudings that change the student final verdict (PASS, FINAL, FAIL) are not allowed.\n\n                    3 - Students that passed or are able to do the final exam will have their average replace by the highest grade obtained in the tests.\n\n                    4 - Students that failed were lazy and will not receive any bonus points.\n\n                    Rule 3 must be applied always when possible, as long as it does not violate rules 1 or 2.\n\n                    Write a program that takes as input the grades obtained by the students in each test and calcuate their average based on the criteria stablished by Professor Charles.","id":"1758","category":"Ad-Hoc","statistics":{"level":"4 / 10","submissions":1469,"solved":526,"ratio":"35.81%"}}