{"output":"For each case output a line containing \"Caso #X: Y\", where X is the number of the current case, starting at 1, and Y is the string \"Challenge Accepted!\" if you can arrange the robots the way Hector wants or \"Run for your life!\", otherwise.","input":"The first line contains an integer T (1 ≤ T ≤ 1000), the number of test cases. Each test case starts with a line containing a single integer N (1 ≤ N ≤ 100), the number of different colors. Following, there will be a line with N integers Ai (1 ≤ Ai ≤ 1000), the number of robots with the i-th color.","level":9,"name":"Robots Formation","has_images":true,"description":"The inventor of Hector Con Carne, Major Dr. Ghastly, finished building a new army of robots, and it is ready to be sent to conquer the world. The robots have N different colors, each showing the type of weapon it uses. Hector told you, one of his minions, to arrange them in formation, that is, in several rows side by side, forming a matrix. Hector gave you certain rules for this:\n\n                    \n                    \tThere should be at least two rows\n                    \tAll rows should have the same number of robots\n                    \tConsidering the colors of robots, all rows must be symmetrical about a central axis parallel to the rows\n                    \n\n                    \n\n\n                    The images above show two possible formation of robots for different amounts of colors. The rows are arranged vertically, and in the first image the axis of symmetry parallel to the rows passes between the two rows of the center; in the second image, the axis of symmetry passes through the center of the central row.\n\n                    If you are not able to organize the robots how Hector asked you, Dr. Ghastly will dissect you and turn you into one of them. Given the amounts of robots of each color, decide if you can fulfill his order or if you should flee while there is still time.","id":"1780","category":"Ad-Hoc","statistics":{"level":"9 / 10","submissions":139,"solved":46,"ratio":"33.09%"}}