{"output":"Print a single line, containing a single value, the maximum amount of possible locations that can be visited if the start position is chosen optimally.","input":"The input contains several test cases. The first line of a test case contains three positive integers L, C and K (1 ≤ L, C ≤ 1000, 0 ≤ K ≤ 5), indicating the number of rows, columns and number of special positions that can be used, respectively. The second line contains a character P (‘N’ or ‘R’) representing the game mode, normal or reverse, respectively.\n\n                    Each of the following L lines contains C integers X (0 <= X <= 10^7).\n\n                    The end of input is indicated when L = C = K = 0 and should not be processed.","level":9,"name":"Playing with Numbers","has_images":false,"description":"Some friends, bored on a Sunday afternoon, decided to create a game. They designed a bidimentional array of L rows and C columns on a paper, and then wrote a number on each of the LxC positions.\n\n                    The game works as follows:\n\n                    \n                    \tA position (i, j) of the matrix is chosen to start the game, i represents a row and j a column.\n                    \tFrom this position, it is possible to move to the positions (i-1, j) - (i, j+1) if the game is on Normal mode or the positions (i+1, j) - (i, j-1) if the game is on Reverse mode. However, you can only move to any of these positions if the number contained there is less than the number in the current position.\n                    \tIn this game, there are some special positions. Those are the positions containing a prime number. When a player lands in this position, he can move to any one of the two adjacent (in accordance with the game mode), even if the number contained there is not less than the current number.\n                    \tIn a match, you can use only K special positions. After using the K positions, a position with prime number is treated as a normal one.\n                    \tThe game goal is to \"visit\" the largest number of positions as possible.","id":"1788","category":"Paradigms","statistics":{"level":"9 / 10","submissions":332,"solved":120,"ratio":"36.14%"}}