{"output":"The output of your program must consist of a single line, containing the word YEAH if the escape is possible or the word OUCH otherwise.","input":"The first line of the input determine the number N of floors in the building (1 ≤ N ≤ 106) and the value of HAR (0 < HAR < 2 × 104). Each one of the N following lines describes a floor of the building by 3 integers: XC, YC and S (0 < XC, YC, S < 104), which respectively represent the coordinates of the centre and the length of the side of the floor. The floors are described in decreasing order of altitude.","level":9,"name":"Blasted and Curious","has_images":true,"description":"Vin Gasoline and his best friend Paul Runner are at the top floor of a building in Abu Dhabi stealing a Lykan HyperSport. It's the year of 2300, and the floors of the buildings no longer are supported one over the other, but they all float in the air and move once in a while, maintaining just their altitude. In the building in which our heroes are, the floors are all square-shaped. The figure on the left illustrates the building as seen from above and the figure on the right illustrates it as seen from the front, representing the ground for the thicker line.\n\n\t\t\t\t \n\n\t\t\t\tGasoline and Runner want to abandon the building as soon as possible, so they need to speed up the supercar in order to jump from the top floor to the penultimate floor, from the penultimate floor to the antepenultimate floor, and so on until they reach the ground and escape. They know that the Lykan HyperSport withstands a jump from an i-th floor to a j-th floor if and only j = i - 1 and the horizontal distance needed to be traveled is not greater than HAR, the Horizontal Air Reach of the car. With the onboard computer, they have all the informations about the location of the floors, but they need to quickly calculate whether the escape will be possible or not.","id":"1797","category":"Computational Geometry","statistics":{"level":"9 / 10","submissions":594,"solved":166,"ratio":"27.95%"}}