{"output":"Print the sum of K more expensive distinct sets of books.","input":"The input consists of 6 lines: The first line contains an integer P (5 ≤ P ≤ 10), representing that Bino has P different types of portuguese books, followed by P integers vi (1 ≤ vi ≤ 1000), representing the values ​​of each Portuguese book. The second line contains an integer M (5 ≤ M ≤ 10), representing that Bino has M different types of math books, M integers vi (1 ≤ vi ≤ 1000), representing the values ​​of each math book. The third line contains an integers F (5 ≤ F ≤ 10), representing that Bino has F different types of physics books, followed by F integers vi (1 ≤ vi ≤ 1000) representing the values ​​of each physics book. The fourth line contains an integer Q (5 ≤ Q ≤ 10) representing that Bino has Q different types  of chemistry books, followed by Q integers vi (1 ≤ vi ≤ 1000) representing the values ​​of each chemistry book. The fifth line contains an integer B (5 ≤ B ≤ 10), representing that Bino has B different types of biology books, followed by B integers vi (1 ≤ vi ≤ 1000) representing the values ​​of each biology book. The sixth line contains an integer K (1 ≤ K ≤ M*P*Q*F*B) representing the amount of different sets of books in books catalog.","level":2,"name":"Books Catalog","has_images":false,"description":"Bino is preparing a book catalog. He is organizing a catalog with K different sets of books to sell in your online store. Each set of books consists of five books, one for each subject (portuguese, mathematics, physics, chemistry and biology). Two sets of books are considered distinct if there is at least one book that is at one and the other is not. Bino want to expose on the site only the most expensive distinct sets, and asked for your help.\n\n\t\t\t\t The value of each set is the sum of the values of each book that's in it. Your task is to calculate the total value of K more expensive distinct sets of books. In case of a draw among the most expensive sets, Bino choose any more expensive set.","id":"1802","category":"Ad-Hoc","statistics":{"level":"2 / 10","submissions":1430,"solved":814,"ratio":"56.92%"}}