{"output":"Print the minimum amount of criminals who Bino will eliminate.","input":"The first line contains four integers, N(1 ≤ N ≤ 10000), C(1 ≤ C ≤ 50000), S(1 ≤ S ≤ 50000) and B(1 ≤ B ≤ 10000), representing respectively the number of places in the city, the number of routes known by Bino, the number of routes known only by criminals and the number of criminals. Each of the next C lines contains three integers a(1 ≤ a ≤ N), b(1 ≤ b ≤ N) and v (1 ≤ v ≤ 1000), representing that there is a route between locations a and b with distance v meters. Each of the next lines S contains three integers a(1 ≤ a ≤ N), b(1 ≤ b ≤ N), v(1 ≤ v ≤ 1000) representing that there is a secret route between locations a and b with distance v meters. The next line contains B integers li (1 ≤ li ≤ N) representing the criminal i starts in place l. The last test case line contains two integer K(1 ≤ K ≤ N), and F(1 ≤ F ≤ N), respectively representing the initial place Bino and where he'll have to deliver a secret message.","level":7,"name":"Agent 004","has_images":false,"description":"A criminal organization of the city is getting more powerful every day, and for to try follow this advance, the protective organization of the city is investing heavily on the training of his men. Bino, also known as Agent 004, is the best agent of the protective organization, thus he was assigned to a special mission.\n\n\t\t\t\tThe special mission of Bino is to deliver a secret message from a barrack of training special agents to another barracks. The city is full of criminals, and they want to intercept Bino before to deliver the secret message.\n\n\t\t\t\tBino not know very well the routes of the city, having spent most of the time of your life being trained in barracks of training special, unlike the criminals, who spend most of their lives on the streets and know all possible routes.\n\n\t\t\t\tAs Bino is the world's best agent, he is capable of instantly eliminating any number of criminals. Criminals can intercept Bino anywhere in the city (In all routes and all  places, even in places where the initial barrack and the destination barrack). Bino and criminals move at 12 m/s. Bino always use the path that will find less criminals, but criminals always use the best paths to intercept Bino.\n\n\t\t\t\tYour task is to find out what the minimum amount of criminals who Bino will have to eliminate to deliver a secret message from a barrack of training to another. It is guaranteed there will still be at least one path from every place in town for every other place.","id":"1806","category":"Graph","statistics":{"level":"7 / 10","submissions":453,"solved":171,"ratio":"37.75%"}}