{"output":"For each instance solved, you should print and identifier \"Instancia h\", where h is the number of the instance, starting from 1. The next k lines refer to the possibility of the deliveries. For 1 ≤ j ≤ k, you should print on the j-th line the message \"Impossivel\" if it's not possible to make the delivery within the time limit, or \"Possivel - <d> km, <t> min\", where <d> is the distance that must be traveled and <t> is the time spent to travel this distance. If there is more than one route with the minimum possible distance, choose the one with the minimum time.\n\nA blank line should separate the output of each instance.","input":"Your program will be able to solve several instances of the logistical problem. Each instance is structured as described below.\n\n                    On the first line, there will be the number of cities (O ≤ n ≤ 100) and the number of roads (0 ≤ m ≤ 10000) in the network. On the next m lines, there will be, in each line, four integers separated by blank spaces, x y c t, meaning that the road leads from x to y, c is its length and t is the time needed to travel through it (this datum has been obtained from the national department of roads and transportation, which evaluates the traffic regularly). Observe that 1 ≤ x, y ≤ n e that c, t ≥ 0. An interesting fact about Czech Republic is that all of its roads are one-way in order to avoid dangerous passings, which may cause accidents.\n\n                    On the following line, an integer k ≥ 0 is given, representing the number of deliveries your program should plan in this network. The next k lines give, in order, the city of origin, the city of destiny and the time limit t for the transportation of this merchandise, in minutes. According to the inspectors, no transportation lasting more than 100 hours will be admited. Therefore, 0 ≤ ṱ ≤ 6000. A value n = 0 indicates the end of the input and should not be processed.","level":9,"name":"Anachronic?","has_images":false,"description":"Mr. Řež Slovankou is the owner of a company in Prague specialized in transportation of perishable products. Because his company is one of the oldest and more traditional companies in the branch, it is responsible for more than 90% of all the transportations of this kind of merchandise in the country. Daily, several loaded trucks leave from a post of the company (the place where the products are stored) on their way to the consumer centers.\n\n                    Aiming a future entry in the European Economic Space, the Czech Republic government, through its Healthcare Comission, imposed a series of measures to further ensure the quality of the food consumed by the population. To avoid losing its place in the market, Mr. Řež's company needs to adjust itself to the new rules as soon as possible.\n\n                    According to the government, from now on, products destined to different consumer centers can't share the same truck any more. Besides that, all the transportation must be completed in less time than a given limit specified for each merchandise.\n\n                    Adapting to these new rules will bring a meaningful increase to the company's operational costs. Worried about that, Mr. Řež decided that his trucks will obey the rules, but they also must travel through the shortest path possible, in order to save fuel, slow down the tire wear, etc.\n\n                    To solve this logistical issue, Mr. Řež asked you to help him, since you said you would be able to write a program that receives a map with the roads (in which each road is associated with a length in kilometers and a time in minutes that it takes to be traversed), the origin and the destiny of the transportation and the time limit, and says whether it is possible or not to deliver the products in accordance to the imposed restrictions. If so, you also said that that you will provide data about the time spent and distance traveled.\n\n                    Mr. Řež was very impressed and satisfied with your helpfulness, and promised you a nice reward.","id":"1813","category":"Graph","statistics":{"level":"9 / 10","submissions":334,"solved":72,"ratio":"21.56%"}}