{"output":"The output file must contain, for each input instance, an indentifier Instancia h (Instance h), where h is an integer, sequential and ascending starting from 1. In the following line, a number (rounded to 6 decimals) indicating the probability of Mr. Třeboň not have found his house after m bells rang. A blank line must separate the output of each instance, including the last.","input":"The input file has the following composition for each instance: the first line contain the integers 0 ≤ n ≤ 100, 0 < t ≤ n, 0 < k ≤ n, 0 < m ≤ 100, representing the number of houses, the initial house, Mr. Třeboň's house and the quantity of houses that he can visit to try to get home, respectively. Then n lines are gaven. The i-th line represents the house i and contain the numbers ai1, ... , aij, ... , ain, separated by whitespaces, representing the probability of Mr. Třeboň to go from i to j. The input ends with n = 0.","level":8,"name":"Drunk People?","has_images":false,"description":"In the winters of Praga the cold is unbearable. To keep the body warm, many locals use warm drinks (like coffee or tea for example) or alcoholic drinks. Sometimes, Mr. Třeboň frequents a small bar from his neighborhood. However, after several hours, some end up exaggerating on the doses. In this moment, Mr. Třeboň needs to return to his house. The problem is that he's not feeling well (actually he's drunk :-) and he doesn't remember where he lives. So he begins ringing the houses' bells to ask if he lives there. He does that until he finds his house. Due to his state, Mr. Třeboň won't follow any logical order to ring the houses' bells. After ringing a bell and verifying that that house isn't his, he will keep searching. Also he can't memorize which bells he already rang. The way he chooses the houses to have their bells rang follows a distribution of probability conditioned only to the last house visited. Consider that someone always answers the door and responds to Mr. Třeboň if he lives there or not. We want to know his chances of not getting home to sleep, knowing that after ringing a ceirtain number of bells he won't be able to carry on and he'll end up staying there.","id":"1815","category":"Mathematics","statistics":{"level":"8 / 10","submissions":269,"solved":114,"ratio":"42.38%"}}