{"output":"For each solved instance, you must print the identifier Instancia h where h is an integer number that sequentially increases from 1. In the next line you must output the decoded text. A blank line must be printed after each instance.","input":"Your program must be prepared to work with multiple instances. Each instance have the following structure. In the first line an integer m (0 ≤ m ≤ 10000) that represents the number of integers that compose the encoded text. In the next line its given, separated by white spaces, the m integers values (each value is greater or equal to 1 and less or equal to 26). A value of m = 0 indicates the end of the instances and must not be processed.","level":2,"name":"Prague Vikings?","has_images":false,"description":"Traces of an old viking civilization has been discovered around Prague, and a big amount of printed material was found near the arqueological site. As expected, the reading of this material proved to be arduous and challenging, since this civilization used a text encoding schema to avoid its knowledge to be used by its rivals.\n\n                    Recently, czech researchers announced with great excitement to the press the understanding of the encoding mechanism used by those vikings. According to the researchers, the viking alphabet was made by the letters from A to Z (including letters K, W and Y).\n\n                    The encoding we accomplished in the following way. Initially, it was built a list where the letter A appear in the first position, the letter B in the second, and so on, with the letters following the same order of our alphabet. Next, the text to be encoded was swept from left to right and, for each letter l found, the number of its position on the list was printed and l was moved to the start of the list. For instance, the viking encoding for the message:\n\n                    A B B B A A B B B B A C C A B B A A A B C\n\n                    was given by the following integer sequence:\n\n                    1 2 1 1 2 1 2 1 1 1 2 3 1 2 3 1 2 1 1 2 3\n\n                    The czech researchers are asking your help to build a program that receive a sequence of integers that represents an encoded message and decode it.","id":"1816","category":"Ad-Hoc","statistics":{"level":"2 / 10","submissions":613,"solved":347,"ratio":"56.61%"}}