{"output":"For each solve instence, you should print a identifier Instancia h wherein h is an integer, and increasing sequentially from number 1. If there are no squares in groups, your program should print ok. Otherwise, your program should print all found squares, one per line, with the students numbers separated by a blank space. To facillitate the readind of the rector, the students numbers in a square should be in ascending order and the squares should be listed in ascending lexicographic order.\n\n                    A blank line should separate the output of each instance.","input":"Several instances are given. For each instance it is given the number m (0 ≤ m ≤ 50) groups. The value m = 0 indicates the end of the data and it should not be processed.\n\n                    Each student in Sing Pil is identified with an integer number between 1 and 100 inclusive. In the next m lines are given, in each row, three numbers corresponding to three students who form a group.","level":9,"name":"Sing Pil University Groups","has_images":false,"description":"In the famous university of Sing Pil the students always make the work in group. The rules for the group formation, however, are written and the rector always checks if there is a group of students who violated the rules.\n\n                    Well, to tell the truth, the only existing rule dates back to the creation of the university. At that time the students comprised groups of three students to do the tasks. Four students, called Ting, Ling, Xing e Ming were close friends and, for all the tasks that need be made, they used comprise a group between them. That was too bad, because forcing the tasks into groups aimed to increase interaction among students. Since then was banned in Sing Pil the square formation, i.e, that four students assemble four groups in which only they are the members.\n\n                    For students {Ting, Xing, Ling, Ming} (we will use only the first letter for short) a square would be formed by four groups as follows:\n\n                    {TLX, TXM, MXL, LMT}.\n\n                    Your task in this problem is write a program to help the university president to verify whether or not there are squares in groups.","id":"1820","category":"Ad-Hoc","statistics":{"level":"9 / 10","submissions":75,"solved":23,"ratio":"30.67%"}}