{"output":"For each solved instance, you must print a handle Instancia h, where h is an integer increasing and sequential number starting from 1. On the next line, you must print possivel if you can perform marriages among the n boys and the n girls without marriages of relatives, and print impossivel otherwise.\n\n                    A blank line must separate the output of each instance.","input":"Your program must work with many groups of guys, hereinafter referred instances. Each instance has the following structure.\n\n                    In the first line, two integers are provided. n (0 ≤ n ≤ 100) represents the number of boys and girls and m (0 ≤ m ≤ 1000) represents the number of kinships among them. Kinships between a same gender were not included in m because that is irrelevant to the problem.\n\n                    In the next m lines, m pairs of numbers between 1 and n (including) are provided, one pair per line. The first number is a boy and the second a girl who are relatives.\n\n                    Values ​​n = m = 0 indicate the end of instances and shall not be processed.","level":9,"name":"Chinese Miai","has_images":false,"description":"The problems that China is facing over time to control the population explosion that afflicts the country are notorious. To make matters worse, in the inland part of this country, traditional marriages are often arranged in families, what increases the chance of children with related parents.\n\n                    Aware of the problem, the Chinese government decided to create an agency official marriages. This agency shall receive information from young people who wish to marry and decide whether it is possible to perform marriages among them to prevent wedding of relatives and to guarantee that none of the young guys ends single. As in many other countries, in China, only monogamous marriages between boys and girls are allowed.\n\n                    Your task is to assist the government, writing a program to find out if it is possible to perform the marriages for given young groups.","id":"1821","category":"Graph","statistics":{"level":"9 / 10","submissions":152,"solved":53,"ratio":"34.87%"}}