{"output":"For each solved instance, you should print an identifier “Instancia h” where h is an integer, and increasing sequential number starting from 1. On the next line, you must print the smallest possible value that the contractor should spend with officials throughout this work.\n\n                    A blank line should separate the output of each instance.","input":"Your program should be prepared to work with diverse constructions, hereinafter referred to as instances. Each instance has the following structure.\n\n                    In the first row an integer n (0 ≤ n ≤ 200) representing the number of weeks of the work is provided. In the next row are given, separated by whitespace, non-negative integers n and less than or equal to 50, in which the i-th value (1 ≤ i ≤ n) represents the number fi of employees needed in the i-th week.\n\n                    On the next line, also separated by whitespace, are provided four integers x, y, z and w (0 ≤ x, y, z, w ≤ 1000), where x is the cost of recruitment and education of a new employee, y is the cost of firing an employed employee, z is the weekly cost of an employee required and w is the cost to maintain a surplus employee for a week's work.\n\n                    A value n = 0 indicates the end of the instances and should not be processed.","level":5,"name":"Constructions of China","has_images":false,"description":"Due to the economic liberalization that occurred in China in recent years, much of the country was transformed into a construction site. Some buildings in progress are so monumental that, along with the already famous Wall of China can be seen from the moon to the naked eye.\n\n                    A contractor rooted in Shanghai is responsible for the execution of various works in the country. After some time, the contractor's engineers realized that every new work, they had to solve a similar to what had already settled at the beginning of the previous works problem. Tired of always performing the same types of calculations, requested his help in building a program that solved their problem, described below.\n\n                    Consider a work that lasts for n weeks. The i-th week of work, for 1 ≤ i ≤ n, fi employees are needed to run it. The costs of recruitment and education of an employee are x yuan. One spends y yuan to dismiss an employee. A necessary expense employee z yuan per week and each additional employee, i.e., that each contract employee is not required in a week of work, costs w yuan a week for the contractor. (yuan is the Chinese currency.)\n\n                    Staff can be hired and fired every week. Initially, the work does not have any employees. At the end of it, all employees should be fired.\n\n                    The problem is to determine the smallest possible value that the contractor should spend with officials throughout the work, always meeting the weekly restrictions. I.e., there can be no less than fi employees working on site in the i-th week.","id":"1822","category":"Paradigms","statistics":{"level":"5 / 10","submissions":43,"solved":28,"ratio":"65.12%"}}