{"output":"For each instance resolved, you should print a identifier “Instancia h” (where “Instancia” means “instance” in Portuguese) in which h is a integer number, sequentially growing from 1. In the next line, you should print “sim” (“yes” in Portuguese) if there exists a way to go from the maze’s base to the arrival point (without crossing any chopstick...), and print “nao” (“not” in Portuguese) otherwise.\r\n\r\n                    A blank line should separate the output of each instance.","input":"Your code must be prepared to work with several mazes, from now on designated instance. Each instance is started with one line containing 5 numbers, called  n xi  yi  xf  yf . The value of n indicates the number of chopsticks used for building the maze. The ordered pair ( xi  , yi ) is the left bottom of the yard and the base. The ordered pair ( xf  , yf ) is the right upper and the arrival point. The next n lines give the coordinates  x1  y1  x2  y2  representing the extremes ( x1  , y1 ) and ( x2  , y2 ) of one of the chopsticks used to build the maze. The input file ends with  n   < 0. It can be assumed that all numbers given are integers and that  n   ≤ 1000.","level":10,"name":"The Last But One Emperor","has_images":false,"description":"Very much has been known about China's last emperor, immortalized in the classic Oscar-winning movie. However, his predecessor, the Emperor Thang Po Lop had a much more interesting life, once he died even in the forbidden city surrounded by concubines and eunuch servants.\r\n\r\n                    The Emperor Po Lop was a great chopsticks collector. Since the age of 9 years, he was keeping them and was building with them huge mazes using a quite interesting strategy. First Po Lop chose a rectangular yard of the forbidden city to build the maze, which always occupied all space of the chosen yard. The chopsticks were then put in the yard, apparently at random places, and always parallel to one of the yard’s corners. The emperor never put chopsticks to overlap (or even part of them), although crossing or even leaning chopsticks are possible. According to his biography, the emperor Po Lop built monstrous mazes always carefully.\r\n\r\n                    Unfortunately there was a problem. Although an expert builder of the mazes, the emperor was unable to know if the maze was finally containing a path linking its entrance to the exit (always in opposite sides of the yard) or not. To know that, he was using his eunuchs. He was instructing the eunuch to seek the path that matches. Many times, the eunuch said it was not possible. The emperor Po Lop become angry and beheaded the servant because he doubted on his servant’s answer. Happily, as being very patient (not with eunuchs) the emperor was quite careful and wrote down judiciously the information about the mazes built. His notes were found in the library of the forbidden city when the revolution occurred and were saved from destruction. Your task in this problem is to solve finally the riddle, verifying if the mazes built by Emperor Po Lop have an exit or not.","id":"1823","category":"Graph","statistics":{"level":"10 / 10","submissions":28,"solved":5,"ratio":"17.86%"}}