{"output":"For each solved instance you should print a identifier Instancia h, wherein h is an integer, sequantial and crescent from 1. In the next line, you should print sim if the frog went through all mn positions of the lake, and nao otherwise. A blank line should separate the output of each instance.","input":"The input file contains several instances. Each instance begins with two integers m (0 ≤ m ≤ 1000) and n (0 ≤ n ≤ 1000) which defines the area of the lake. Then, each the next m lines contains n integers, describing the behavior of the frog when it placed in that position on the lake. Values m = n = 0 indicate the final of the instances and it should not be processed.","level":9,"name":"Tse Tse Frogs","has_images":false,"description":"The sleep fly is one of the most serious pests in China, which causes huge losses to the country government. Entire populations of small towns are bitten by the fly, and fall asleep during work (many suspect that neither are the flies causing the problem, but that's another history...).\n\n                    Worried with this situation Genetic Engineering researchers of the University of ZhaoZhao studied the genome of a eater insects frog in the region and found that the pattern of jumps of the frog could be easily controlled if a change was made ​​in their chromosome 12. Unfortunately, not all experiments resulted in success, and in addition to some frogs with no legs and 12 eyes, the experiments yielded several species of frogs with different characteristics of jumps. The goal of this problem is that you develop a program that, from the observation of the pattern of frog jumps, make sure it is of the desired type. The frog is of the desired type if is placed in the upper left corner of a rectangular lake he covers the entire length of the lake with a minimum number of hops.\n\n                    To note the pattern of frog jumps were made several experiments. In each experiment the frog was placed in a position of the lake and noted that neighboring position he jumped. Neighboring positions are listed 1-8 in a clockwise direction, starting at the position immediately above the position of the frog, as shown below.\n\n                    \n                    \t\n                    \t\n                    \t\t8\n                            1 \n                            2\n                        \n                    \n                    \t\t7\n                            frog \n                            3\n                        \n\n                    \t\t\n                    \t\t6\n                            5 \n                            4\n                        \n                    \t\n                    \n\n                    Your task is given an instance of a lake, marked on each of their positions with the pattern of frog jumps, check if this, when placed in the upper left corner of the lake, run all their positions.","id":"1824","category":"Ad-Hoc","statistics":{"level":"9 / 10","submissions":199,"solved":60,"ratio":"30.15%"}}