{"output":"For each scenery, you'll have to write one line on the output file, with one of the following contents:\n\n\n\tIf the ant dies, write \"Dead...\"\n\tOn the contrary, write:\n\t\n\t\tThe percentage of food eaten during the travel. It should be written using three digits followed by the % sign, if there aren't enough digits, spaces should replace the missing digits. The percentage should be rounded to the nearest integer, in case of a tie it should be rounded down;\n\t\tThe amount of bumps the ant made on the walls of the testing area - It should be written with 10 digits, if there aren't enough digits, spaces should replace the missing digits;\n\t\tThe door through which the ant escaped the testing area.\n\t\n\t\n\n\nThe following image is related to the sample input/output:","input":"The input consists of a series of sceneries. For each scenery will be provided, in one line, the measurements of the rectangle, first the width M (North - West) and then the height N (North - East) (0 < m,n ≤ 100.000), the door though which the ant was inserted. A line containing a value of 0 for one of the rectangle's dimensions signals the end of the input.","level":6,"name":"Anting","has_images":true,"description":"A group of crazy scientists from PSGA (Pindamonhangaba's Science and Gymnastics Academy) is studying the behavior of an odd spiecies of blind ants. After years of research, they concluded that:\n\n                \n                \tThese ants can only travel a straight path and their walking behavior is similar than that of the light. That is, whenever an ant hits a wall it \"relfects\" (as would a light beam when hitting a flat mirror) in such a way that the reflection angle is equal to the incidence angle;\n                \tThese ants only stop when encountering food and keep on moving the same way after it's eaten;\n                \tThe maximum an ant can travel without eating is 2 meters.\n                \n\n                In order to prove these conclusions, the scientists built a series of sceneries to test the ants. Each scenery consists of a rectangle with dimensions of M x N meters. Each scenery has four entries, located on each of the vertices, that from now on shall be called by one of the cardinal points, as follows:\n\n                \n\n                Inside the rectangle, MN amounts of food were distributed in the center of each of the 1m x 1m squares contained in the scenery. The ants are inserted into each scenery through one of the four possible entries in a path that makes a 45 degrees angle with both sides of the rectangle conected in that vertex. After walking aproximately 0.707m an ant encounters its first meal and continues following a straight line after eating it until one of the following happens:\n\n                \n                \tThe ant hits a wall, in which case its path is reflected. The resulting path still has an angle of 45 degrees;\n                \tThe ant travels more than 2 meters and finds no food, in which case the poor thing dies...;\n                \tThe ant encounters a door, in which case it goes out of the testing area and the experiment ends.\n                \n\n                Your mission is to write a program that predicts what's going to happen with the testing ant in each of the sceneries.\n                The input/output should be written in portuguese. North = Norte, South = Sul, Oeste = West, Leste = East.","id":"1825","category":"Computational Geometry","statistics":{"level":"6 / 10","submissions":34,"solved":14,"ratio":"41.18%"}}