{"output":"For each test case your program must output a single line \n        with the following message: \"Caso #t: R\", \n        where t is the test case number and R is \n        Sheldon's reaction to the outcome: \n        \"Bazinga!\", \"Raj trapaceou!\", or \"De novo!\".","input":"The first line contains an integer T\n        (T ≤ 100) indicating the number of test cases.\n        Each test case is described using one line. The line contains\n        Sheldon and Raj options, separated by one blank space.\n        The possible options are: pedra, papel, tesoura, lagarto e Spock \n        (rock, paper, scissors, lizard and Spock).","level":2,"name":"Bazinga!","has_images":false,"description":"In the 8th episode of Big Bang Theory's second season,\n        The Lizard-Spock Expansion, Sheldon and Raj are arguing\n        about what is the best: the movie Saturn 3 or the TV show \n        Deep Space 9. Raj suggests rock-paper-scissors to settle \n        down the dispute.\n        However, Sheldon says \"Ooh, I don't think so. No, anectodal evidence \n        suggests that in the game of rock-paper-scissors, players familiar with         each other will tie 75 to 80% of the time due to the limited number of \n        outcomes. I suggest rock-paper-scissors-lizard-Spock\".\nThe rules of the game are:\n        scissors cuts paper;paper covers rock;rock crushes lizard;lizard poisons Spock;Spock smashes scissors;scissors decapitates lizard;lizard eats paper;paper disproves Spock;Spock vaporizes rock;rock crushes scissors.\nBoth choosed Spock and the game tied. However, it isn't hard to realize \n        what would happened if the game had continued. In the case of Sheldon's\n        victory, he would've\n        said: \"Bazinga!\"; if Raj had won, Sheldon would declare: \"Raj\n        trapaceou!\" (\"Raj cheated\" in portuguese); in ties, he would\n        request a new game: \"De novo!\" (\"Again!\", in portuguese).\n        Given the options chosen by both, make a program that prints \n        Sheldon reaction to the outcome.","id":"1828","category":"Beginner","statistics":{"level":"2 / 10","submissions":15348,"solved":7384,"ratio":"48.11%"}}