{"output":"The first line of the output must be the message\n        \"Campeao: C!\", where C is the champion, or the\n        message \"A competicao terminou empatada!\", if the game was a tie.\nAfter the initial message, for each round played must be printed the\n        message \"Rodada #r: V foi o\n        vencedor\", where r is the round number (the couting starts\n        on one) and V is the winner of the round r.\nAny printed message must be followed by a newline character.","input":"The first line contains an integer N \n        (N ≤ 1.000), indicating the number of rounds played.\n Each round is described by two lines: the first contains Lucas's\n        exponential, in the form a^b\n        (2 ≤ a, b ≤ 10.000); the second contains Pedro's\n        factorial, in the form n! (2 ≤ n ≤ \n        10.000).  \n        The numbers a, b, n are integers and the expression\n        a^b means \"a raised to the\n        b-th power\".","level":6,"name":"Biggest Number Game","has_images":true,"description":"Lucas and Pedro are high school friends. They were really impressed\n        after a math class that introduced factorial numbers:       \n\t\t  \n        where n is a natural number and 0! = 1. \n        They have a question: what is the operation that produces the biggest \n        number, factorial or exponential?\nTrying to find out the answer, both proposed the Biggest Number\n        Game. In this game, two players call, at same time, as fast as they can,\n        an operation that results in a big number. The player that calls\n        the operation that results in the biggest number is the winner. Beto, \n        friend of both, was the judge:\n        he wrote down the operations. Lucas only called exponentials and\n        Pedro only called factorials.\nAt the end of game, none of the three friends could tell who was \n        the winner. Write a program that helps them to decide who won each round\n        and who was the champion (the player that won most rounds).","id":"1829","category":"Mathematics","statistics":{"level":"6 / 10","submissions":1476,"solved":462,"ratio":"31.30%"}}