{"output":"For each case the following message must be printed: \n        \"Caso #t: N laranja(s)\", where t is\n        the test case number (the counting starts with one) and\n        N is the total of oranges. If there are more \n        than one solution to the problem, you must choose the smallest positive \n        integer solution.","input":"The input consist of a series of test cases. Each test case is\n        composed by three lines. Each line informs the number of unpacked \n        oranges ri (0 ≤ ri <\n        Li) and the number of oranges per sack\n        Li (2 ≤ Li ≤ 1000), separated by a single\n        space, with i = 1, 2, 3.\n        You may assume that Li and ri are co-prime\n        integers (there isn't other positive common divisor between \n        L1, L2, L3 than one).","level":8,"name":"Hard Day At Work","has_images":false,"description":"José works selling oranges. He has a team of employees that\n        packs the oranges in sacks for sale and distribution. Each sack has the same\n        number of oranges.\nHe hired new employees to match the raise in production. In the\n        first day, the newcomers packed 5 oranges in each sack, and 2 oranges\n        remained unpacked. The team didn't know that the number of oranges per\n        sack was changed to 7: the work was redone, and the repacked \n        sacks now have 7 oranges each. In the end 3 oranges were left \n        unpacked.\nJosé checked the sacks before sending them to the trucks and noted \n        that the employees forgot the New Year promotion where each sack \n        must contain 9 oranges. Once again the work was redone, and this\n        time there were no leftovers.\nAfter the trucks departure the team of workers realized that one\n        more mistake was made: nobody counted the total of oranges packed  \n        nor the number of sacks sent! Before telling José the new \n        mistake, one of them suggested that is possible deduce the missing \n        information using only the known facts.\nCan you write a software that helps the workers in this hard\n        working day?","id":"1831","category":"Mathematics","statistics":{"level":"8 / 10","submissions":324,"solved":95,"ratio":"29.32%"}}