{"output":"For each test case the following message  must be printed:\n        \"Caso #t: R$ C\", where t is the test\n        case number (the counting starts with one) and C is\n        the service bill, with two decimal places (representing the cents),\n        without thousands separator and with a comma separating reals from\n        cents.\nEach message must be followed by a newline character.","input":"The input consists in T (T ≤ 1.000) test \n        cases, and the value of T is informed in the first line.\nEach test case is composed by five lines: the first one contains the\n        value  R (1 ≤ R ≤ 10) that the company\n        charges for a minute of work. The second line indicates the number\n        M (0 ≤ M ≤ 100) of lamps misplaced in the\n        sequence, and the M colors of this sequence are informed in\n        the follow line, separated by single spaces, in the case of \n        M greater than zero. This colors are strings of \n        S (1 ≤ S ≤ 50) characters and there is,\n        in the most, 20 different colors in each test case.\nThe last two lines of the input contains the number\n        N (0 ≤ N ≤ 100) of lamps in the desired\n        sequence and the N colors that compose this sequence.","level":8,"name":"Christmas Decoration","has_images":false,"description":"Maria tried to install the Christmas decoration in her shop, but\n        failed to put in the lamps in the desired order. She decided to hire a\n        specialized company to finish the work: put N colored lamps\n        in the desired order, correcting the M lamps already \n        placed.\nThe company has an employee that works quick and precisely, and\n        bill the service for the time that the employee have spend working\n        in a optimal manner. The employee takes 30 seconds to remove an \n        installed\n        lamp, one minute to change an installed lamp for another lamp with a \n        different color, and two and a half minutes to insert a new lamp in the\n        supporting wire (this operation takes longer because it's necessary\n        to put a new socket in the electric wires).\nGiven the value that the company asks for a minute of work, in reals,\n        the desired sequence of N lamps and the sequence of \n        M misplaced lamps, compute the service bill, em reals.","id":"1833","category":"Paradigms","statistics":{"level":"8 / 10","submissions":342,"solved":110,"ratio":"32.16%"}}