{"output":"The printed report has several lines. The first line contains the\n        message \"Relatorio Vogon #35987-2\". The follow line must be the \n        message \"Distancia entre referencias: d anos-luz\", \n        where d is the distance between the two reference points,\n        in light-years, with two decimal places.\nIn the next line must be printed the message \"Setor Oeste:\" and, in\n        the next two lines, the messages \"P planeta(s)\" and\n        \"H bilhao(oes) de habitante(s)\", where P is the\n        number of the planets located in the left from the road (when traveled\n        from first to second reference point) and \n        H is the total of inhabitants from these planets.\n        In the same way, must be printed three similar messages in reference to\n        the \"Setor Leste\", the right side of the road.\nFinally, must be printed, in the last line, the message \n        \"Casualidades: P planeta(s)\", where P is the \n        number of planets that were in the road line and, naturally, have to\n        be destroyed by the vogons.","input":"The first line of the input contains the coordinates\n        X1, Y1, X2, Y2 (-10.000 ≤ Xi, Yi ≤ \n        10.000) of the two reference points P1 and P2,\n        separated by a single space. The coordinates are integers and the \n        distance unit is the light-year.\nThe second line contains the number N (1 ≤ \n        N ≤ 1.000) of the planets that belong to the spatial \n        sector that the road crosses. The next N lines consist in\n        the coordinates X and Y (-10.000 ≤ \n        X, Y ≤ 10.000) and the number (in billions) of \n        inhabitants H (1 ≤ H ≤ 100.000) of each\n        planet. These values are integers separated by a single space.","level":6,"name":"Vogons!","has_images":false,"description":"According to the Douglas Adams's \"Hitchhiker's Guide to the Galaxy\",         the vogons are an alien race that inhabits the Vogosphere. In the author\n        words:\n\"Here is what to do if you want to get a lift from a Vogon: \n        forget it. They are one of the most unpleasant races in the Galaxy. Not         actually evil, but bad-tempered, bureaucratic, officious and callous. \n        They wouldn't even lift a finger to save their own grandmothers from \n        the Ravenous Bugblatter Beast of Traal without orders - signed in \n        triplicate, sent in, sent back, queried, lost, found, subjected to \n        public inquiry, lost again, and finally buried in soft peat for three \n        months and recycled as firelighters. The best way to get a drink out of         a Vogon is to stick your finger down his throat, and the best way to \n        irritate him is to feed his grandmother to the Ravenous Bugblatter \n        Beast of Traal. On no account should you allow a Vogon to read poetry \n        at you.\"\nIn the book, the vogons were responsible for Earth's destruction. The\n        cause was simple: the planet was in the route of the new intergalactic\n        autobahn. This is the typical vogon's way of life: too many races and\n        several planets were destroyed to ease the intergalactic traffic.\nGiven two reference points that the new road must cross in a\n        straight line and the coordinates and population of each planet in \n        the spacial sector, write a program that generates a building\n        report for the vogons.","id":"1834","category":"Computational Geometry","statistics":{"level":"6 / 10","submissions":622,"solved":269,"ratio":"43.25%"}}