{"output":"For each test case must be printed the message\n        \"Caso #t: ainda falta(m) E estrada(s)\" or the\n        message \"Caso #t: a promessa foi cumprida\" (if the promise\n        was fulfilled), where t is the test case number\n        and E is the minimum number of roads that must be constructed\n        to honor the mayor promise.\nEach message must be followed bye a newline character.","input":"The input consists in a series of test cases. The number\n        T (T ≤ 100) of test cases is given in the \n        first line of the input.\nEach test case is composed by several lines. The first two lines\n        contains, respectively, the values of\n        N (1 ≤ N ≤ 100) and M \n        (0 ≤ M ≤ N(N - 1)/2), where \n        N is the number of main spots of the city and \n        M is the number of roads completed by the mayor. \n        The main spots are identified by a sequence of integer numbers that\n        starts with number one.\nThe following M lines contains pairs of values \n        X and Y \n        (1 ≤ X, Y ≤ N) that represents a\n        road that connects the point X to the point\n        Y.","level":4,"name":"Campaign's Promise","has_images":false,"description":"In the electoral campaign, the mayor of the Barro Bravo made a \n        promise: until the end of his mandate, the citizens would be able to\n        travel between the city's main spots with no need of drive off-road \n        (in the beginning of his term, this wasn't possible...).\nThe first resolution he took was to finish the partially build roads\n        that had been started but not completed.\n        At the end of these works, with a reduced budget, the mayor wished to\n        know if the promise was accomplished or not, and if not, how many\n        roads must still be constructed to honor his word.\nWrite a program that helps the mayor to find the desired \n        information.","id":"1835","category":"Graph","statistics":{"level":"4 / 10","submissions":1741,"solved":870,"ratio":"49.97%"}}