{"output":"For each test case the output is formed by five messages, one per\n        line: \n        Caso #t: P nivel LHP: HPCAT: ATCDF: DFCSP: SPC\n        where P is the pokémon's name, L the level and\n        SC the attribute value for level L, according to\n        given expressions, and t is the test case number.","input":"The input consists of a series of test cases. The number of test\n        cases T (T ≤ 1.000) is given in the first \n        line of the input.\nEach test case is composed by five lines. The first one contains\n        the pokémon name P and its level L (1 ≤ \n        L ≤ 99), separated by a single space. The pokémon's name\n        has only alphanumeric characteres.\nThe following lines have three integers each:\n        BS\n        (1 ≤ BS ≤ 255), IV (1 ≤ IV\n        ≤ 15) e EV (1 ≤ EV ≤ 262.140), \n        separated by a single space, for each one of the attributes, in this\n        order: HP, AT, DF e SP.","level":2,"name":"Pokémon!","has_images":true,"description":"In the first generation, the creatures from the Pokémon\n        game have four basic attributes: hit points (HP), attack (AT), defense\n        (DF) and speed (SP). These attributes increased as the pokémon gained\n        experience levels winning battles or using special itens.\nFor each level (from 1 to 99) the value of the attributes can be\n        computed by the following expressions:\n          \n\t    e \n\t    \n        where BS is the base value of the attribute (hit points, \n        attack, defense and speed), EV is the effort value of the\n        pokémon (it depends on what and how many battles the pokémon entered),\n        IV is the individual value of the pokémon in the given\n        attribute (it is the pokémon \"gene\") and L is the level.\nThe EV and IV values differentiate two pokémons\n        of same kind, making both evolutions differ. Each attribute must have a\n        integer value: the decimal value must be discarded after the \n        fraction computation.\nGiven a pokémon, its basic attributes values and level, compute\n        the attributes values according to the expressions.","id":"1836","category":"Ad-Hoc","statistics":{"level":"2 / 10","submissions":1625,"solved":1024,"ratio":"63.02%"}}