{"output":"Print N lines. Each line must contain two strings Ci and Dj, meaning that children Ci must own the direwolf Dj. Print the children in the same order they are described in the input.","input":"The first line contains the integer N (1ʲ Nʲ 200). The next N lines describe Ned's children. Each line contains N+1 strings. The first one is the name of the children. The next N strings consists on the name of the pups in order of preference, with the first pup given in the line being the children's most preferable. The next N lines describe the direwolf pups. Each line contains the name of the pup and its lists of children, also in order of preference.\n\nEach string contains at most 10 lowercase and/or uppercase English letters.","level":6,"name":"Stark Direwolves","has_images":false,"description":"Jon: \"Lord Stark? There are five pups, one for each of the Stark children. The direwolf is the sigil of your House. They were meant to have them.\"\n\nDuring a trip, Ned Stark found N direwolf pups and decided to give each pup to one of his N children. Ned wants to make both his children and the direwolves happy, so he wants to find the ideal assignment of children and direwolves.\nAfter playing with the pups for a while, each children gave Ned a list of pups in order of preference, i.e., each children wants to have the pup which is on the top of his/her list; if this is not possible, the children wants the pup which appears second in the list, and so on.\nAfter observing how each direwolf reacts to each children, Ned also deduced, for each direwolf, the list of children it wants to be its owner, also in order of preference.\nNed must find an assignment such that, for any children Ci and any direwolf Dj, it does not happen that Ci prefers Dj over his direwolf and Dj prefers Ci over its owner. If there is more than one possible assignment, Ned wants the assignment such that each children has the best (most preferable) pup he/she can have.","id":"1852","category":"Paradigms","statistics":{"level":"6 / 10","submissions":104,"solved":64,"ratio":"61.54%"}}