{"output":"For each test case output if the balloon has passed unscathed , the word \" OUT\" , then the position of the column from which it came out in the end; and if it has broken out along the way , the word \" BOOM \" and in which row and column the same burst .","input":"There will be several test cases . Each test case begins with three integers , L, C and P ( 1 ≤ L ≤ C ≤ P ≤ 9 ), indicating the amount of L lines and C columns of the matrix P and the position of the column to which the balloon will be released .\n\n\t\t\t\t\tThe last test case is indicated when L = C = P = 0 , and this case should not be processed.","level":2,"name":"Fans and Balloons","has_images":true,"description":"On holiday, the company employed manufacturer fans Doe brothers, better known as IF, proposed a contest. Given a rectangular box of large dimensions, formed by compartments containing only the front and rear wall, with all the internally accessible compartments, small fans, yet powerful, and without the protective grid, were tied internally in the enclosure, some compartments . After this, a balloon is released inside the box on the line of a particular column compartments. Each fan is connected with a certain level of strength. Then, it is checked as close to the fan left and right balloon. If both are at the same level of force, the balloon typically continues downward. If different, the balloon will be pushed to the side of the fan with the weak level, and it will shift as many columns as the difference between the highest and the lowest among the fans. Take the case below in detail:\n\n\t\t\t\t\t\n\t\t\t\t\t\tLoose balloon in column 6;\n\t\t\t\t\t\tIn the first row, closest to the right balloon blower has more than two levels closest to the left, displacing the balloon 4 to the column;\n\t\t\t\t\t\tIn the second row, closest to the right balloon blower has more than two levels closest to the left, displacing the balloon to column 2;\n\t\t\t\t\t\tIn the third row, closest to the right balloon fan has the same level in relation to the nearest left, keeping the flask in column 2;\n\t\t\t\t\t\tOn the fourth line, closest to the right of the balloon fan has two levels unless the closest the left, moving the balloon to the column 4, leaving without blowing;\n\t\t\t\t\t\n\n\t\t\t\t\tIf, in the same box, the flask was released in column 2, the balloon would burst on line 1 and column 1, the fan blades lying in this location.\n\n\t\t\t\t\t\n\t\t\t\t\t                \t\t\t\n\n\t\t\t\t\tWrite a program that, given a matrix, representing cash and a column in which the balloon will be released, and make sure it goes through all the fans without blowing.","id":"1870","category":"Ad-Hoc","statistics":{"level":"2 / 10","submissions":553,"solved":378,"ratio":"68.35%"}}