{"output":"For each test case, print the line \"Lucky Denis!\" if the function can be used by Denis, or \"Try again later, Denis...\" otherwise.","input":"The input consists of several test cases and ends with end of file.\n\n\t\t\t\t\tThe first line of a test case consists of two integers N and M, which are respectively the number of contests made by Denis and the number of students that will compete in each contest, where 1 ≤ N ≤ 3 and 1 ≤ M ≤ 10.\n\n\t\t\t\t\tFollowing are given N integers c1, c2, ..., cN, the coefficients of the Denis' function, where ci ≥ 1 for all i.\n\n\t\t\t\t\tIn a test case, is guaranteed that the values of Denis' function are at most 109.","level":3,"name":"Contests in Sequence","has_images":false,"description":"Denis is a very fair competitive programming teacher. In a discipline, he makes N programming contests to evaluate his M students. The last Denis' idea is to reward the three students with the best results in the contests. For this, Denis had the idea to create the following rank function.\n\n\t\t\t\t\tf(T1,T2,...,TN) = c1T1 + c2T2 + ... + cNTN\n\n\t\t\t\t\tIn this function, the N-tuple (T1,T2,...,TN) indicates the rank positions of a single student in the N contests. For example, if there are two contests, a student gets the third place in the first contest and first place in the second contest, his ordered pair is (3, 1).\n\t\t\t\t\tAs Denis wants to be as fair as possible, he doesn't wants to exist possibility of tie. As he is also lazy for trying to prove that his function is free of ties, he asked your help to write a program that, given the coefficients c1, c2, ..., cN, determines whether the function can actually be used for ranking. In other words, if the function won't give equal scores to different students.\n\t\t\t\t\tNote that the software used by Denis to rank his students in a contest is free of ties. In other words, it's not possible that two students get the first place in a same contest, or the second place, etc.","id":"1878","category":"Paradigms","statistics":{"level":"3 / 10","submissions":736,"solved":379,"ratio":"51.49%"}}