{"output":"For each instance, print a single line containing a single character. Print 'Y' if its possible to do the lotery; otherwise, print 'N'.","input":"The input is composed of many instances. The first line of the input contains an integer T which indicates the number of instances.\n\nEach instance is composed by 2 lines. The first one contains 2 integers, N (1 ≤ N ≤ 1018) and K (0 ≤ K ≤ 105), that represent the number of persons and the number of dice, respectively. The second line contains K integers. The i-th integer, say fi (1 ≤ fi ≤ 1018), represents the number of faces of the i-th die.","level":7,"name":"Thai Lotery","has_images":false,"description":"Borommarachathirat IV (สมเด็จพระบรมราชาธิราชที่ 4) was a ruler of the Ayutthaya Kingdom in the 16th century. Borommarachathirat IV decided to create a lottery for his subjects using dice. These are traditional Thai dice and they may have several faces, where each face is rolled with the same probability.\n\nThe ruler demands the lottery to be perfectly fair, that is, each of his subjects must have the same probability of winning. The lottery consists of a finite number of rounds of dice rolls and, after each round, it is either decided that there is a winner or that more rounds are required. The dice rolls must follows the following rules:\n\n\n\tseveral dice may be rolled at the same round;\n\tprevious rounds may affect the choice of dice in the next rounds;\n\tthe same dice can be rolled in multiple rounds.\n\n\nIt is imperative to ensure that each subject has the same chance of winning the lottery. Notice that this is not always possible. For instance, if there are 5 subjects and a single 6-face die, then it is impossible to have a fair lottery. On the other hand, with such a die one can have a fair lottery if the population size is 3, 6, 18, or 36 people, and so on.\n\nYour task in this problem is to write a program to help the ruler decide if it is possible to have a fair lottery with the available dice.","id":"1885","category":"Ad-Hoc","statistics":{"level":"7 / 10","submissions":105,"solved":35,"ratio":"33.33%"}}