{"output":"For each instance, print a single line with the minimum number of guards needed to have all royal temples under surveillance.","input":"The input is composed of many instances. The first line of the input contains an integer T which indicates the number of instances.\n\nEach instance spans several input lines. The first line has two integers, N (1 ≤ N ≤ 103) and M (1 ≤ M ≤ 5*103), the number of royal temples and the number of streets joining temples, respectively. Each temple is represented by an integer between 1 and N. The next M lines describe the streets. Each street is represented by two integers, corresponding to the temples it joins.","level":6,"name":"Protecting the Temples","has_images":false,"description":"There are thousands of Buddhist temples in Thailand, known as \"wat\". Some of them, such as the \"Wat Phra Kaew\" in Bangkok's Grand Palace, are specially regarded for their importance and they're called royal temples. The \"Wat Phra Kaew\" is famous for housing the Emerald Buddha statue, a national treasure. In 2016, the ACM ICPC World Finals will take place in Phuket, Thailand, and so increased tourism is expected in this city. The authorities in Phuket thus want to improve security in its royal temples.\n\nPhuket's Security Unit (PSU) hired the researcher Lua \"the ingenious\" Kuratowski. PSU needs to solve the following problem. Given N royal temples and M streets connecting them, they must position guards at these streets so that every royal temple can be under surveillance. They consider a temple as secured if there is a guard in at least one of the streets ending at the temple. Streets were laid out so that one can reach any temple from any other. Moreover, due to a cultural dislike of odd numbers, any time someone starts a walk at a temple and returns to it, the number of streets traversed is always even.\n\nLua knows you wish to advance to the World Finals next year, and she considers this to be a good test for your skills. She challenges you to find a solution with the minimum number of guards.","id":"1886","category":"Ad-Hoc","statistics":{"level":"6 / 10","submissions":231,"solved":119,"ratio":"51.52%"}}