{"output":"The expected output consist of two rows. The first row is the minimum cost of the tree. The second row is a genetic sequence of the individual of index (N*2)-1, that is always the root of the tree.","input":"The input consists of multiple rows. The first row has 2 integers N (3 ≤ N ≤ 10000) and L (1 ≤ L ≤ 1000), representing the amount of species and the length of the codes, respectively. The N following rows have the genetic sequence of the individuals of the leaves (1, …, N). The following (N-1)*2 rows have two integers A (1 ≤ A ≤ (N*2)-1) and B (1 ≤ B ≤ (N*2)-1) representing the existence of a connection between the individual of index A and the individual of index B.","level":10,"name":"Phylogeny","has_images":true,"description":"Bino is a naturalist, and he traveled to the planet Binox because he want to study the phylogeny of the living creatures of this planet. Bino succeed drew the phylogenetic trees of living creatures of the planet Binox. However, he need your help to determine the lowest amount of possible evolutive changes that occurred between the direct descendants in the tree.\n\n\t\t\t\t\tComputationally, the phylogenetic trees are represented by binary trees, where the leaves are individuals known and their internal nodes and the root are the hypothetical ancestors, which in general we don't have any genetic information about it. Therefore, Bino will provide a tree topology and the genetic code of the individuals represented by the leaves. The genetic code of the living creatures of Binox is a sequence of lowercase letters.\n\n\t\t\t\t\tAs Bino will provide only the genetic codes of the individuals, which are represented by the leaves. Your task is infer the genetic codes of the individuals represented by the other nodes. Your inference have to minimize the amount of changes between the codes of the individuals directly connected. The following images show the initial setup and two possible final setups for the tree of the first case:\n\n\t\t\t\t\t\n\n\t\t\t\t\tThe total cost of the final tree is calculated comparing all the positions of the genetic code of individuals directly connected. For each difference, the cost is incremented by 1. For example, for the final tree of the first case is:\n\n\nThe initial cost is 0\n\n\n\t\n\tThe connection between 1 (“ac”) and 4 (“aa”): 'c' ≠ 'a' (cost + 1).\n\t\n\t\n\tThe connection between 2 (“ba”) and 4 (“aa”): 'b' ≠ 'a' (cost + 1).\n\t\n\t\n\tThe connection between 3 (“ab”) and 5 (“aa”): 'b' ≠ 'a' (cost + 1).\n\t\n\t\n\tThe connection between 4 (“aa”) and 5 (“aa”): “aa” = “aa”.\n\t\n\t\n\tThe total cost is 3.\n\t\n\n\nBoth inferred trees have total cost 3. However, Bino want the tree with the lowest possible cost and that the root has the lowest lexicographical possible value for that cost. Therefore, Bino chooses the tree with root code \"aa\".\n\nIt is guaranteed that all the leaves do not have children and that everyone else has exactly two children.","id":"1894","category":"Graph","statistics":{"level":"10 / 10","submissions":104,"solved":21,"ratio":"20.19%"}}