{"output":"Your program should produce a line containing an integer, the largest total amount of points you can accumulate.","input":"The first line of input contains the number of letters N (2 ≤ N ≤ 50000, N is even). The second line of input contains N whole Ci indicating which number is noted on the chart at position i (1 ≤ Ci ≤ N / 2 for 1 ≤  i  ≤ N ). The cards are given in ascending order of positions: the first letter occupies the position 1, the second position 2, and so on to the last letter, which occupies the position N. Each of the N - 1 following lines contains two numbers A and B, indicating that there is a line drawn between the cards in positions A and B (1 ≤ A ≤  N  and 1 ≤ B ≤ N).","level":7,"name":"Memory Game","has_images":true,"description":"Peter and Paul decided to complicate somewhat the traditional Memory Game, where players must flip two identical cards. They put N Card on the ground, face-down. The face of each card has a picture of a number of 1 to N / 2, and exactly two cards have a picture of each number from 1 to N / 2. As the cards are face-down, they can also be identified by their positions, which are integers from 1 to N. Peter and Paul then drawing down, using chalk, some even lines calling cards so that for any pair of cards (A, B) there is one and only one sequence designed letters and lines takes A to B. The figure below shows an example of game, (a) with all the cards face-down, and (b) with all the cards face-up.\n\t\t\t\t\t   \n\t\t\t\t\tThe game is played with all the cards face-down. With each shot, a player must choose a pair of cards A and B. If the faces of the two letters chosen have the same figure, the player accumulates a number of points equal to the number of drawn lines that exist in the path between the letters A and B. Peter and Paul now are studying which is the best strategy for this game and need your help to solve a specific task: given the existing letters in each position, and the links drawn with chalk, calculate the highest total of points you can accumulate.","id":"1928","category":"Graph","statistics":{"level":"7 / 10","submissions":1107,"solved":450,"ratio":"40.65%"}}