{"output":"For each test case, your program must produce one line for each variable of the puzzle, containing the name of the variable and its integer value. The variables should be produced in ascending alphabetical order; in other words, respecting order\n\t\t\t\t\t  aa, ab, . . . , az, ba, bb, . . . , za, zb, . . . , zz.","input":"The input consists of several test cases. The first line of each test case contains two integers L (1 ≤ L ≤ 100) and C (1 ≤ C ≤ 100) indicating the number of lines and the number of columns in the puzzle. Each of the next L lines contains C names of variables, followed by an integer S, the sum of\n\t\t\t\t\tthe variables in that line (−108 ≤ S ≤ 108). The last line contains C integers Xi (−108 ≤ Xi ≤ 108), indicating respectively the sum of the variables in column i. The names of the variables are formed by exaclty two lower case letters, from ‘a’ to ‘z’. All puzzles have a unique solution, in which all variables are integer numbers between −106 and 106.","level":6,"name":"Puzzle","has_images":true,"description":"Recent discussions in the Internet caused a renewed interest in logical puzzles. In this problem your task is to write a program that solves puzzles as the one shown in the figure\tbelow. In this kind of puzzle, the letters inside the grid represent variables, and the numbers represent the sum of the values of the variables in each line or column.\n\t\t\t\t\t\n\t\t\t\t\tThe objective of this type of puzzle is to determine the value of each variable so that the sum of the lines and columns shown is satisfied. But as this type of puzzle is intended for kids, it has a property that makes it easier to solve: it is always possible to find a line or column which\n\t\t\t\t\tcontains only one variable whose value is not yet known. So, one way to solve the problem is to proceed step by step, finding the value of one variable at each step.\n\t\t\t\t\tGiven a puzzle, you need to determine the values of the variables that will solve it.","id":"1934","category":"Ad-Hoc","statistics":{"level":"6 / 10","submissions":644,"solved":296,"ratio":"45.96%"}}