{"output":"Print a line containing singly o.o if the circuit described in the input is valid or u.u otherwise.","input":"The input contains the description of a circuit C, which is intended to be validated. The first input line consists of three integers, I, N and O (1 ≤ I, N, O ≤ 104), which represent respectively the number of inputs of C, the number of circuits published by the professor used internally in the construction of C and the number of outputs of C, so that the inputs are identified by the integers 1, …, I, the inner circuits by the integers I + 1, …, I + N, and the outputs identified by the integers I + N + 1, …, I + N + O. Each one of the next N lines describes how each one of the inner circuits is fed, following the order I + 1, …, I + N, and consists of an integer K (1 ≤ K ≤ 102), which represents the number of inputs in the inner circuit, followed by K integers, which identify the source of the signal fed in each input. The last line of the input consists of O integers, identifying the source of the signal returned by each output of C, following the order I + N + 1, …, I + N + O.\n\nThe figure below illustrates the circuit C described by the first input sample.","level":5,"name":"Circuit Validator","has_images":true,"description":"Professor Padilha asked a homework for the curricular component of Digital Circuits and now everybody is desperate! The freshers need to build a combinational circuit using only circuits from a list of circuits published by the professor. However, due to some size issues, they can barely determine whether the circuits they have built are valid, let alone decide whether they are correct. It is up to you, veteran, to write a program to validate the circuits built by the freshers. Can you help them?\n\nBy the way, according to what Professor Padilha has asked, a circuit C is valid if:\n\n\n\tfor every input of C and every output of a smaller circuit used internally in the construction of C there is at least one path to some output of C;\n\tfor every output of C there is at least a path coming from some input of C;\n\tthere are no cycles in C.\n\n\nAll circuits published by the professor have a single output each, though the circuits built by the freshers can have several outputs. It is obvious that the circuits published by the professor are all valid.","id":"1951","category":"Graph","statistics":{"level":"5 / 10","submissions":109,"solved":52,"ratio":"47.71%"}}