{"output":"Print a line containing singly the name of the woman Khan asked out.","input":"The single input line consists of five integers, C, VA, VB, T and D:\n\n\n\tC (0 < C ≤ 1000) represents the length of the road that surrounds the campus, in metres;\n\tVA and VB (0 < VA, VB ≤ 400) represent the constant speeds, in centimetres by second, at which respectively Ana and Bia run;\n\tT (0 ≤ T ≤ 200) represents the time, in minutes, between the beginning of the women's running and Khan's arrival to the obelisk;\n\tD (0 ≤ D < C) represents the distance, in metres, following the clockwise direction from the point where Ana and Bia started running to the obelisk.","level":9,"name":"The Wrath of Khan","has_images":true,"description":"Khan is a very intelligent young man who studies Computer Science at the Federal University of the Southern Border (in Portuguese: Universidade Federal da Fronteira Sul, UFFS). However, yesterday afternoon he and his girlfriend had a bad fight and ended up breaking up, which pissed him off. As he had classes at night, he decided to go to the university on foot, in order to unwind a bit. When arriving at the campus, he stopped in front of the UFFS's obelisk and instantly resolved he would not use his wrath for hatred, but for love: he would be there standing still until a woman passed by him, with whom, asking her out, he would try to rebuild his life. If more than one woman passed by him at the same time, Khan would choose the prettiest.\n\nUFFS campus in Chapecó is surrounded by a road, to which one can come through a single access road from the city of Guatambu, since the former access road has been disabled. As figure above illustrates, it is right in the intersection between the access and the surrounding road that lies the UFFS's obelisk, represented in the figure by the symbol *.\n\nAna and Bia are two friends that also study at night at UFFS. Both are very healthy, although Ana is prettiest, and both like to work out running on the surrounding road before classes, always clockwise. They always begin to run together at some point of the surrounding road, but, as they run at constant speeds which are not necessarily equal, they can separate and meet again many times during the activity. Yesterday they started running not after Khan arrived at the obelisk, and there were no more women at the campus.","id":"1964","category":"Ad-Hoc","statistics":{"level":"9 / 10","submissions":431,"solved":82,"ratio":"19.03%"}}