{"output":"For each test case you should print the minimum number of cameras required to cover the entire corridor. If it is not possible, you should print \"Tera que comprar mais cameras.\".","input":"The input contains several test cases. The first line of each test case contains three integer N, L, A (1 ≤ N ≤ 10000), respectively indicating the number of cameras present in college, the corridor width and the distance between the two walls of the hall. The following N lines containing two integers X and R (R ≥ A), indicating the position where the camera is installed and your field of view. The input ends with N = 0 and should not be processed.","level":9,"name":"Cameras","has_images":false,"description":"The computer science course coordinator want to install new cameras in a college corridor in order to be able to identify students who usually stay there in class time, so when these students are complaining that the course is difficult it, he can easily show the student that is difficult because it does not attended much the classes.\n\n\t\t\t\t\t\n\t\t\t\t\tThe cameras to be installed are of a slightly different technology, they have 360 degree view without the need to make the turn, the coordinator will install cameras in the hallway ceiling and all are exactly centered between the walls of the corridor. As these cameras are expensive and consume a lot of energy, the coordinator will have to use existing cameras in the hallway, which in saving reason were turned off, but not all are the same model, so each has a different view.\n\n\t\t\t\t\tKnowing that you're the best programmer of course, the coordinator asked you to determine the minimum number of cameras required to cover all the corridor, leaving no space without vision, or say it will have to buy more cameras.\n\n\t\t\t\t\tTake the corridor as a Cartesian plane, where the size of abscissas is L, starting at 0, and the size of ordinates is A. The cameras are always positioned on the x-axis.","id":"1978","category":"Paradigms","statistics":{"level":"9 / 10","submissions":112,"solved":41,"ratio":"36.61%"}}