{"output":"For each of the Q queries, output a line with the uppercase letter “Y” if the corresponding blood group is possible in the offspring of the given parents; otherwise output the uppercase letter “N”. Write the results in the same order that the queries appear in the input.","input":"The first line contains two integers N and Q, representing respectively the number of parents (and alleles, and antigen types) and the number of queries (1 ≤ N ≤ 100 and 1 ≤ Q ≤ 40). Each of the next N lines describes the blood group of a parent. After that, each of the next Q lines describes a blood group to test. Antigen types are identified with distinct integers from 1 to N, not letters. Each line describing a blood group contains an integer B indicating the number of antigen types in the blood group (0 ≤ B ≤ N), followed by B different integers C1, C2, ..., CB representing the antigen types present in the blood group (1 ≤ Ci ≤ N for i = 1, 2, ..., B).","level":6,"name":"Blood Groups","has_images":true,"description":"There are four possible blood groups for humans: AB, A, B and O, meaning that the red blood cells have antigens of types, respectively, A and B, only A, only B, and no antigen at all. Our blood group is determined by two alleles in our DNA. Each allele is of type either A, B or O. The following table lists the possible allele combinations someone may have for each blood group:\n\n\t\t\t\t\t\n\n\t\t\t\t\tWe inherit exactly one allele from each of our two parents. So, given the blood groups of the two parents, we can say for sure if some blood group is possible, or not, in their offspring. For example, if the blood groups of the two parents are AB and B, then the possible allele combinations for them are, respectively, {AB} and {OB,BB}. Since the order of the alleles does not matter, the possible allele combinations for the offspring are {OA,AB,OB,BB}. That means the blood groups AB, A and B are possible in their offspring, but the blood group O is not. Very nice indeed! But what if life on Earth had evolved so that a person had three parents, three alleles, and three different antigen types? The allele combinations would look like this:\n\n\t\t\t\t\t\n\n\t\t\t\t\tIf the blood groups of the three parents are A, BC and O, then all blood groups are possible in their offspring, except groups BC and ABC. The universe is vast! There may be, out there in space, some form of life whose individuals have N parents, N alleles, and N different antigen types. Given the blood groups for the N parents, and a list of Q blood groups to test, your program has to determine which ones are possible, and which ones are not, in the offspring of the given parents.","id":"2014","category":"Ad-Hoc","statistics":{"level":"6 / 10","submissions":150,"solved":77,"ratio":"51.33%"}}