{"output":"Your program must print the medal table for the Christmas Olympics Games. The first line must contain the text \"Quadro de Medalhas\". Each one of the next lines will contain the name of a country followed by the respective number of gold medals, silver medals and bronze medals that this country won, separated by a blank space. The criteria for tiebrake is the number of gold medals, followed by the number of silver and bronze medals. If two or more countries have the same number of medals (gold, silver and bronze) the listing must be by ascending order of country name.","input":"The input contains only one test case, consisting by a relation with the result of all competitions realized in the Christmas Olympics Games. Each competition or modality will contain four information lines: the first line will contain the contest description. The second line will contain the winner country in that modality. The third line will contain the vice-champion and the last line will contain the bronze medalist country. The end of input is indicated by EOF.","level":4,"name":"Christmas Olympics","has_images":false,"description":"According to the tradition, the Christmas Olympics Games are very interesting and differents. Among the existing modalities, we can mention for example, the lifting bag of toys, climbing pine trees, riding with reindeer and the throwing of elves (with and without their consent - the second modality is more dangerous), among others. Part of the improvement of the competition proposed by Claus for this year will be the availability of the medals panel of participating countries through an electronic scoreboard. You were invited to travel to the mountains of Korvatunturi in Lapland, Finland, place that will host these games, for, starting from a list of modalities and the winners countries, develop the system for this eletronic scoreboard. It will be expected almost three hundred participating countries and the competition will have at maximum 1000 types of olympic competitions.","id":"2018","category":"Data Structures and Libraries","statistics":{"level":"4 / 10","submissions":788,"solved":370,"ratio":"46.95%"}}