{"output":"For each test case print one row containing one integer, representing the maximum height of the stack if it’s possible to pile all the N gifts, or -1 otherwise.","input":"Each test case starts with an integer N, representing the number of gifts (1 ≤ N ≤ 105).\n\nFollowing there will be N rows, each containing three integers, A, B and C, representing the dimensions of the gifts, as explained on the problem statement (1 ≤ A, B, C ≤ 104).","level":8,"name":"Piling Gifts","has_images":true,"description":"Tired of managing the gifts production and calculating the minimum path to deliver them to the children on Christmas Eve, Santa decided to take a nap. When the elves realized Santa’s absence they decided to take time off from work to play a game they’ve been planning for some time.\n\nThe game the elves invented involves N gifts that they had recently made, which are in format of cubes with dimensions AxBxC, or in other words, A centimeters of width, B centimeters of height and C centimeters of depth.\n\nThe goal is simple: given the N gifts, win the game the one who can pile all the N gifts one at the top of the other building a stack of maximum height. The gifts must be piled in order, or in other words, first the gift 1 is put on the ground, then the gift 2 is piled on the top of the gift 1, and so on.\n\nIt is worth noting that it is possible to rotate the gift on any axis in a way that any of its 6 faces gets parallel to the ground, however the perimeter of such face must be completely restrained inside the perimeter of the superior face of the gift below it. In the case of the first gift it is possible to choose any face, because the ground is big enough.\n\nFor example, be N = 2, where the first gift has dimensions 5x2x2, and the second gift has dimensions 1x3x4, it is possible to position the first gift with the face of dimensions 2x2 facing down and reach a height equal to 5, however this solution makes it impossible to pile the second gift on top of the first. A possible solution would be to position the first gift with the face of dimensions 5x2 facing down, and pile the second gift with the face of dimensions 3x1 on top of the first, reaching a valid solution with height equals to 6, as can be seen on Figure 1.\n\n\n\nAfter some time playing the elves were curious on whether they reached the best solution or not, and then they asked for your help. Given the dimensions of the N gifts, check if it is possible to build a stack with the N gifts and find out its maximum height.","id":"2024","category":"Paradigms","statistics":{"level":"8 / 10","submissions":392,"solved":102,"ratio":"26.02%"}}