{"output":"Each test case output must begin with the line “Teste #i”, indicating the test case number. After this, a new line should give the least time possible (sum of the time of each lap and pit stop) of the optimal strategy to complete the Formosa GP and the minimum number of pit stops possibles to minimize this time. These two information must be separated by a space. \n\n\t\t\t\t\tAfter each test case, a blank line must be printed.","input":"The input consists of a line containing a number N (1 ≤ N ≤ 1000) indicating the number of test cases. The following N lines represent a test case. Each test case is composed by five integers:\n\n\t\t\t\t\t\n\t\t\t\t\t\tT1, the lap time in milliseconds with a new tyre (1 ≤ T1 ≤ 106).\n\t\t\t\t\t\tT2, the lap time in milliseconds with a worn tyre (1 ≤ T1 ≤ T2 ≤ 106).\n\t\t\t\t\t\tA, the time of a pit stop in milliseconds (1 ≤ A ≤ 106).\n\t\t\t\t\t\tV, the number of laps until a new tyre becomes a worn tyre (1 ≤ V ≤ 100).\n\t\t\t\t\t\tR, the number of laps of the Formosa GP (1 ≤ R ≤ 100).","level":8,"name":"Pit Stop","has_images":true,"description":"“Grazie, grazie, bellissimo!” – said a engineer of Scuderia Ferrari after an unexpected strategy which made then win the Formosa GP of 2016, famous street circuit of the Formula One calendar. \n\n\t\t\t\t\tFormula One is a bit crazy sport. Sometimes, when the tyre is worn, it is worth to make a pit stop in order to put new tyres and do faster laps. \n\n\t\t\t\t\tHowever, it is not always that making a pit stop translates into an advantage. It depends of the quantity of remaining laps and the pit stop time. \n\n\t\t\t\t\tThe tyres have a life span of few laps until being worn. Then, possibly a pit stop could be necessary in order to gain time with fresh tyres. \n\n\t\t\t\t\tAre you capable of calculating the optimal strategy as a future Ferrari engineer?","id":"2030","category":"Ad-Hoc","statistics":{"level":"8 / 10","submissions":350,"solved":102,"ratio":"29.14%"}}