{"output":"The output must be contain:\n\n\t\t\t\t\t\n\t\t\t\t\t\t“Jogador 1 venceu”: if Player 1 has won the game\n\t\t\t\t\t\t“Jogador 2 venceu”: if Player 2 has won the game\n\t\t\t\t\t\t“Ambos venceram”: if the both have won the game\n\t\t\t\t\t\t“Sem ganhador”: if there is no winner\n\t\t\t\t\t\t“Aniquilacao mutua”: if Mutual Annihilation occurs\n\t\t\t\t\t\n\n\t\t\t\t\tEach output of a test case must be in one line.","input":"The input consist of N (1 ≤ N ≤ 1000) test cases. N should be read in the first line of input. Each test case is composed of two lines each containing a string. The first string is the sign chosen by Player 1 and the second string is the sign chosen by the Player 2. These string can be:\n\n\t\t\t\t\t\n\t\t\t\t\t\t“ataque”: to represents Airstrike\n\t\t\t\t\t\t“pedra”: to represents Rock\n\t\t\t\t\t\t“papel”: tp represents Paper","level":2,"name":"Rock, Paper, Airstrike","has_images":true,"description":"Rock, Paper, Airstrike is a very popular children’s game, in which two or more children form a circle and do hand gestures in an attempt to get the victory. The rules are surprisingly complex for a children’s game, but it’s still quite popular around the world. \n\n\t\t\t\t\tThe games are very simple. Players can choose between the sign of a Rock (fist), the sign of a paper (an open palm), and the signal to the Air Attack (like the paper, but with only the thumb and little finger extended). \n\n\t\t\t\t\t\n\n\t\t\t\t\tA game with two players have the following rules to determine a winner:\n\n\t\t\t\t\t\n\t\t\t\t\t\tAirstrike vs. Rock: In this case, the player with Airstrike defeats the player with Rock for obvious reasons.\n\t\t\t\t\t\tRock vs. Paper: In this case the player with Rock defeats the one with Paper, because Rock hurts more.\n\t\t\t\t\t\tPaper vs. Airstrike: In here Airstrike wins because Airstrike always wins and Paper is pathetic.\n\t\t\t\t\t\tPaper vs. Paper: In this variation both players win because Paper is useless and no one facing Paper can lose.\n\t\t\t\t\t\tRock vs. Rock: To this case there is no winner because it depends on what the players decide to do with the Rock and usually do nothing at the end.\n\t\t\t\t\t\tAirstrike vs. Airstrike: When this happens all players lose due to Mutual Annihilation.\n\t\t\t\t\t\n\n\t\t\t\t\tYour task is to write a program that given the choice of two players tell who won the game.","id":"2031","category":"Beginner","statistics":{"level":"2 / 10","submissions":6754,"solved":3937,"ratio":"58.29%"}}