{"output":"For each test case in input, your program must produce one line of output containing if Sport' team is the champion: \"O Sport foi o campeao com X pontos :D\", being X total number of points of team. Otherwise, your program should produce this following line: \"O Sport nao foi o campeao. O time campeao foi o S com X pontos :(\", being S name of winner team and X total number of poinst of team. Leave a blank line after each test case.","input":"The input contains several test cases. The first line contains an integer N (2 ≤ N ≤ 100) representing the quantity of following teams are participating in the championship. Next, Ni lines containing the team name S and team score P until now (0 ≤ P ≤ 100). After this, will have N/2 lines containing score of each game on the last round, in format \"TeamA goalsA-goalsB TeamB\", as illustrated in the example below. The input ends with N = 0, which shouldn't be processed.","level":7,"name":"The Champion","has_images":true,"description":"Thyago is a big fan of Sport Club Recife Football Team and always follows the final of the championships when his team is playing. As games are usually at night and Thyago is busy at that time working or teaching class, he don't have time to watch the games of his favorite team and don't have time to accompany the total score of championship throughout the day and championship is in the final round. Deoclécio, who is a friend of Thyago and also very fond of football, is watching the league and annotated the score of all times so far and also the score of the final round matches.\n\nYour task is to help Deoclécio making a program that given the name of the participating teams in the league and your score so far and the score of the last game, determine which was the team champion and the final score of this team.\n\nChampionship Rules:\n\n\n\tEach goal scored worth 3 points to the team;\n\tIf teams tied the match, will be added +1 point for each team of match;\n\tTeam winner of a match wins +5 points.\n\n\nObservations:\n\n\n\tIs guaranteed there will always have a team winner of league;\n\tSport' team will always appear on test cases;\n\tWill not have score tied on final score between two or more teams after scoreboards;\n\tTeam name on input will always have 1 word only;\n\tOn input haven't team names repeated and team names don't have special characters;\n\tNone of the teams play more than once (more than one match on the same test case).","id":"2040","category":"Ad-Hoc","statistics":{"level":"7 / 10","submissions":509,"solved":167,"ratio":"32.81%"}}