{"output":"The output of each test case is a line containing only the nth number of the sequence.","input":"The input consists of several test cases. Each test case is composed of a line having an integer N, which is the nth number of the sequence to be calculated, with 0 <N <= 40.","level":5,"name":"Gödelito's Sequence","has_images":false,"description":"Gödelito is fascinated by mathematical and logical issues and spends a lot of time playing in trying to figure out the semantics behind the mathematical sequences. The most fun to Gödelito is not so much to find the next number in the sequence, but understand the axioms which determine the shape of the sequences.\n\t\t\t\t\tMany sequences are dictated by mathematical rules, for example the Fibonacci sequence whose axiom is that each number is the sum of the previous two. Other sequences involve more semantic axioms, for example the following: 2, 10, 12, 16, 17, 18, 19, 200 ... in which axiom is: numbers whose name starts with the letter D (in portuguese).\n\t\t\t\t\tGödelito is currently faced with an interesting sequence. After some time he found that the axiom of the sequence is semantic (he tried first several mathematical accounts, which only made him happier when he discovered the meaning of the sequence). The sequence is shown below:\n\n\t\t\t\t\t3\n\t\t\t\t\t13\n\t\t\t\t\t1113\n\t\t\t\t\t3113\n\t\t\t\t\t132113\n\t\t\t\t\t1113122113\n\t\t\t\t\t311311222113\n\t\t\t\t\t...\n\n\t\t\t\t\tGödelito was impressed with how this sequence grows quickly. And how do not want to spend sheets of his notebook to calculate all the numbers he wants he asked for your help to create an algorithm to find the other numbers in the sequence. But he explained to you the meaning of the sequence to make your life easier:\n\t\t\t\t\t\n\t\t\t\t\tEach sequence number is generated by reading (describing) the above, for example, the second number is 13 because the top row contains one (1) number three (3). The third number is 1113, because the top line contains one (1) number (1) and one (1) number three (3). The fourth number of the sequence is 3113, because the top row contains three (3) numbers one (1) and one (1) number three (3). I think you get the idea, right?","id":"2041","category":"Ad-Hoc","statistics":{"level":"5 / 10","submissions":597,"solved":317,"ratio":"53.10%"}}