{"output":"For each solved instance, you must print a handle Instancia h where h is an integer, and increasing sequentially from number 1. In the following m lines, you must print soldado k (for k = 1, ..., m) followed by defender or espanhol respectively if the soldier is inside or outside the fort. A blank line should separate the output of each instance.","input":"Several instances are given. Each instance starts with an integer that is the number 0 ≤ n ≤ 1000 of vertices that the fort fence has. The value 0 indicates the end of data. In the following n lines there are the coordinates of the fence posts of the fort. The posts are data from the first, following the fence clockwise. Next is the position of the flag of Texas. On the next line, the number is 0 ≤ m ≤ 1000 people to be checked. In the following m lines have the coordinates of the positions of each person. All coordinates given are integers in the range [-100000; +100000].","level":10,"name":"Defending Alamo","has_images":false,"description":"The Alamo fort, originally named Misión San Antonio de Valero, was founded by missionaries to house the priests and the converted Indians in the region that was disputed by the Americans and Spanish settlers. It was founded in the eighteenth century and served as the stage for the bloodiest battle for the emancipation of Texas. Battle of the Alamo took place on February 23, 1836 when the army of the Gal. Antonio Lopes de Sant'Anna surrounded the fort. Texans and \"Tejanos\" (called \"defenders\") defended the position for 13 days.\n\n                    The Alamo's fort was a fortification of quite intricate shape, surrounded by a high fence. Was often difficult to tell if a soldier was inside or outside the boundaries of the fort.\n\n                    Your task in this problem is, given an instance of a fort, given by the coordinates of the vertices of the fence, the coordinates of the flag of Texas, and the position of several soldiers, determine which of them are \"defenders\" and which are Spanish.","id":"2045","category":"Computational Geometry","statistics":{"level":"10 / 10","submissions":334,"solved":39,"ratio":"11.68%"}}