{"output":"At the beginning of each instance print the line Instancia k, where k is the number of the current instance. Then, for each word x in the list, print a line in the output saying x e uma palavra valida if it can be obtained from the root through the rules of composition, and x nao e uma palavra valida otherwise. Print a blank line after each instance.","input":"The input consists of several test cases. Each test follows the rules described above.\n\n                    In the first line of each test appears the root symbol, which will always be a capital letter. In the second line, the set V will be provided as a word composed of only uppercase letters. Each letter of the word will be identified as a member of V.\n\n                    The set T will be given as a word of printable characters (except for # and blank characters) in the third row. Each character of this word will be identified as a member of T. The following several lines which describe the rules of composition for the current instance will be provided.\n\n                    A composition rule as # → # indicates the end of the list of rules of composition.\n\n                    Finally, several lines are provided, each containing a word that we want to know whether or not it can be produced from the root through the rules of composition. These words will not contain any character in V and are composed of a maximum of 50 characters. The list of words ends with a line containing # in the first column.","level":6,"name":"ET Phone Home","has_images":false,"description":"Since early 2006 the Seti@home (search program of alien’s life) has recorded strange patterns in radio transmissions received from space. Initially it was believed to treat only about static. But with time and repetition transmissions researchers were becoming convinced that there was something more. Invited to join the project, linguists at Baylor University have identified a language in the transmission. It was a very simple language.\n\n                    The language has several rules of word composition. The composition rules will be described in this problem by the following elements: a set of non-terminal symbols V; a set of terminal symbols T; a special non-terminal symbol called the root; a set of rules for the composition of words.\n\n                    All rules of composition that will be considered here will be the form A → BC or of the form A → a, where A, B, C are elements of V and a is an element of T. The notation above indicates that we can replace the non-terminal A to the left of the arrow by the terminal a (the first case) or by the concatenation of non-terminals A and B (the second case) that appear to the right of the arrow.\n\n                    Repeatedly applying the rules of composition on the root symbol, we can assemble valid words in the language.\n\n                    For example, suppose the following set of composition rules is valid:\n\n                    S → AB\n\n                    A → a\n\n                    B → b\n\n                    The word ab can be obtained from this set of rules of composition as follows:\n\n                    S → AB\n\n                    AB → aB, because A → a\n\n                    aB → ab, because B → b\n\n                    However, the word b can’t be produced from S from that same set of composition rules.\n\n                    Given a set of composition rules and a list of words, your task is to determine, for each word, if it can be produced or not from the rules described in the current instance.","id":"2053","category":"Paradigms","statistics":{"level":"6 / 10","submissions":12,"solved":4,"ratio":"33.33%"}}