{"output":"For each instance, you must print an identifier \"Instancia K\", where K is the number of the current instance. On the next line, your program must print \"sim\" if the player wins this instance of the game, and \"nao\" otherwise. Print a new line between each instance.","input":"The input begins with a integer N in the first line, indicating the number of instances of the problem that your program should solve. The next N lines contain the description of the instances. Each one of these lines contain a sequence of 6 integer numbers. The i-th number of the sequence indicates how many matches still remain in the i-th row of the game. All of the sequence numbers are valid (which means that the i-th integer contains a value between 0 and the number of matches in which the i-th row starts with in the game).","level":9,"name":"Last Year at Marienbad","has_images":true,"description":"During the Cold War, the city of Marienbad in Czech Republic was immortalized by the spies who used its luxiorious hotels in exchange for information and even for rest and a holiday getaway. In this city a game became famous, \"Streichholzpiramidentfernungspiel\" as known and appreciated by the spies from both sides of Germany.\n\n                    The game starts with 6 rows of matches. The first row contains 1 match, the second contains 3, the third 5, the fourth 7, the fifth 9 and the sisth 11. Below is a design scheme of the original game.\n\n                    \n\n                    Two people participate in this game, alternating movements. In each turn, a person must take a quantity of matches different than zero from the board. All matches taken in a turn must belong to the same row. Therefore, if a row contains k matches and a player decides to take matches from this row in his turn, he has k different move options (he can take between 1 and k matches).\n\n                    If after a turn the board becomes completely empty (i.e., no matches in every one of the 6 rows), the player from the last turn (the player who removed the last matches) loses the game.\n\n                    Given the description of the board after a few turns, you have to determine if the player who is playing the next turn can win the game, assuming that his opponent is smart, thus always chooses the best possible move.","id":"2054","category":"Ad-Hoc","statistics":{"level":"9 / 10","submissions":93,"solved":26,"ratio":"27.96%"}}