{"output":"The output must consist of two lines.\nThe first one shoud be an integer V  that represents the number of favorite letters in the dog's name. The second one shoud contain the name (if there are multiple answers print the first name generated by Prant that has V favorite letters).","input":"The first line of input consists of three integers: k, m, n (1 ≤ k ≤ 26, 1 ≤ m, n ≤ 100 000). In the next two lines there will be two strings, made of only lower-case letters, of size k and m respectively. The first string consists of non-repeated letters and represents Prant's favorite letters. The second string is the dog's original name (the first name that Prant had thought).\n\nThe next n lines are composed of two characters a and b representing the letters involved in each operation made by Prant.","level":9,"name":"Prant and the Indecision","has_images":false,"description":"Prant is a very undecided boy, making choices is a very hard and stressing task for him. But Prant has a new dog and has to choose the name of the cute puppy. He has a name in mind, but as told Prant is a very undecided boy, and from time to time Prant changes the name of the dog making a letter change operation, he chooses two letters A and B, and all letters A now become letters B, and all letters B now become letters A. It's possible that some letter (A or B) is not present in the name of the dog, and also A and B can be the same letter, because Prant gets pretty nervous to choose the letters.\n\t\t\t\n\t\t\tIn order to make a decision Prant randomly chose some letters and defined them as his favorite letters (after all Prant is a very undecided boy, what better way to choose his favorite letters than randomly?) in a way that the best name for the dog is the name that has more favorite letters in it. The problem is that Prant gets very anxious to make the operations, and sometimes he makes very illogical changes in the name.\n\n\t\t\tFor instance if Prant's favorite letters are {a, e, i, o, u}, the dog's initial name is \"abccdab\" that has 2 favorite letters in it and Prant makes the following letter change operations:\n\t\t\t\t\n\t\t\t\t\tchange(c, e), then \"abccdab\" -> \"abeedab\", now the dog's name is \"abeedab\" with 4 favorite letters\n\t\t\t\t\tchange(b, i), then \"abeedab\" -> \"aieedai\", now the dog's name is \"aieedai\" with 6 favorite letters\n\t\t\t\t\tchange(a, f), then \"aieedai\" -> \"fieedfi\", now the dog's name is \"fieedfi\" with 4 favorite letters\n\t\t\t\t\tchange(d, h), then \"fieedfi\" -> \"fieehfi\", now the dog's name is \"fieehfi\" with 4 favorite letters\n\t\t\t\t\n\n\tThe best name generated by Prant was \"aieedai\", because was the name with the maximum number of favorite letters.\n\n\nYour task is given the inital name of the dog, Prant's favorite letters and the operations that were made, find the best name that Prant generated for his dog. The original name can be the answer.","id":"2064","category":"Data Structures and Libraries","statistics":{"level":"9 / 10","submissions":764,"solved":140,"ratio":"18.32%"}}