{"output":"The integer M is the smallest size of a MadSequence for the input data. Print a single line containing M and the amount of MadSequences with M size.","input":"The first line of input consists of four integers K, L1, L2 and L3 represent, respectively, the integer K and sizes of S1, S2 and S3 (1 ≤ K ≤ 20 and 1 ≤ L1, L2 and L3 ≤ 200). The second line consists of L1 integers, representing the elements of S1. The third line consists of L2 integers, representing the elements of S2. The fourth line consists of L3 integers, representing the elements of S3. Assume that all elements of the sequences S1, S2 and S3 are positive integers smaller than or equal to K.","level":9,"name":"Counting MadSequences","has_images":false,"description":"Given an integer K and 3 sequences S1, S2 and S3, we call MadSequence, a sequence consisting of positive integers smaller or equal to K and that is not subsequence of S1, S2 or S3. Remember that a subsequence is a sequence that can be derived from another sequence by deleting some elements without changing the order of the remaining elements.\nFor example, for K = 3, S1 = <1, 2, 3, 1, 2>, S2 = <2, 3, 1, 2> and S3 = <3, 1, 2, 3, 1, 2> , all possible sequences of size 1 (<1> <2> and <3>) are not MadSequences, because are subsequences of S1, S2 and S3.\n\nAnalyzing all possible sequences of length 2 for K = 3:\n\n\n\t<1, 1> is not subsequence of S2, then <1, 1> is a MadSequence;\n\t<1, 2> is subsequence of S1, S2 and S3;\n\t<1, 3> is not subsequence of S2, then <1, 3> is a MadSequence;\n\t<2, 1> is subsequence of S1, S2 and S3;\n\t<2, 2> is subsequence of S1, S2 and S3;\n\t<2, 3> is subsequence of S1, S2 and S3;\n\t<3, 1> is subsequence of S1, S2 and S3;\n\t<3, 2> is subsequence of S1, S2 and S3;\n\t<3, 3> is not subsequence of S1 and S2, then <3, 3> is a MadSequence;\n\n\nThus, the size of the smallest MadSequence, for this example, is equal to 2. We also conclude that there are 3 MadSequences of length 2.","id":"2070","category":"Ad-Hoc","statistics":{"level":"9 / 10","submissions":153,"solved":62,"ratio":"40.52%"}}