{"output":"For each instance print a line containing a single integer, the largest number of cannonballs that Anubis can topple.","input":"The input is composed of several instances. The first line of input contains an integer T indicating the number of instances.\n\n                    The first line of each instance contains an integer N, where 1 ≤ N ≤ 50, indicating the number of cannonballs. Each of the next N lines contains three integers each, xi, yi and zi, where -1000 ≤ xi, yi, zi ≤ 1000, indicating the coordinates of the i-th cannonball at the moment that Anubis can invoke their rays.\n\n                    The French have very good aim, so they sometimes shoot bullets that will cling each other to increase the damage. So, do not be surprised if there are repeated points in the input. They represent different bullets that are together. In such cases each bullet is counted separately if Anubis decides to hit them.","level":9,"name":"Anubis's Cannons","has_images":false,"description":"Anubis is worried, French soldiers are practicing archery with cannonballs into the Sphinx again! This time he will try to prevent other parts of the Sphinx have the same fate of your favorite nose.\n\n                    To stop the cannons, he can summon rays, which destroy everything they touch, including bullets from cannons. But the Egyptian gods do not already have so many followers, which limits their powers.\n\n                    Anubis may invoke the rays at certain moments of time. Luckily one of these matches with a moment that the bullets are in the air. Anubis wants to seize this chance to overthrow the largest possible number of bullets.\n\n                    It turns out that to make the invocation, Anubis need to temporarily move to our plan of existence. So he can only hit targets that are all in the same plane.\n\n                    Help Anubis bring down the largest possible number of cannonballs.","id":"2072","category":"Paradigms","statistics":{"level":"9 / 10","submissions":197,"solved":74,"ratio":"37.56%"}}