{"output":"For each instance print a line with the minimum number of passengers who must embark at a given time.","input":"Input is compound of several instances. The first instance contains an integer T for informing the number of instances.\n\n                    The first line of each instance contains two integers N and M (1 ≤ N,M ≤ 100). Each of the following M lines has the departure time of a bus. Time format is given as hh:mm (00 ≤ hh ≤ 23, 00 ≤ mm ≤ 59, hh and mm have both two digits). Each of the following N lines has a list of travel times for each of the passengers. This list is formatted as: one integer K (1 ≤ K ≤ M) followed by K times, also in the aforementioned hh:mm format and separated one another by a whitespace.","level":7,"name":"Los buses de Cartagena","has_images":false,"description":"Gabriel Garcia Marques is a Colombian writer who authors incredible stories such as \"Cién años de soledade\", \"El amor en los tiempos del cólera\" and \"Memoria de mis putas tristes\". His stories are characterized by what is known today as \"magical realism\", in the sense that real situations are explained alongside magical elements. Despite his works' content having been lauded as rich and even of cinematographic value, actual movies based upon them have deserved neither public or critical acclaim. A most recent example is the 2007 film \"Love in the Time of Cholera\".\n\n                    One of his less known works is \"Los buses de Cartagena\", which presents the story of a small bus company located in the Colombian city. Mainly due to overloading which leads to bus breakage, this company planned to reduce the number of passengers taken at every departure to a given fixed number. At the same time, it would like to keep serving all requests in a satisfactory manner.\n\n                    Each bus gets a departure time, and each passenger has a list of preferred times when he or she would take off. Passengers wish to go Medellin only, that is, no passenger plans travelling two times on the same day.\n\n                    Your task is to determine the minimal number of passengers taken at each travel while respecting the restriction that all passengers must travel via the aforementioned company.","id":"2077","category":"Data Structures and Libraries","statistics":{"level":"7 / 10","submissions":55,"solved":19,"ratio":"34.55%"}}