{"output":"For each instance print a line containing N integers which indicate how many ovens are distance at most D of the furnaces 1, 2, ..., N.","input":"The entrance is composed of several instances. The first line of input contains an integer T indicating the number of instances.\n\n                    The first row in each instance has two integers N and D (1 ≤ N, D ≤ 100000) representing the number of ovens and distance, respectively. Each of the next N lines has two integers x and y (0 ≤ x, y ≤ 100000) indicating the position of an oven.","level":5,"name":"Green Peace! World Hypocrisy!","has_images":false,"description":"Albert Arnold Gore Jr is the full name of the former vice president of the United States, Al Gore, winner of the 2007 Nobel Peace Prize for his relentless work to educate the world's population to climate change caused by man. The documentary \"An Inconvenient Truth\" Oscar winner, shows the effects of global warming on the planet's landscape and predicts a catastrophic future for humanity is the tendency to usurp the resources of the planet is not changed.\n\n                    Al Gore grew up in Washington DC since his father was a member and then a senator from Tennessee. He graduated from Harvard in 1969 and was an activist against the war in Vietnam and came to support the leader Martin Luther King in his fight against racial segregation. His role as vice president of the United States in the administration of Bill Clinton was also exceptional. Despite having had more votes than the competing Republican Party, lost the presidential election and walked away from the contest the presidency.\n\n                    One of his most important works concerns the optimal positioning of furnaces in the production of bricks. The process of manufacture of bricks is very pollutant and requires high temperature firing of clay brick in order to reach the desired consistency. The burning consumes large quantities of wood produced on farms for this purpose. Studies of Harvard University show that there is a maximum distance for positioning these ovens: if too distant, heat radiation does not allow the burning is done equally, impairing the production of bricks and also the environment. Since the ovens are positioned in the forest (which is clipped to the burning), the distances are measured using the Manhattan metric, ie the distance between two points is given by the sum of the absolute values ​​of the differences of coordinates. Your task is, given the location of various furnaces on a farm, and a distance D, determine, for each of ovens, furnaces are many distance at most D. With this information you can determine which furnaces need to be lit simultaneously without economic losses or environmental.","id":"2078","category":"Ad-Hoc","statistics":{"level":"5 / 10","submissions":43,"solved":16,"ratio":"37.21%"}}