{"output":"For each instance to print a line having the sum of link costs that must be removed.","input":"The input is composed of several instances. The first line of input contains an integer T indicating the number of instances.\n\n                    The first line of each instance contains two integers N and M (1 ≤ N ≤ 100 and 1 ≤ M ≤ N*(N-1)/2) indicating the number of machines and the number of connections, respectively. Each of the following M lines has three integers u, v and c (1 ≤ u, v ≤ N, 1 ≤ c ≤ 100) representing the existence of a link between u and v machine with cost c. Such binding can be used to travel from machine u to machine v as well from machine v to machine u.","level":9,"name":"Time Travel","has_images":false,"description":"Albert Einstein was born in Germany but was in Switzerland, working as a public official, who wrote in 1905 the work that revolutionized modern physics and made him famous. In 1921 he won the Nobel Prize in Physics for his discovery of the law of the photoelectric effect. Many find his work on the theory of relativity the most important of his career, however were not those who have rendered valuable prize.\n\n                    Einstein liked to do \"thought experiments\" to evaluate their theories. One such experiment is very famous and describes a falling elevator with a clock inside. The idea of time travel just emerging as possible, since it was discovered how to build machines that could travel at speeds greater than the speed of light. Certainly, in the not too distant future this will be possible and we may travel freely between eras and see events like the discovery of Brazil in 1500, the arrival of the Royal Family in 1808 or Corinthians champion of the Libertadores in 2962 live.\n\n                    With constant travel in time, will be important to regulate the service. Time machines are scattered throughout history and travelers will have to take them traveling to the present or the future. Due to technical restrictions of these machines, you cannot travel to any point in time directly, but only to other historical moments, where a new machine can be used to continue the trip. However, being in a historic moment, you can go to any other time traveling by one or more machines.\n\n                    Along with the time travelers will also arise Pirates History, which will try to steal treasures, reverse events and change the story with the most evil purposes. This will result in the creation of the Time Police. In the year 2850 (before Corinthians winning their first Libertadores) Police Time solves isolate historical events, disabling links between some machines. Each connection has an associated cost to be disabled, and your task is to find, given a set of historical moments, a set of links - minimum cost - which when disconnected isolate the events, i.e., being in a machine you cannot travel to some of the other machines.","id":"2082","category":"Graph","statistics":{"level":"9 / 10","submissions":249,"solved":53,"ratio":"21.29%"}}