{"output":"For each instance in the input, print a line with N integers p1, p2, ... , pN, where pk is the probability (in percentage) that, after endless rounds, the player stops at the cell k. The numbers shall be separated by spaces and shall have 3 decimal places.","input":"The input contains several instances. Each instance consists of two lines. In the first line, two integers are given, N (3 ≤ N ≤ 1000) and D (3 ≤ D ≤ 20), separated by a blank space, indicating respectively the number of cells on the board and the number of sides on the dice.\n\n                    In the second line, N integers are given a1, a2, ... aN (-1 ≤ ai ≤ N-1) separated by white spaces, which is the description of the board as explained in the previous section.\n\n                    The input ends when C = D = 0.","level":9,"name":"Monopoly","has_images":false,"description":"The Collegiate Programming Contest is an event that happens every year with the help of organizations and people who are enthusiastic about the idea of science competitions. Among the motivations for contestants of this event, there are the increase in knowledge related to algorithms (and all areas of mathematics in general), the improvement in the structure of reasoning, the improvement in typing speed and also the social network created with high level people in computing. For Unicamp competitors, however, the motivation is different. The opportunity to travel to stay in a hotel playing board games is what drives these people to participate in this event.\n\n                    In the last one there was fierce competitions of various types of games, including one called Monopoly. The object of the game is to ensure the greatest possible accumulation of capital through property speculation.\n\n                    André was one of the participants of the game and ended up losing every game for his teammate, Felipe, who was accused of witchcraft by the magnitude of victories in a game that theoretically depends only on luck and persuasion. \n\n                    One of the things for what André was angry he did not get to buy the most expensive land, while Felipe always bought them. Felipe tried to convince André that no longer practiced witchcraft for years, and he did not fall in the expensive territories because the probability was very small. \n\n                    To help Felipe to convince André of the odds on the board, you will write a program that, given a description of the board, calculate what is the probability of falling in a given cell of the board after endless rounds.\n\n                    The board is described as a sequence of N cells. The board is circular, that is, after the N-th cell, you go to the first one. Some homes are special, and immediately send you to another cell. Early in the game, everyone in the cell number 1, and each round players roll one die of D sides, which will tell the player how many cells should proceed.\n\n                    The description of the board is a sequence of N integers, each integer is:\n\n                    -1 If it is a normal cell;\n\n                    K if it is a special cell, where K is an integer representing the index of the cell where the player will be immediately sent (the index of the first cell is 0). The K-th cell is a normal one. \n\n                    For example, if the tray is described as -1 -1 0 1 -1 0, we have a board with six cells, and the first, second and fifth cells are normal. If the player lands on the third or sixth cells, it is sent immediately (in the same round) to the cell of index 0 (the first). If it falls in the fourth cell, it is sent to the cell of index 1 (the second).\n\n                    Furthermore, the amount of sides of the used die will be given, which can be between 3 and 20 sides.","id":"2105","category":"Paradigms","statistics":{"level":"undefined","submissions":-1,"solved":-1,"ratio":"undefined"}}