{"output":"For each instance, print a line containing 4 characters. The first character must be Sif the observer sees the face of the pyramid that is oposite to vertex A, and N otherwise. Analogously for the second, third and fourth characters, but relative to the vertices B, C and D respectivelly.","input":"The input is composed by various instances and ends with end of file (EOF).\n\n                    Each instance consists of 5 lines. Each line contains three integers, separated by spaces, and represent the coordinates of the points A, B, C, D and X, respectivelly, where X is the position of the observer and the other points are the vertices of the pyramid.\n\n                    All points provided have integer coordinates between -100 and 100.\n\n                    The points A, B, C and D are not coplanar.\n\n                    All points provided are distinct.\n\n                    The point X neither belong to the interior of the pyramid nor to any face of it.","level":3,"name":"The Ekaterinburg Pyramids","has_images":false,"description":"The pyramids are very frequent structures on ancient civilizations all over the world. The most famous, the Egypt ones, were built more than 2000 years before Crist's passage on Earth. Other famous pyramids are the ones from Mexico and Central America, linked to the Mayan and Aztec civilizations.\n\n                    Little known, however, are the pyramids built on the Ural mountains, near the city of Ekaterinburg. These pyramids date back to the early Christian era, and is believed to have been built by Mongolian peoples, who invaded the Europe through the Ural mountains, coming from Asia. Unlike the other known pyramids, these had triangular base. Thus, these pyramids had 4 triangular faces. Many of these pyramids were built on columns, allowing non-parallel to ground constructions and even exposing the pyramid's base.\n\n                    That was very important, because the faces of the pyramid were painted with figures representing ancient gods, mythological figures, planets and other celestial bodies and so on. Thus, at some point in the city, a citizen could see one or more faces of the pyramid. This was important to the local religion, and find a house whose window glimpsed the best faces of the pyramids was much appreciated at the time.\n\n                    Your task is, given the positions on space of a pyramid's vertices, and the position on space of an observer, determine which faces of the pyramid are visible to him, considering that there is no obstacle between the observer and the pyramid.","id":"2107","category":"Mathematics","statistics":{"level":"3 / 10","submissions":30,"solved":21,"ratio":"70.00%"}}