{"output":"For each instance, print a line containing a single integer. Print 1 if the first player wins the instance, print 2 if the second player wins or print 0 if there is a tie, even after the tiebreaker rules are applied.","input":"The input has several instances and ends with an end of file (EOF).\n\n                    Each instance is composed of three lines. The two first lines contain the description of two cards each one, separated by a blank space. The first line corresponds to the cards of the first player while the second line corresponds to the cards of the second player. The third line contains the description of the five cards on the table, also separated by blank space.\n\n                    \n                        \n                            \n                                Character\n                                Card\n                            \n                                 '2'- '9' \n                                2 - 9\n                            \n                            \n                                 'T' \n                                 10 \n                            \n                            \n                                 'J' \n                                 Jack \n                            \n                            \n                                 'Q' \n                                 Queen \n                            \n                            \n                                 'K' \n                                 King \n                            \n                            \n                                 'A' \n                                 Ace \n                            \n                            \n                                 'e' \n                                 Spades \n                            \n                            \n                                 'c' \n                                 Hearts \n                            \n                                 'o' \n                                 Diamonds \n                            \n                            \n                                 'p' \n                                 Clubs \n                            \n                        \n                    \n\n                    The description of a card is given by two characters, the first indicating the value of the card and the second its suit, according to the input sample.","level":9,"name":"Poker","has_images":false,"description":"Poker is played with a traditional deck of 52 cards (13 values in 4 suits). The values on the cards, in ascending order, are: 2, 3,…, 10, Jack, Queen, King, Ace. Given a round of a poker game with two players, your job is to determine the winner.\n\n                    Each player has two card of their own and there are five cards common to both players on the table. The player with the best hand of five cards among his own two and the five on the table wins. A card from the table can be used by both players at the same time and the player hand can be obtained by ignoring the two cards of their own and using the five cards common to both of them.\n\n                    In order to compare two hands, you have to check which hands they match on the list below. If a hand matches more than one type, you must choose the most valuable one. If two hands match a same type, you apply the tiebreaker rule specific to this type.\n\n                    The list of hands, sorted from the least valuable to the most valuable, and their respective tiebreaker criteria is:\n\n                    \n                        High card: any hand that does not matches any other hand. The tiebreaker rule is to compare the five cards one by one, from the most valuable to the least, until a hand presents a card with more value than the other.\n                        One pair: two cards of the same type. The tiebreaker rule is similar to the high card’s rule, only that you compare first the pair and then the other cards.\n                        Two pairs: two pairs. The tiebreaker rule is similar to the high card’s rule. You first compare the most valuable pair, then the least valuable pair and then the remaining card.\n                        Three of a kind: three cards of the same value. The tiebreaker rule is similar to the one pair’s rule.\n                        Straight: five cards sequence of consecutive values. In this case, the Ace can take the value of both the least valuable card (before the 2) or of the most valuable (after the king). The tiebreaker rule is done by the most valuable card on the straight. Note that the Ace is the least valuable card if it appears before the 2.\n                        Flush: five cards of the same suit. The tiebreaker rule is the same of the high card’s rule.\n                        Full House: a three of a kind and a pair. The tiebreaker rule is done by comparing first the values of the three of a kind. If the tie remains, the pair values must be compared.\n                        Four of a kind: four cards with the same value. The tiebreaker rule is comparing the values of the four of a kind and then the remaining card.\n                        Straight Flush: Straight and Flush simultaneously. The tiebreaker rule is the same of the straight’s rule.\n                    \n\n                    Note that it is possible for a tie to remains even after the tiebreaker rules are applied. The cards suits are only to be considered to define a flush, and are not be taken in account in any tiebreaker rule.","id":"2114","category":"Mathematics","statistics":{"level":"9 / 10","submissions":33,"solved":5,"ratio":"15.15%"}}