{"output":"For each instance of the input your program must print, in a single line, the list of elected candidates ordered by the candidates rating in the election. If two candidates have the same rating, the lower index comes before.\n\n                    The output must be written to standard output.","input":"The input consists of several instances and ends with the end of file (EOF).\n\n                    Each instance starts with the number N (1 ≤ N ≤ 105) of voters, the number K of candidates and the number V (1 ≤ V ≤ K ≤ 100) of vacancies. The following N lines describe the votes of each voter. In a vote, the voter i indicates the number Li (1 ≤ Li ≤ 100) of candidates in which he will vote, and the indices of these candidates in his preference order. Indices of candidates outside the range [1, K] mean blank votes only for the corresponding preference option. If more then V votes are given, the last ones must be ignored. A voter never indicates the same candidate more than once.\n\n                    The input must be read from standard input.","level":9,"name":"Voting at Yekaterinburg","has_images":false,"description":"Yekaterinburg, Russia, is a city with a curious voting system. In an election in which there are V vacancies for a position, each voter is entitled to vote V times, arranged in order of preference. Thus, if there is, for example, 3 vacancies in the Senate, each voter votes for up to 3 names. The candidates with the highest number of votes will be elected, regardless the preference of the voters. Only if there is a tie the order given by the voters become important. In this case, the candidate with the most nominations for the first place wins. If still a tie, for second place, and so on. If two or more candidates who are in the a position to be elected have exactly the same number of nominations in all positions, all are elected (it may even exceed the number of vacancies). Candidates with zero votes can be elected if there is still places available.","id":"2122","category":"Data Structures and Libraries","statistics":{"level":"9 / 10","submissions":144,"solved":32,"ratio":"22.22%"}}