{"output":"For each instance, you must print an identifier Instance k, in which k is the number of the current instance. Print the list of all the occurrences line column (the upper left corner is the position 0 0) of the m x m square in the n x n square. The output must be ordered first by the column and then by the lines. In case of no occurrence, print a line with no occurrence.","input":"The input is composed of several instances. The first line of each instance consist in two integers n (1 ≤ n ≤1000) and m (1 ≤ m ≤ 60 and m < n), indicating the squares' sizes. In the n following lines there are n characters \"|\" or \"_\" representing the characters of the n x n square. In them following lines there are m characters \"|\" or \"_\" representing the characters of the m x m square.","level":10,"name":"Totems Builders","has_images":false,"description":"Several pre-columbian civilizations inhabited tje region of Alberta in Canada. Little remained of these cultures, decimated by the intense cold, by the bear and, finally, by the British and French invaders who arrived after the discovery. Today, researches from Alberta's University try to unveil the mysteries of these people, studying totems produced in the region.\n\n                    Studies of the arts department of the university showed that the totems builders liked to mark them with several copies of their signatures. The artist's signature was made with vertical \"|\" and horizontal \"_\" grooves. Scholars imagine that the symbol was a representation of evil in the primitive culture and, therefore, a taboo, building a square pattern. Several signatures of artists from that era have already been identified.\n\n                    Your task in this problem is to make a program that receives a image of a totem, through a n x n square pattern size of vertical and horizontal grooves, and a m x m square signature size with a pattern of the same type, and find all the occurrences of the signature on the totem.","id":"2125","category":"Ad-Hoc","statistics":{"level":"10 / 10","submissions":147,"solved":25,"ratio":"17.01%"}}