{"output":"For each instance, you must print an identifier Instancia k, where k is the number of the actual instance. In the next line print sim if exists an attribution of building of roads that meets the demands described above, otherwise print nao.\n\n                    After each instance print a blank line.","input":"The input consists of several instances. The first line of each instance consists in three integers n (1 ≤ n ≤ 100), m (1 ≤ 10000) and k (1 ≤ k ≤ 2n) that indicates the number of cities, number of estimates and the number of companies. The next m lines contains three integers u (1 ≤ u ≤ n), v (1 ≤ v ≤ n) and c (1 ≤ c ≤ k) indicating that the company c can build a road that connects the city u to the city v.\n\n                    The instances are separated by a blank line.\n                    \n                    The input ends with end of file.","level":10,"name":"Demonstration of Honesty!","has_images":false,"description":"With the large number of Argentine immigrants in Canada, the Canadian government is creating new roads to the most distant and isolated regions inhabited by Argentines. Several bids were made to find out which companies could lead the works of each road. Each company released estimates for roads they could build.\n\n                    Canadians are known for intolerance against corruption and want to avoid at all costs any company being favored above the others. They decided that each company can be hired to do at most one of the roads. You can see that in Brazil things work the same way. (But let's not get into this merit!)\n\n                    Between two cities only one company may have been chosen to build a road.\n                    Your task is: Given a set of estimates for construction of roads linking the cities, decide whether there is a way to assign buildings to companies, meeting the requirement of the Canadian government, and being possible to travel from any city to any other using the roads built.","id":"2128","category":"Graph","statistics":{"level":"10 / 10","submissions":84,"solved":32,"ratio":"38.10%"}}