{"output":"For each instance, you must print an identifier \"Instancia K\", where K is the number of the actual instance. In the following line print the name of the student who failed.\n\n                    After each instance print a blank line.","input":"The input is composed by many instances. The first line of each instance have one integer N (1 ≤ N ≤ 100) defining the number of students in the competition. Each of the following N lines have the name of the student and the number of solved problems. The name is a sequence of letters [a-z] with the maximum size of 20 letters and each person solves 0 to 10 problems.\n\n                    The input finish with an end-of-file.","level":6,"name":"Who Will Fail?","has_images":false,"description":"Professor Wallywow, from British Columbia University, is really worried with the falling of students attention level. He already tried most of worldwide know techniques to stimulate the students to pay more attention to the classes and to do the tasks he gives: he gave good grades to the more participatives students, offered chocolates, took his karaoke and song in the classes, etc. As this actions dind't increased the attendance of the students (the karaoke ideia was very unhappy... the second class with karaoke had only one student and he had hearing problems) he had a brilliant ideia: start a competition between the students.\n\n                    Professor Wallywow gave a set of problems to the students resolve in a moth. In the end of the month, the students sent the number of problems resolved. The promisse of the brilliant professor was to flunk the student in the last place of the competition. The students were ordered by the number of problems resolved, with draws resolved with the alphabetical order of the names (there wasn't namesake in the class). That made the students with the names begging with the last letters of the alphabet worked hard in the tasks and didn't shared theirs solutions with theirs colleages (especially those who names began with previous letters). Your task in this problem is to write a program that reads the results of the Professor Wallywow students and writes the name of the unfortunate student who failed.\n\n                    Any similarity between Professor Wallywow and Professor Carlinhos is purely coincidental.","id":"2134","category":"Ad-Hoc","statistics":{"level":"6 / 10","submissions":1473,"solved":451,"ratio":"30.62%"}}