{"output":"As soon as the battler X's HP reaches 0 or drops below 0, print \"X is dead.\" then in the next line, the surviving battler's HP, MP, ATK, MAG and DEF.","input":"The input consists of a single test case. The first line contains the name of the battler 1 and the second line, his level (integer: 1 ≤ N ≤ 99), HP, MP (floating point: 1 ≤ HP, MP ≤ 999), ATK, MAG and DEF (floating point: 1 ≤ ATK, MAG, DEF ≤ 40). The third and the fourth line contains the same as the first and the second line, but related to the battler 2. The first one to attack is the battler 1, that is, in the first turn, the battler 1 is the current attacker and the battler 2 is the current defender. In the second turn, the battler 2 is the attacker and the battler 1 is the defender. The same logic applies to the subsequent turns. Read input until the battler X's HP reaches 0 or drops below 0.","level":7,"name":"P4 Simplified","has_images":true,"description":"You, fan of \"The True Goddess Reincarnation\" video game franchise, were hired by the developer company ATULS to help make a simplified version of the video game Personality 4, spin-off of this franchise. You'll be responsible for implementing the battle system. The following table contains the available skills and their features:\n\n\n\n\t\n\t\n\t\tSkill\n\t\tType\n\t\tPower\n\t\tHP Cost\n\t\tMP Cost\n\t\tEffect\n\t\n\t\n\t\n\t\n\t\tMightySwing\n\t\tPhysical\n\t\t270\n\t\t14%\n\t\t-\n\t\t-\n\t\n\t\n\t\tGiganticFist\n\t\tPhysical\n\t\t560\n\t\t16%\n\t\t-\n\t\t-\n\t\n\t\n\t\tRainyDeath\n\t\tPhysical\n\t\t350\n\t\t20%\n\t\t-\n\t\t-\n\t\n\t\n\t\tAgilao\n\t\tMagic - Fire\n\t\t200\n\t\t-\n\t\t8\n\t\t-\n\t\n\t\n\t\tAgidyne\n\t\tMagic - Fire\n\t\t320\n\t\t-\n\t\t12\n\t\t-\n\t\n\t\n\t\tBufula\n\t\tMagic - Ice\n\t\t200\n\t\t-\n\t\t8\n\t\t-\n\t\n\t\n\t\tBufudyne\n\t\tMagic - Ice\n\t\t320\n\t\t-\n\t\t12\n\t\t-\n\t\n\t\n\t\tMegidola\n\t\tMagic\n\t\t360\n\t\t-\n\t\t32\n\t\t-\n\t\n\t\n\t\tMegidolaon\n\t\tMagic\n\t\t420\n\t\t-\n\t\t60\n\t\t-\n\t\n\t\n\t\tBlackViper\n\t\tMagic\n\t\t440\n\t\t-\n\t\t64\n\t\t-\n\t\n\t\n\t\tTarukaja\n\t\tSupport\n\t\t-\n\t\t-\n\t\t12\n\t\tAttacker's current phys attack increases 25% and remains active until he uses phys attack\n\t\n\t\n\t\tRakukaja\n\t\tSupport\n\t\t-\n\t\t-\n\t\t12\n\t\tAttacker's current defense increases 25% and remains active until he suffers any attack\n\t\n\t\n\t\tTarunda\n\t\tSupport\n\t\t-\n\t\t-\n\t\t12\n\t\tDefender's current phys attack decreases 25% and remains active until he uses phys attack\n\t\n\t\n\t\tRakunda\n\t\tSupport\n\t\t-\n\t\t-\n\t\t12\n\t\tDefender's current defense decreases 25% and remains active until he suffers any attack\n\t\n\t\n\n\nNote: Support skills don't stack and always consume MP, even if it has no effect anymore. For example, if the player uses Rakunda 5 times in a row, the defender's DEF will still be 25% smaller and the MP consumption will have been 60.\n\nIn order to test the functionality of this system, you must consider a battle 1 vs. 1. Each battler will have level, HP (health points), MP (magic points) and the stats ATK (physical attack), MAG (magic attack) and DEF (general defense). The damage formula is:\n\n\n\nAT = Current attacker's attack. If physical attack, replace it with ATK, if magic attack, replace it with MAG.\nDF = Current defender's defense, that is, the DEF stat.\nP = Attack's power.\nDIFF = Difference between the current attacker's level and the current defender's level. This value will not be smaller than -10 neither greater than 10.","id":"2141","category":"Ad-Hoc","statistics":{"level":"7 / 10","submissions":49,"solved":16,"ratio":"32.65%"}}