{"output":"Print the connection between the given numbers, according to the conditions below:\n\n1 - If the love is requited, print \"Friends and lovers <3\";\n2 - If the love is almost requited, print \"Almost lovers!\";\n3 - If the love is unrequited, print \"X friendzoned Y!\", in which the sum of the divisors of X is different from the sum of the divisors of Y and X is a multiple of the sum of the divisors of Y (Y loves X) but Y is not a multiple of the sum of the divisors of X (X doesn't love Y);\n4 - If there's no connection, that is, the sum of the divisors of X is different from the sum of the divisors of Y and X is not a multiple of the sum of the divisors of Y and Y is not a multiple of the sum of the divisors of X, print \"No connection.\".\n\nNote: In this problem, the sum of the divisors doesn't include the number itself, and in the cases in which the love is requited and also almost requited, prevails the requited love.","input":"The input contains several test cases. Each test case consists of two integers N and M (2 ≤ N, M ≤ 109), being N and M different numbers. Read input until N = M = 0.","level":8,"name":"The Love Life of the Numbers","has_images":false,"description":"A natural number loves another number if the sum of its divisors is a divisor of the other number. For example, 9 loves 12, because the sum of the divisors of 9 is 4, which is a divisor of 12. However, 12 doesn't love 9, because 16 (sum of the divisors of 12) is not a divisor of 9. In this case, 9 loves 12 and is unrequited, which makes it a 'friendzoned' number.\n\nNevertheless, there are cases in which the love is requited: when the sum of the divisors of a number is equal to or a divisor of the other number and vice versa. On the other hand, an almost requited love occurs when the sum of the divisors of a number is equal to the sum of the divisors of the other number.\n ","id":"2145","category":"Mathematics","statistics":{"level":"8 / 10","submissions":417,"solved":84,"ratio":"20.14%"}}