{"output":"For each test case print the word Caso followed by a space, the case number and colon. On the next line, print the made ​​route, leaving home and coming there, so that it has obtained the shortest path by separating each place visited by a hyphen and a greater signal, giving an idea of arrow, followed by a colon, a space, and the distance of the total route with five decimal places. If the shortest path has more than one possibility, print the lexicographically smallest way. That is, if you have a route leaving home and going to the icosahedron of a star, and the other going to the two stars, choose to go on a first star, since both paths have the same distance.","input":"The first line will have an integer value C indicating the number of test cases. For each test case , there will be a line with two integers, X and Y indicating the coordinates of Kogu's home, where is the four-star icosahedron. Then there will be six rows, each with three integers N, XN e YN, representing the N-star icosahedron, and coordinates where is this icosahedron.","level":9,"name":"The Lizard's Icosahedrons","has_images":true,"description":"Legend has it that the Icosahedrons lizard are crystalline and can invoke the Lizard Shen Long Int, which has the ability to grant wishes to anyone who can join the seven icosahedrons. The icosahedrons come in sets of seven with each showing the number of stars. These are hard to find because they are scattered around the planet, and deactivates for one year every wish, turning into stone. To have the opportunity to invoke the Lizard, one has to travel around the globe to find them. One day Kogu wins the icosahedron four stars of his grandfather, Hogan. Upon learning of the legend, Kogu decides to go after the other icosahedrons, so you can lose the fear of injection. As technology progressed, it became easier and simple with the invention of his Mulba girlfriend, Radar lizard. But, to gain time, they need to know which of icosahedrons search warrant they must follow, so that traverse the shortest distance possible with your flying cloud.\n\n\n\nWrite a program that, given the coordinates of icosahedrons, enter the path of shortest distance, leaving his house, capture all icosahedrons and go home, and tell the distance in such a way.","id":"2155","category":"Graph","statistics":{"level":"9 / 10","submissions":143,"solved":41,"ratio":"28.67%"}}