{"output":"Print a single line containing three values, which represent, in this order, the number of target audiences in Valinor, the maximum number of elves in a target audience in Valinor and the maximum sum of the incomes of the elves of a same target audience in Valinor. Print the last value with exact two places after the decimal point.","input":"The input consists of three lines. The first line consists of two positive integers N and D (N ≤ 105, D ≤ 107), which respectively represent the number of elves in Valinor and the parameter that defines the adopted concept of age group. The second line consists of N integers ai (1 ≤ i ≤ N, 0 ≤ ai ≤ 107), which represent the ages of each one of the elves. At last, the third line consists of N values ci (1 ≤ i ≤ N, 0.00 ≤ ci ≤ 10000.00), given with exact two places after the decimal point, which represent the corresponding incomes of the elves, following the order in which the elves were given in the previous line.","level":9,"name":"URI - Uireb Rhom uin Iavas","has_images":false,"description":"The Uireb Rhom uin Iavas (translating: Eternal Horn of the Autumn), an important company in Valinor, is researching the several target audiences in the blessed kingdom. For URI, a target audience is a non-empty maximal set of elves S such that any two elves taken from S belong to the same age group. By the way, URI considers that two elves belong to the same age group if and only if the difference between their ages does not exceed a determined parameter D. For example, under D = 500, if Aegnor, Beleg and Celeborn are respectively 1300, 500 and 1000 years old, Aegnor and Celeborn are considered to belong to the same age group, as well as Beleg and Celeborn, but not Aegnor and Beleg. Moreover, if the only elves in Valinor were Aegnor, Beleg, Celeborn and Daeron, the latter 700 years old, the two target audiences would be {Aegnor, Celeborn} and {Beleg, Celeborn, Daeron}. Note that the set {Beleg, Celeborn}, although containing two elves of a same age group, is not deemed a target audience because it is not maximal.\n\nURI wants to know which is best for the release of a product: focus on a target audience as large as possible, or focus on a target audience perhaps smaller, but of greater purchasing power? Therefore, the information which URI needs to gather are crucial in order for the company to make the right choice!","id":"2181","category":"Paradigms","statistics":{"level":"9 / 10","submissions":490,"solved":70,"ratio":"14.29%"}}