{"output":"Print a single line, the smaller initial amount of  health points that Bia needs to be able to overcome the challenge. If it is impossible to reach the final room, print -1.","input":"The first line contains two integers N, K, indicating, respectively, the dimension of the matrix and the amount of immune rooms that Bia get when she collect all the five magical items. (2 ≤ N ≤ 100, 1 ≤ K ≤ 10).\n\nThen we have N lines that describe the matrix, each one of these lines will contain the information of N rooms, the characters: ‘I’, ‘F’, ‘#’, ‘P’, ‘O’, ‘W’, ‘E’, ‘R’, or an integer D, all described above.","level":10,"name":"Final Battle","has_images":false,"description":"Bia is playing a zombie game and she is about to start the final challenge. We are going to model the challenge as a NxN matrix, where Bia's goal is to get out of the room situated at the position [1, 1] and reach the room at the position [N, N]. However, as nothing in this life is so simple, there are rooms that contain zombies, rooms that are locked, and rooms that contain magical items to be caught, and when merged, Bia earns a great power.\n\n\n\tRoom [1, 1] contains always a character ‘I’ and room [N, N] a character ‘F’, meaning, respectively, the begin and end of the challenge.\n\tLocked rooms will be represented by the character ‘#’, meaning that it’s impossible to pass through them.\n\tRoom with an integer D means that there are zombies and, when Bia pass through it, she loses D health points.\n\tThe others rooms contain one of the following letters: ‘P’, ‘O’, ‘W’, ‘E’ or ‘R’, meaning the initial of each of the five magic items. When Bia pass through a room with any of these items, she pick it up and keep it in her backpack, and at the exact moment that she collect all of them, Bia becomes immune to the zombies in the next K rooms that she enters. It’s possible to have only one of each item at the same time in the backpack, and, when used, they will be lost, and may be collected again during the battle.\n\n\nIf Bia collect all the five items at a time that she is still under the effect of an earlier junction, the amount of immune room will not accumulate, it will return to the maximum value of K.\n\nYour task is to find out which is the lowest starting amount of health points for Bia, so she can still be able to win the challenge, given that she always choose the best possible path. She wins the challenge if she arrive in the room [N, N] with at least 1 heath point left.\n\nIf Bia is standing at the room [X, Y], she can only walk to the room [X+1, Y] or [X, Y+1].","id":"2183","category":"Paradigms","statistics":{"level":"10 / 10","submissions":273,"solved":66,"ratio":"24.18%"}}