{"output":"Print a single line, the greater sum of the forces of the pomekons captured that Geraldinho can achieve, respecting the given conditions. If he is unable to capture any pomekon, print -1.","input":"The first line contains two integers N, K, indicating, respectively, the number of points mapped in the city and the maximum amount of points that Geraldinho can pass. (2 ≤ N ≤ 105, 2 ≤ K ≤ 103).\n\nThen follows N-1 lines containing three integers X, Y, F, indicating that there is a bidirectional connection between the point X and Y containing a pomekon with strength of F. (1 ≤ X, Y ≤ N, X ≠ Y, 1 ≤ F ≤ 1000).","level":9,"name":"Pomekons","has_images":false,"description":"Pomekon GO has been released and it is already a fever among the people. After several days walking in his town looking for a pattern where the pomekons appear, Geraldinho drew some conclusions and wants to use his programming skills to get out in front in the capture of the pomekons. Geraldinho have mapped his city at various points. Between each pair of points that connect directly, he knows the strength of the pomekons that appears there.\n\nNow, Geraldinho wants to expand his pomekon journey all over the world, and for this, he needs your help.\n\nThere are Q possible routes in the format [A, B]. It means that you must walk from point A to point B. (Note that there is only one path between any pair of points). Each route can be used only once and is possible to capture only one pomekon per route, since the pobekolas are expensive nowadays. Another important fact is that Geraldinho can visit at most K points in his journey.\n\n\n\tIf there are two routes that pass through a point P, it will be counted twice.\n\tIf there are two routes that goes through the same link, it is possible to capture the pomekon in both walk.\n\n\nGeraldinho wants to maximize the sum of the strength of the pomekons that can capture, help him in this journey!","id":"2184","category":"Graph","statistics":{"level":"9 / 10","submissions":318,"solved":107,"ratio":"33.65%"}}