{"output":"For each operation 1, print a single line containing the amount of C character occurrences in the interval between positions A and B.\n\nFor each operation 2, print the first and the last occurrence of the character C in the range between positions A and B. If there is no character in the C range, print -1.\n\nAt the end of the N operations, print the resulting string of operations.","input":"The first input line consists of two integers L (1 ≤ L ≤ 106) and N (1 ≤ N ≤ 105) representing the number of letters that form initially named S, and the number of rounds respectively. The second line contains a string S, representing the initial name of the Prant's dog. Then follow N lines, representing the N rounds.\n\nIt is guaranteed that the string S contains only lowercase letters.","level":10,"name":"Bino, Prant and Indecision","has_images":false,"description":"As you may already know, Prant is a very indecisive kid, so it was very difficult for him to choose the name of his dog. After Prant choose the name S to his dog, Bino proposed a challenge. The Bino's challenge consisting of N rounds, and in each round can be performed one of the operations:\n\n1 A B C: Returns the number of occurrences of a character C in the range between positions A and B. For example, for S = \"abcda\" A = 1, B = 5 and C = 'a', the answer is 2.\n\n2 A B C: Finds the first and the last occurrence of a character C in the range between positions A and B. For example, for S = \"abcda\" A = 1, B = 5 and C = 'a', the first occurrence is in position 1, and the latter is in position 5.\n\n3 A B: Inverts all letters in the range between positions A and B. For example, for S = \"abcd\" A = 2 and B = 4, after the operation S = \"adcb\".\n\n4 A C: Adds a character C before the character of position A. For example, for S = \"abcd\" A = 2 and C = 'z', after the operation S = \"azbcd\".","id":"2186","category":"Data Structures and Libraries","statistics":{"level":"10 / 10","submissions":339,"solved":42,"ratio":"12.39%"}}