{"output":"For each entry test set your program should produce three lines in the output. The first line should contain a test set identifier in the format \"Teste n”, where n is numbered from 1. The second line must contain a pair of integers I e J which respectively indicate the first and last matches of the best period, as determined by your program, except when the goal difference of the best period is less than or equal to zero; in this case the second line should contain the word \"nenhum\". The third line should be left blank. The spelling shown in Example output below should be followed strictly.","input":"Your program should read multiple test sets. The first line of a test set contains a non-negative integer, N (0 ≤ N ≤ 10000), that indicates the number of matches played by the team (the value N = 0 indicates the end of the input). It follows N lines, each one containing a pair of non-negative integer numbers X e Y (0 ≤ X,Y ≤ 50) representing the result of the match: X are the goals for and Y the goals against the team of Hippolytus. The matches are numbered sequentially from 1, in the order they appear in the entry. ","level":6,"name":"Goal Difference","has_images":false,"description":"Hippolytus is a fanatical fan. Collects streamers, flags, newspaper clippings, figurines of players, shirts and everything else that relates to his favorite team. When he won this one computer at a party, decided to set up a database with the results of every game of his team occurred since its founding in 1911. After the data entered, Hipólito started to get curious about performance statistics of team. For example, he wants to know what was the period when his team has accumulated the highest goal difference. As Hippolytus has the computer very recently, he does not know to program very well, and needs your help.\n\nIt's given a list, numbered sequentially from 1, with the results of all team games (first game: 3 x 0, second game: 1 x 2, third match: 0 x 5 ...) is given. Your task is to write a program to determine in which period the team managed to accumulate the highest goal difference. A period is defined by two matches sequence numbers, A and B (A ≤ B ≤ N). The balance of accumulated goals between A and B is the sum of the goals scored by the team in all matches played between A and B (including the same) minus the sum of the goals scored by the opposing teams in the period. If there is more than one period with the same goal difference, select the longest period (ie the period in which B - is greater). If there is still more than one possible solution, choose any one of them in response.","id":"2191","category":"Ad-Hoc","statistics":{"level":"6 / 10","submissions":1264,"solved":258,"ratio":"20.41%"}}