{"output":"For each test case, display its case number followed by the width of the smallest trash chute through which it can be dropped. Display the minimum width with exactly two digits to the right of the decimal point, rounding up to the nearest multiple of 1/100. Answers within 1/100 of the correct rounded answer will be accepted.\n\n\t\t\t\t\tFollow the format of the sample output.","input":"The input contains several test cases. Each test case starts with a line containing an integer n (3 ≤ n ≤ 100), the number of points in the polygon that models the trash item.\n\n\t\t\t\t\tThe next n lines then contain pairs of integers xi and yi (0 ≤ xi , yi ≤ 104 ), giving the coordinates of the polygon vertices in order. All points in one test case are guaranteed to be mutually distinct and the polygon sides will never intersect. (Technically, there is one inevitable exception of two neighboring sides sharing their common vertex. Of course, this is not considered an intersection.)\n\n\t\t\t\t\tThe last test case is followed by a line containing a single zero.","level":8,"name":"Trash Removal","has_images":true,"description":"Allied Chute Manufacturers is a company that builds trash chutes. A trash chute is a hollow tube installed in buildings so that trash dropped in at the top will fall down and be collected in the basement. Designing trash chutes is actually highly nontrivial. Depending on what kind of trash people are expected to drop into them, the trash chute needs to have an appropriate size. And since the cost of manufacturing a trash chute is proportional to its size, the company always would like to build a chute that is as small as possible. Choosing the right size can be tough though.\n\n\t\t\t\t\tWe will consider a 2-dimensional simplification of the chute design problem. A trash chute points straight down and has a constant width. Objects that will be dropped into the trash chute are modeled as polygons. Before an object is dropped into the chute it can be rotated so as to provide an optimal fit. Once dropped, it will travel on a straight path downwards and will not rotate in flight. The following figure shows how an object is first rotated so it fits into the trash chute.\n\n\t\t\t\t\t \n\n\t\t\t\t\tYour task is to compute the smallest chute width that will allow a given polygon to pass through.","id":"2202","category":"Ad-Hoc","statistics":{"level":"8 / 10","submissions":79,"solved":27,"ratio":"34.18%"}}