{"output":"For each entry test set your program should produce three lines in the output. The first line should contain a test set identifier in the format \"Teste n\", where n is numbered from 1. In the second line should appear the identifiers of the cities that can be reached, in ascending order, separated by at least a blank. The third line should be left blank. The spelling shown in Example output below should be followed strictly.","input":"The input consists of several test sets. The first line of a test set contains four integers C (0 ≤ C ≤ 50), E (0 ≤ E ≤ 2500), L (0 ≤ L ≤ C) e P (0 ≤ P ≤ C). The values C e E respectively indicate the number of cities and the number of roads. Cities are identified by integers from 1 to C. the values L e P indicate, respectively, the city where the Juquinha family is at the time and the maximum number of tolls that Mr. Juca is willing to pay. At E following lines each one contains information of a road represented by a pair of positive integers X e Y (1 ≤ X,Y ≤ C), indicating that there is a road (two-way) of the city X  to the city Y. The end of the input is indicated by C = E = L = P = 0.","level":7,"name":"Toll","has_images":false,"description":"The prize for first place in the Brazilian Olympiad of Informatics, Juquinha and his family have won a one week trip to South Korea. As the country is stunning, with traditions, culture, very different architecture and cuisine of Brazil, the father of Juquinha Mr. Juca, decided to rent a car to explore the country. The roads are well maintained; all are two-way, and two cities can be directly connected by more than one road. However, on all roads you pay a fixed amount of toll (there is a toll each way between two cities). As Mr. Juca does not have much money to spend, travel with the car should be very thoughtful.\r\n\r\nWrite a program that known cities and existing roads in the country and the city where Juquinha and your family are, find each city (not the city where they are) that can be visited by them, given the restriction that Mr . Juca want to pay at most P tolls (considering only the outward journey).","id":"2230","category":"Ad-Hoc","statistics":{"level":"7 / 10","submissions":743,"solved":229,"ratio":"30.82%"}}