{"output":"For each input set of test his program to produce a set of rows in the output. The first line should contain a test set identifier in the format \"Teste n\", where n is sequentially numbered from 1. The following should appear a line for each & nbsp; author of set of tests (except the very P. Erdos ). Each line should contain the author's name followed by the character ':', a blank space and the number of Erdos. If the number of Erdos of a particular author is infinite, type 'infinito'. The output should be ordered alphabetically by author's last name, and if the same last name, the tie should be done by the initial of the first name. Print a blank line at the end of each test set. The spelling shown in Output Sample below should be followed strictly.","input":"The input consists of several test sets. The first line of a test set contains an integer A (1 ≤ A ≤ 100),indicating the number of articles. Each one of A the following lines contain the list of authors of an article. Each author is identified by the initial of his name (capitalized), followed by a point and a blank (indicating that the name is abbreviated), followed by his/her last name (‘P. Erdos’, for example). The last name of an author has a maximum of 15 letters, and only the first letter appears in uppercase. The authors are separated by commas, and the list of authors of an article ends with a point (see the examples below). A single white space separates the name abbreviation of the last name and the name of the previous author. Blanks are not used elsewhere. An article has a maximum of 10 authors, and the total of authors does not exceed 100. The end of entry is indicated by A = 0.","level":6,"name":"Erdos Number","has_images":false,"description":"The Hungarian mathematician Paul Erdos (1913-1996), one of the brightest of the twentieth century, is considered the most prolific mathematician in history. Erdos published over 1500 articles, in collaboration with about 450 other mathematicians. In honor of this Hungarian genius, mathematicians created a number called \"number of Erdos.\" Every person who wrote a paper with Erdos has the number 1. All that do not have number 1, but wrote an article with someone who has number 1, have number 2. And so on. When no connection can be established between Erdos and a person, it is said that it has infinite number of Erdos. For example, the number of Erdos Albert Einstein is 2. And, perhaps surprisingly, the number of Erdos Bill Gates is 4.\r\n\r\nYour task is to write a program that, from a list of authors of articles, determine the number of Erdos authors.","id":"2249","category":"Ad-Hoc","statistics":{"level":"6 / 10","submissions":201,"solved":97,"ratio":"48.26%"}}