{"output":"Seu programa deve imprimir uma única linha, contendo apenas um inteiro, o número mínimo de caracteres necessários para descrever o catálogo.","input":"A primeira linha da entrada contém um inteiro N (1 ≤ N ≤ 105), indicando quantos arquivos Joyce possui no dvd. Cada uma das N linhas seguintes contém a descrição de um arquivo, a partir da raiz.\r\n\r\n\r\n\tNúmero de pastas na entrada ≤ 105\r\n\tO nome de cada pasta e de cada arquivo é composto por no máximo 20 caracteres, entre letras minúsculas, maiúsculas e ponto (.)\r\n\tCada pasta possui no máximo 100 pastas como filhas diretas.","level":2,"name":"Catálogo de Músicas","has_images":true,"description":"Joyce é uma menina que gosta muito de ouvir música, e possui uma enorme coleção de músicas num dvd. Ela é uma menina organizada e deixa suas músicas em pastas, mas como o número de músicas e de pastas é grandre, Joyce construiu um catálogo para melhor localizá-las.\r\n\r\nPara o catálogo Joyce utilizou uma convenção usual em sistemas operacionais, em que a descrição da localiza- ção de cada arquivo é formada pela sequência dos nomes das pastas no caminho da raiz do dvd até o arquivo, separados pelo caractere barra (‘/’). Por exemplo, na figura abaixo, a descrição da música Sampa.mp3 no catálogo é MPB/Caetano/Sampa.mp3.\r\n\r\n\r\n\r\nUtilizando essa convenção, o catálogo do dvd mostrado na figura é:\r\n\r\nRock/AngraCarryOn.mp3\r\n\r\nMPB/Caetano/Sampa.mp3\r\n\r\nMPB/Cartola/Alvorada.mp3\r\n\r\nComo o dvd de Joyce tem muitas músicas e pastas, o catálogo é muito grande. Joyce notou no entanto que o catálogo poderia ser menor (ter um número menor de caracteres) caso ela utilizasse outro conceito usual na nomeação de arquivos em sistemas operacionais: usar uma pasta como referência, ao invés da raiz.\r\n\r\nSe uma pasta diferente da raiz for escolhida como referência, então para todos os arquivos que estejam diretamente nessa pasta ou em alguma subpasta não será mais necessário escrever o nome da pasta referência no catálogo. Para as demais pastas, é necessário indicar o caminho utilizando as pastas acima (na direção da raiz) utilizando a convenção ‘../’ para a pasta imediatamente acima da pasta referência. No exemplo da figura acima, no caso de a referência ser a pasta Caetano, a música Sampa.mp3 seria simplesmente descrita como Sampa.mp3. Já a música Alvorada.mp3 seria descrita como ../Cartola/Alvorada.mp3.\r\n\r\nAssim, se a pasta Caetano for utilizada como referência, o catálogo será:\r\n\r\n../../Rock/AngraCarryOn.mp3\r\n\r\nSampa.mp3\r\n\r\n../Cartola/Alvorada.mp3\r\n\r\nNesse caso, a descrição do catálogo tem 59 carateres, menor do que quando a referência utilizada é a raiz do DVD.\r\n\r\nSeu objetivo é, dada a informação de todas as músicas do catálogo, determinar o número mínimo de caracteres necessários para descrever o catálogo.","id":"2430","category":"Ad-Hoc","statistics":{"level":"2 / 10","submissions":40,"solved":34,"ratio":"85.00%"}}