{"output":"Seu programa deve imprimir uma única linha, contendo um único inteiro, indicando o número de frutas que serão produzidas pela plantação do Seu João.","input":"A primeira linha da entrada contém dois inteiros, N(1 ≤ N ≤ 100000) e K (1 ≤ K ≤ 100 000), respectivamente o número de dias que dura a safra, e o número de árvores que o Seu João possui.\n\n\t\t\t\t\tA segunda linha contém K inteiros ai (1 ≤ ai ≤ 100, para todo i) indicando quantas frutas foram produzidas no dia anterior ao início da safra por cada uma das K árvores.\n\n\t\t\t\t\tA linha seguinte contém N letras separadas por um espaço em branco. Cada uma das letras indica se choveu ou se estiou durante a noite respectiva: a primeira letra se refere à primeira noite, a segunda letra se refere à segunda noite, e assim por diante. Se a letra for um ‘C’, indica que choveu aquela noite chuvosa, e se for um ‘E’, indica que estiou (ou seja, não choveu).","level":7,"name":"Plantação","has_images":false,"description":"A N-logônia é uma região com um clima muito intenso e variável, onde em questão de poucos dias é possível observar uma forte seca, seguida de uma intensa estação de chuvas. O Seu João tem uma plantação de obilina, uma fruta típica e muito apreciada na região, o que a torna muito valiosa. A obilina, entretanto, é muito suscetível a mudanças climáticas, de forma que é difícil prever quanto desta fruta será colhido durante a safra.\n\n\t\t\t\t\tObservou-se que as árvores de obilina seguem as seguintes regras:\n\n\t\t\t\t\t\n\t\t\t\t\t\tAs árvores produzem frutas todos os dias, exceto quando elas morrem;\n\t\t\t\t\t\tAs árvores mortas não produzem frutas, e infelizmente, mesmo que volte a chover, continuam mortas;\n\t\t\t\t\t\tSe choveu na noite anterior, a árvore produz uma fruta a mais que no dia anterior;\n\t\t\t\t\t\tSe estiou na noite anterior, a árvore produz uma fruta a menos que no dia anterior; e\n\t\t\t\t\t\tUma árvore morre se não produzir nenhuma fruta.\n\t\t\t\t\t\n\n\t\t\t\t\tO Seu João deseja vender toda a obilina produzida para uma grande rede de mercados local, mas para isso, precisa saber exatamente quantas frutas de obilina ele colherá durante a safra.\n\n\t\t\t\t\tPara ajudar o Seu João nesta tarefa, você deve escrever um programa que, dada a previsão do tempo para cada noite do período da safra, e quantas frutas cada árvore do Seu João produziu no dia anterior ao início da safra, determine quantas obilinas serão colhidas durante a safra.\n\n\t\t\t\t\tPor exemplo, considerando apenas um pé de obilina, se a safra dura dois dias, choveu durante duas noites, e o pé de obilina produziu 3 frutos antes de começar a safra, a produção total da safra será de 9 frutas: 4 no primeiro dia da safra, e 5 no segundo dia.","id":"2442","category":"Ad-Hoc","statistics":{"level":"7 / 10","submissions":151,"solved":51,"ratio":"33.77%"}}