{"output":"Your program should produce a single line containing a single integer, the maximum amount of food that the Pacman can take home.","input":"The first line contains an integer N (2 ≤ N ≤ 100), the game board size, which is square. Each of the following N lines contains N characters, which can be:\r\n\r\n\t\t\t\t\t\r\n\t\t\t\t\t\t'.' Empty space;\r\n\t\t\t\t\t\t'o' a meal;\r\n\t\t\t\t\t\t'A' a ghost.\r\n\t\t\t\t\t\n\n\t\t\t\t\tThere is not a ghost and a meal in the same position.\n\t\t\t\t\tThere is no ghost or food in the initial position (the first character of the first line of the board is '.').","level":2,"name":"PacMan","has_images":false,"description":"Pac Man is a popular game where the character tries to eat as much as possible balls, whilst having to flee several ghosts. This time our character wants to carry the food collected home, but the encounter with a ghost, instead of finishing the game, makes all the food collected is stolen.\r\n\r\n\t\t\t\t\tIn this problem the ghosts do not move, and the player always makes the Pacman go through the following path:\r\n\r\n\t\t\t\t\t\r\n\t\t\t\t\t\tThe Pacman begins in the upper left corner of the board.\r\n\t\t\t\t\t\tThe Pacman runs the line, from left to right, until you reach the right side of the board.\r\n\t\t\t\t\t\tThe player down one position, and runs the line, this time from right to left.\r\n\t\t\t\t\t\tSteps 2 and 3 are repeated until the entire board has been gone through.\r\n\t\t\t\t\t\r\n\r\n\t\t\t\t\tUnfortunately, Pacman can not ignore the user's commands to escape the ghosts or get more food, but it can, at any time, take advantage of an implementation bug and stop the game, taking all the food you are loading.\r\n\r\n\t\t\t\t\tYou should write a program to determine the largest amount of food the Pacman can take, if you choose the best possible time to leave. Note that the player also has the option to not leave before the end of the game.","id":"2451","category":"Ad-Hoc","statistics":{"level":"2 / 10","submissions":880,"solved":528,"ratio":"60.00%"}}