{"output":"For each test case, print the number of days for the infestation to be completely eliminated.","input":"The first line of input consists of an integer indicating the number of following test cases. Each test case contains A (2 ≤ A ≤ 100) and B (2 ≤ B ≤ 100) representing the number of rows and the number of columns of the matrix, respectively. Then, a binary matrix A x B will be given, with 0 indicading that there's no guava tree and 1 indicating that there's an infected guava tree. Subsequently, the initial coordinates X  (1 ≤ X ≤ A) and Y (1 ≤ Y ≤ B)​​​ will be given, representing where the medicine will be applied. There's no guava tree without adjacent guava tree, that is, the medicine can always reach every guava tree.","level":4,"name":"Bicho da Goiaba","has_images":false,"description":"Recently in Nlogonia, several guava trees are being infested by a larva species called Marangonis Ovidius, known for being extremely harmful to plantations. However, Dr. Icaronieris, a prodigy of current medicine and a lover of good guavas, has invented a medicine that completely extinguishes this infestation.\n\nUnhappy with the effect of the medicine on only one guava tree, he went further: he created a mechanism that, day after day, spreads the effect to every adjacent tree to the trees whose effect is active. For example, the medicine is applied to a certain tree. The next day, it spreads itself to the trees that are adjacent to it, and the day after, to the trees that are adjacent to the adjacent trees of the initial tree, and so on, until the infestation is completely gone.\n\nThe doctor, however, doesn't have time to test the efficiency and the feasibility of his creation on paper. He needs a program that, given the infected guava trees and the coordinates of the tree where the medicine will be applied, returns the number of days until every guava tree is cured. As a payment, the doctor promised you 100 guava boxes every month (with worms or with no worms, you can choose) every month, plus a meal voucher in IEF. Gonna miss that one?","id":"2485","category":"Graph","statistics":{"level":"4 / 10","submissions":765,"solved":307,"ratio":"40.13%"}}