{"output":"For each N informed by Maria, a single line containing the result should be returned in the following format: Experiment X: Y full cycle(s). Where X represents the test case number and Y represents the number of complete cycles.","input":"The input is composed of several test cases. Each test case is composed of a single integer N, which represents the number of steps Maria wants the complete experiment to have (-1 <= N <= 1000). It is important to remember that a step can be the determination of color or hardness, while a cycle is composed by determining the two characteristics. The program closes with N = -1.","level":1,"name":"Counting Cycles","has_images":false,"description":"We are in the year 2030. The benefits of quantum mechanics are already well known and computation has been and is being heavily modified by recent discoveries. That way, almost all computers and smartphones are very different from what they were in 2016 (14 years ago). Because of the importance and immeasurable applicability of this branch of physics in everyday life, most countries have determined that the principles of this branch should be taught in the final year of high school.\r\n\r\nMaria is finishing high school and is part of the first group that contains quantum mechanics in the curriculum. The first classes of this content have already been taught and Maria is studying for the exam, which will be next week. The content charged in the evaluation will be: The Principle of Uncertainty and the Superposition of Electrons.\r\n\r\nYou, as a good programmer and friend of Maria, decided to help her by writing an algorithm that is able to count how many complete cycles each experiment will contain with electrons. It is known, by the uncertainty principle, that one characteristic does not interfere with another, for example, the color presented by a given electron does not imply its hardness or malleability. You will consider that experiments always begin with color determination and then with determination of hardness, this process can be repeated depending on how many steps Mary wants the experiment to have.\r\n\r\nAssuming she chose 3 steps, the experiment would be performed as follows:\r\n\r\nDetermination of color → Determination of hardness → Color determination\r\n\r\nIts program must inform how many complete cycles have been made, knowing that, for Maria, a complete cycle is composed by the determination of the color and the hardness of the electron, respectively. In the test case presented above, it would be 1 complete cycle. But if she chose 4 steps, they would be 2 complete cycles.","id":"2497","category":"Mathematics","statistics":{"level":"1 / 10","submissions":1228,"solved":744,"ratio":"60.59%"}}