{"output":"For each input test case, it must be printed on the output three words, separated by one space only every two of them, showing the phase according to physical, emotional and intellectual biorhythm, in that order. If the specific biorhythm is in positive phase, the word will be: \"POSITIVO\", if it is in negative phase: \"NEGATIVO\", or if it is in null phase: \"ZERADO\".","input":"The input contains several test cases. Each line is a test case and contain a date formated as D/M/YYYY (full year), a valid date before 7/11/2016 (November, 7th, 2016). Priority does not exceed 100 years.","level":6,"name":"Biorythm","has_images":false,"description":"On the begining of the 20th century, the Viennese psychologist Hermann Swoboda and the German doctor Wilhelm Fliess, have noticed that human being has favorable and unfavorable cycles throughout life. These cycles are associated to three human states: physical, emotional and intellectual. At birth all cycles are reseted. As days go long the cycles varies on a sinusoidal way between a minimum and maximum.\r\n\r\n\r\n\tPhysical biorhythm has 23 days cycle.\r\n\tEmotional biorhythm has 28 days cycle.\r\n\tIntellectual biorhythm has 33 days cycle.\r\n\r\n\r\nWhen on a positive cycle, the biorhythm indicates a favorable phase to physical, emotional or intellectual challenges. As an example, anyone who is in the positive phase of intellectual biorhythm will have more advantages in this competition than those in a negative phase. \r\n\r\nAt day 0 (birth) all biorythms are reset. At day 1 all of them are at positive phase. At day 14, as an example, the emotional biorythm is at null phase, physical biorhythm is negative and intellectual biorhythm is positive yet, and so on. The question is, after several days of life, what phase would it be the biorhythms at today date (November, 7th, 2016)? It is asked to you to develop a program that reads the birth date and states the phase for physical, emotional and intellectual at November, 7th, 2016 as positive, negative and null.","id":"2504","category":"Ad-Hoc","statistics":{"level":"6 / 10","submissions":36,"solved":7,"ratio":"19.44%"}}