{"output":"For each test case, print a single line containing three values x, y and z, separated by single spaces, indicating the coordinates of the point P. Round and print each coordinate with exactly two decimal places.","input":"Each test case contains only one line with three integers r, la and lo (1 ≤ r ≤ 50,-90 ≤ la ≤ 90,-180 ≤ lo < 180), indicating the sphere’s radius and the latitude and longitude of point P, in degrees. The input ends with end-of-file (EOF).","level":3,"name":"Ask the Geographer","has_images":true,"description":"America and Vinicius are studying the geographic coordinate system on spheres. With this system, it is possible to determine the position of any point on a sphere’s surface. Their friend Maísa, who is a geographer, decided to help them. She explained how this system works.\n\n\t\t\t\tIn this system, a point is determined by its latitude and its longitude. The latitude varies from -90o to 90o and indicates the angle of the point with respect to the center of the sphere, in the vertical direction, as indicated by figure (a). The longitude varies from -180o to 180o and indicates the angles of the point with respect to the center of sphere, in the horizontal direction, as indicated by figure (b). As an example, figure (c) shows the position of a point P with latitude 45o and longitude 45o.\n\n\t\t\t\t\n\n\t\t\t\tConsider that the center of the sphere is at the origin O = (0, 0, 0) of the Cartesian space and, when looking the sphere from the front, the x axis goes from left to right, the y axis goes from the bottom to the top, and the z axis goes from the less deep to the deeper point. Figure (d) indicates a sphere with radius 1, where point P is located at (1∕2, (√2)∕2,-1∕2).\n\n\t\t\t\tGiven the sphere’s radius and the geographic coordinates of a point P, determine its coordinates in the Cartesian space.","id":"2521","category":"Computational Geometry","statistics":{"level":"3 / 10","submissions":129,"solved":69,"ratio":"53.49%"}}