{"output":"For each test case, print a single line with the number of valid positions suggested by the Ministry.","input":"The input contains several test cases. The first line of each test case contains four integers N, C (1 ≤ N, C ≤ 104), K (1 ≤ K ≤ 8) and D (1 ≤ D ≤ 105).\n\nThe next N lines contain two integers each, xi and yi (0 ≤ xi, yi ≤ 104), the position of i-th geocache already present in Nlogonia. There are no repeated positions.\n\nThe next C lines contain two integers each, xj and yj (0 ≤ xj, yj ≤ 104), the j-th possible location of the new geocache.The input ends with end-of-file (EOF).","level":10,"name":"Traveling Cacher","has_images":false,"description":"Clóvis Eduardo is a traveling cacher, i.e., he travels across the world practicing geocaching. Geocaching is a GPS-based worldwide game in which players look for boxes (known as geocaches) previously hidden by other players, using its coordinates.\n\nDue to his great reputation and experience (more than 32768 geocaches found everywhere), Clóvis Eduardo was invited by the Nlogonian Ministry of Leisure and Sports to hide the most important geocache in history: a big golden box in the shape of a horse, that celebrates the 50 years of the Nlogonian republic.\n\nHowever, finding the perfect hidden place is not enough. New geogaches must follow some new rules, defined this year:\n\n\n\tA new geocache must not be put at the same place of another one previously there;\n\tThe sum of the distances of the K nearest geocaches must be equal to or greater than D;\n\tIf there is less than K geocaches, all existent geocaches must be considered in such sum.\n\n\nNlogonia can be described as a plan, and, currently, there are N geocaches already present. The Ministry choose C possible locations for placing the commemorative geocache, and asked how many of these locations are valid according to the new rules.\n\nSince Clóvis Eduardo is really lazy, he asked you to write a program to solve his problem.","id":"2525","category":"Computational Geometry","statistics":{"level":"10 / 10","submissions":100,"solved":49,"ratio":"49.00%"}}