{"output":"For each test case, print a line with the value that must be yelled for each order that requires an yell (E and O).","input":"The input contains several test cases. In each test case, the first line contains two integers P and Q (1 ≤ P, Q ≤ 105). The following line contains P integers pi (0 ≤ pi ≤ 109), the integers initially written on the fleas’ boards.\r\n\r\nNext Q lines describe the orders they receive. Each order may be:\r\n\r\n\r\n\tS a v: Replace the integer on the board held by the flea at position a (1 ≤ a ≤ P) by v;\r\n\tE a b: Yell the number of even integers on boards held by fleas in the interval [a,b] (1 ≤ a ≤ b ≤ P);\r\n\tO a b: Yell the number of odd integers on boards held by fleas in the interval [a,b] (1 ≤ a ≤ b ≤ P);\r\n\tI a b: Reverse the order of the boards in the interval [a, b] (1 ≤ a ≤ b ≤ P).\r\n\nThe input ends with end-of-file (EOF).","level":9,"name":"Flea Circus","has_images":false,"description":"Vasya and Petya decided to invest in a new enterprise. They opened a flea circus.\r\n\r\nRight now, they are rehearsing with their P fleas in a straight line. Each flea holds a small board with an integer written on it, and can follow 4 different orders:\r\n\r\n\r\n\tReplace the number on its board by another given one;\r\n\tYell the number of even integers on boards held by fleas in a given interval;\r\n\tYell the number of odd integers on boards held by fleas in a given interval;\r\n\tStart dancing while the fleas in a given interval reverse the order of their boards.\r\n\r\n\r\nSome fleas did not understand the last order and asked for an example. Vasya then said:\r\n\r\nConsider there are 10 fleas holding, initially, boards with the following integers:\r\n\r\n70, 15, 3, 4, 15, 59, 0, 1, 444, 2\r\n\r\nIf they receive the order to reverse the order of the boards in the interval [3, 7], then the new line will be:\r\n\r\n70, 15, 0, 59, 15, 4, 3, 1, 444, 2\r\n\r\nThe duo asked you to write a program to simulate the rehearsing, so they can see if they are well trained.","id":"2529","category":"Graph","statistics":{"level":"9 / 10","submissions":133,"solved":50,"ratio":"37.59%"}}