{"output":"For each test case, print, for each round, a line containing the total number of olives in the given region.","input":"The input contains several test cases. The first line of each test case contains the integers N and M (1 ≤ N ≤ 1000, 1 ≤ M ≤ 105). Next N lines contains N integers each, describing the initial board. Value 1 indicates an olive, while value 0 indicates an empty cell. Next 2×M lines describe the rounds, two lines per round. The first line contains two integers i and j (1 ≤ i, j ≤ N), indicating the insertion of an olive at the cell in the i-th row and j-th column. It is guaranteed that that cell is empty before this round. The second line of each turn contains four integers I1, J1, I2 e J2 (1 ≤ I1 ≤ I2 ≤ N, 1 ≤ J1 ≤ J2 ≤ N), describing the region from cell (I1, J1) to the cell (I2, J2).The input ends with end-of-file (EOF).","level":6,"name":"GigaDrive","has_images":false,"description":"TéquiToy is relaunching the Giga Drive, an old console very popular in the 90’s. To celebrate its relaunching, TéquiToy will also launch a “new” game this year: Giga Drive ChessBread 2! Actually, Giga Drive CheeseBread 2 is a clone, with a few modifications, of another old-but-famous game. Due to this, the rules are very similar to that old game.\r\n\r\nIn Giga Drive CheeseBread 2, the game’s board is a matrix with N rows and N columns. Initially, each cell is empty or contains an olive (?). A match consists of M rounds. At each round, the CPU puts an olive at an empty cell in the board. After that, it asks the players how many olives there are in region of the board between cells (I1,J1) and (I2,J2). In other words, the CPU indicates four integers I1, J1, I2 and J2, and asks the player the total number of olives in all cells in the i-th row and j-th columns such that I1 ≤ i ≤ I2 and J1 ≤ j ≤ J2.\r\n\r\nTo win the game, you must correctly answer the count in all rounds in the match! However, you do not have much time to count the olives, so you decided to write a program to ensure your victory!","id":"2537","category":"Data Structures and Libraries","statistics":{"level":"6 / 10","submissions":190,"solved":88,"ratio":"46.32%"}}