{"output":"For each test case, print a line containing an integer indicating how many analógimôns will be inside the gym after all attempts.","input":"The input contains several test cases. The first line of each test case contains two integers PI and M (1 ≤ PI, M ≤ 105), the gym’s PI and the number of attempts, respectively. Next M lines describe an analógimôn begin tried to be put in the gym, in the order the attempts occur. Each line contains two integers CP and NA (1 ≤ CP, NA ≤ 105), describing the analógimôn’s CP and NA, respectively. There are no two analógimôns with the same CP.The input ends with end-of-file (EOF).","level":7,"name":"Gym","has_images":false,"description":"Analógimôn Go! is a very popular game. During his quest, the player travels across many cities capturing virtual little monsters called analógimôns. The cities contain specifics locations called gyms. When entering a gym, a player may try to put one of his analógimôns inside the gym.\r\n\r\nThere are two integers associated to each analógimôn: its Combat Power (CP) and its Number of Attacks (NA). Also, there is an integer associated to each gym, its Power Interval (PI). When trying to put an analógimôn inside a gym, the game calculates the number of análogimôns that are already in the gym and which difference of its CP and the CP of the analógimôn being put is at most PI. If this number is less than or equal to the NA of the analógimôn being put, then that analógimôn is successfully put in the gym. Otherwise, it is not put in the gym. In both cases, analógimôns that were already in the gym continue in the gym.\r\n\r\nFor example, consider a gym with PI=3 containing analógimôns whose CPs are equal to 5, 8, 13 and 20. If a player tries to put an analógimôn with CP=10 and NA=4, the game will count how many analógimôns are in the gym with PC between 10 - 3 = 7 and 10 + 3 = 13, inclusive. Since there are 2 of such analógimôns, the little monster is successfully put in the gym, since 2 ≤ 4. The gym now contains analógimôns whose CPs are equal to 5, 8, 10, 13 and 20.\r\n\r\nGiven the information about a gym and the analógimôns tried to be put in it, determine how many analógimôns will be inside the gym after all attempts. Consider that, initially, the gym is empty (i.e., it has no analógimôn inside it).","id":"2538","category":"Data Structures and Libraries","statistics":{"level":"7 / 10","submissions":265,"solved":113,"ratio":"42.64%"}}