{"output":"For each test case, print a line containing an integer indicating the maximum number of attractions you can visit.","input":"The input contains several test cases. The first line of each test case contains the integer N (1 ≤ N ≤ 40). The second line contains two integers G and Y (0 ≤ G, Y ≤ 20), the number of green tickets and yellow tickets you initially have. The next N lines describe the attractions, in the order from the entrance to the exit. Each line contains two integers Gi and Yi (-20 ≤ Gi, Yi ≤ 20, Gi×Yi < 0). If Gi < 0, the attraction requires |Gi| green tickets to be visited, and, if visited, presents you with Yi yellow tickets. Otherwise, it requires |Yi| yellow tickets and, if visited, presents you with Gi green tickets.The input ends with end-of-file (EOF).","level":8,"name":"Tour in FdI","has_images":false,"description":"The Nlogonian Aquatic Surf Championship is about to start! Next year, the big final will be hosted in the city of Foça do Iguachim (FdI)! The city is famous due to the National Park of Iguachim, that has many attractions. The most famous of them is the Cataratas of Iguachim, one of the most famous touristic spots in Nlogonia!\r\n\r\nThe park has N attractions, numbered from 1 to N. The attractions are arranged in a straight line in the park. Hence, the park can be described as a large street with entries for the attractions 1, 2, ..., N, where attraction 1 is near to the park’s entrance and attraction N is near to the park’s exit. To keep the order in the park, the attractions must be visited in order, from the entrance to the exit. Hence, if you visit attraction i, you are not allowed to go back and visit attractions 1, 2, ..., i-1.\r\n\r\nAlso, there are two types of tickets in the park: green tickets and yellow tickets. Each of the N attraction requires, as a visitation fee, some amount of tickets of exactly one type. When you enter an attraction, the park may present you with some amount of tickets of the other type, i.e., an attraction that requires green tickets to be visited may give you yellow tickets as a gift, and vice-versa. You are not allowed to enter an attraction if you do not have enough tickets to visit it, but you may choose not visiting it even if you have enough tickets to do so.\r\n\r\nHowever, you wants to enjoy the park the maximum as possible! Given the initial amount of tickets of each type you have and the description of each attraction in the park, determine the maximum number of attractions you can visit.","id":"2553","category":"Paradigms","statistics":{"level":"8 / 10","submissions":409,"solved":180,"ratio":"44.01%"}}