{"output":"For each test case, print a line with the maximum expected total prize Fernando can win, in dollars, rounded with two decimal places.","input":"The input contains several test cases. The first line of each test case contains the integers N and K (1 ≤ N ≤ 1000, 0 ≤ K ≤ N), the number of questions and the number of skips Fernando can use. The second line contains N integers P1, P2 ,..., PN (1 ≤ Pi ≤ 100), the prize for each question. The third line contains N integers C1, C2, ...,CN (0 ≤ Ci ≤ 100), indicating the chance of Fernando correctly answering each question i, without skipping it, in %.The input ends with end-of-file (EOF).","level":7,"name":"University Quiz","has_images":false,"description":"Your university is promoting the University Quiz, a question & answer game about the university! Fernando, a young Computer Science student, is the participant today!\r\n\r\nThere are N questions, numbered from 1 to N. Fernando must answer them in order, and, if he answers question i correctly, he wins Pi dollars as a prize! However, if he answers any question incorrectly, the game is over. Hence, if Fernando incorrectly answers question 1, the game is over and he wins no prize at all; if he correctly answers question 1 but incorrectly answers question 2, he wins the prize for question 1 only; if he correctly answers questions 1 and 2 but incorrectly answers question 3, he wins the prizes for questions 1 and 2 only; and so on. The game also finishes when he correctly answers all N questions. In this case, he wins the sum of the prizes for all of them.\r\n\r\nFernando can use up to K skips. When skipping a question, he wins the prize of that question and the game continues. In practice, the effect of skipping a question is the same as answering it correctly, but without really answering it. For each question i, Fernando knows that the chance of answering it correctly (not skipping it), is Ci %. He wants to determine which questions he should skip (in the case he reaches them) before the Quiz starts. Help him to determine which questions he should skip such that the expected total prize is maximized.\r\n\r\nIn the first sample input below, his best strategy consists on skipping question 2. By doing so, he has a chance of 50% of winning P1=30 dollars, 50% of winning P2=100 dollars (this chance is not 100% even if he skips this question, since he must have correctly answered the first one to win this prize), and 20% of winning P3=50 dollars. The expected total prize is equal to 0.50 × 30 + 0.50 × 100 + 0.20 × 50 = 75. There is no strategy whose expected total prize is higher.","id":"2555","category":"Paradigms","statistics":{"level":"7 / 10","submissions":86,"solved":30,"ratio":"34.88%"}}