{"output":"For each test case, for each operation of the third type, print a line containing its answer.","input":"The input contains several test cases. The first line of each test case contains an integer N (1 ≤ N ≤ 2×105). The second line contains N integers a1,a2,...,aN, Flavio’s initial sequence (0 ≤ ai ≤ 103). The third line contains an integer Q (1 ≤ Q ≤ 2×105), the number of operations. Next Q lines describe the operations. Each operation is described by a line containing:\n\n\n\t1 i v (1 ≤ i ≤ N, 0 ≤ v ≤ 103), indicating the replacement of the i-th number by v; or\n\t2 i j z v (1 ≤ i ≤ j ≤ N, z=13 or 7, 0 ≤ v ≤ 103), indicating the replacement of all occurrences of number z between i-th number and j-th number (inclusive) by v; or\n\t3 i j (1 ≤ i ≤ j ≤ N), indicating the sum of all elements between i-th number and j-th number, inclusive.\n\nThe input ends with end-of-file (EOF).","level":10,"name":"Friday The 13th","has_images":false,"description":"Today is Friday the 13th! According to traditions, both numbers 13 and 7 are considered unlucky numbers. Due to this, some people are careful about these particular numbers!\n\nFlavio has a sequence of N integers numbers, numbered from 1 to N. He wants to execute many operations with it. There are three possible types of operations:\n\n\n\tGiven an integer i and an integer v, replace i-th number by v;\n\tGiven integers i, j, z and v, with z=13 or 7, replace every occurrence of number z by v between i-th number and j-th number, inclusive;\n\tGiven integers i and j, calculate the sum of all elements in the sequence between i-th number and j-th number, inclusive.\n\n\nFor example, if Flavio’s initial sequence is (2, 13, 5, 13, 7) and we replace the 1-th number by 3, the sequence is now (3, 13, 5, 13, 7). If every occurrence of 13 between 4-th and 5-th number are replaced by 6, the sequence is now (3, 13, 5, 6, 7). Finally, the sum of all elements between 2-th and 4-th number is equal to 13 + 5 + 6 = 24.\n\nFor each operation of the third type, calculate and print its answer.","id":"2559","category":"Data Structures and Libraries","statistics":{"level":"10 / 10","submissions":537,"solved":45,"ratio":"8.38%"}}