{"output":"For each test case, print a line indicating the minimum number of times you must use your power so your brother will win the prize number N.","input":"The input contains several test cases. The first line of each test case contains the integer N (2 ≤ N ≤ 100), the number of prizes. Each of the next N-1 lines describes a round, in order. Each line contains two integers Pi and Ri (2 ≤ Pi ≤ N, Ri = 0 or 1), the prize offered at that round and the answer your brother intends to say at that round, respectively. Ri = 0 indicates “no”, while Ri = 1 indicates “yes”.\r\n\r\nNo prize will be offered more than once, and prize 1 will not be offered again.The input ends with end-of-file (EOF).","level":5,"name":"Swap It or Not?","has_images":false,"description":"You probably know TV shows like Swap it or not?, where a participant can win a prize from a simple pen until a house with a pool.\r\n\r\nThere are N prizes, numbered from 1 to N. The participant starts the show with prize number 1. The show has N-1 rounds. At round i, the host asks the participant if he wants to swap his current prize with prize Pi. The participant, not knowing the prize being offered, must answer “yes” or “no”. If he answers “yes”, his current prize is swapped with prize Pi. If he answers “no”, his current prize is not changed. After the last round, the participant takes his current prize.\r\n\r\nThe show is about to begin, and your brother is the participant this time! Before going to the show, he told you the answers he intends to say at each round. However, you have a power that can control his mind! If you use your power at some round, his answer for that round is reversed, i.e., he will say “yes” if he intended to say “no” and vice-versa.\r\n\r\nYou just found out which prize will be offered at each turn. You want your brother to win the prize number N, the most valuable one. What is the minimum number of times you need to use your power in order to ensure he will win the prize number N?","id":"2564","category":"Ad-Hoc","statistics":{"level":"5 / 10","submissions":224,"solved":93,"ratio":"41.52%"}}