{"output":"The output must contain a single integer T, the largest number of territories that can be delimited by the government of Bacon - The Great.","input":"The entry contains multiple rows. In the first one, the integers N (N = 2k), with K the limits (0 <K <11) and G (1 <G <105), the size of the matrix and minimum number of units of gram that must exist in Each new territory.\r\nNext, we follow N-lines with N integers each, describing the Island of Loves, with the j-th element of the i-th line representing the cell m{ij} (0 <m{ij} <300) of the matrix.","level":8,"name":"Capybara Lagoon","has_images":false,"description":"Belo Horizonte is known for hosting one of the most recent historical patrimonies of humanity: the Pampulha Lagoon. Another thing you should know is that it is the home of several capybaras, the largest rodents in the world. But you really should not realize that the society of capybaras is organized as an absolutist monarchy that often has to deal with revolutions and consequent territorial subdivision.\r\n\r\nRecently, the capybaras emerged victorious from the Unification Wars of the Pampulha Lagoon, consolidating their territory and establishing themselves as the dominant rodents of the Lagoa. The king of capybaras, Bacon - The Great - is interested in dividing the ultimate conquest of his people, the Isle of Loves, among his subjects. The Island is a square matrix of order N = 2k, with each cell representing the number of units of gram in a given square meter of the island. To avoid a bloody revolution and the resumption of the Unification Wars, Bacon - The Great - estimates that G units of food in a territory are needed to keep a community of capybara appeased.\r\n\r\nBacon - The Great - has asked you to find out the greatest number of territories that should be formed obeying the following restrictions: (i) all areas must be square matrices; (ii) all territories must have the same area (iii) all cells of the island must be occupied.\r\n\r\nIts task is, given the description of the Isle of Loves and the quantity G of grass, to determine which is the largest number of communities that can be formed by the government of Bacon - The Great.","id":"2574","category":"Ad-Hoc","statistics":{"level":"8 / 10","submissions":202,"solved":49,"ratio":"24.26%"}}