{"output":"A real number rounded to 4 decimal places corresponding to the expected experience to be gained by a pokémon master Ho.","input":"The input consists of two N integers (1 ≤N ≤ 30) and P (1 ≤P ≤106) representing the number of pokémons in the game, and the number of pokeballs available to the player. The next 2*N rows have a string Si (1 ≤ |Si|≤50) (∀1 ≤i ≤N), an integer Ri (1 ≤Ri ≤104) (∀1 ≤i ≤N), an integer ei (1 ≤ei ≤1000) (∀1 ≤i ≤N) and a real of 3 decimal places pi (0.000 ≤pi ≤0.900) (∀1 ≤i ≤N) representing the name of the pokemon i, the number of probabilities to escape from a Battle, the experience gained by capturing it and the probability of the pokémon i break the pokeball, respectively. In the next line Ri real numbers r {i, j} (0.000 ≤r{i, j} ≤1,000) (∀1 ≤i ≤N) (∀1 ≤j ≤Ri) representing the probability of the i-th pokemon escaping Of the battle after the j-th capture attempt. Remember that with every Ri attempts, the values repeat themselves.\n\nNote: It is not guaranteed that if two pokémons appear with the same name in the entry, they will have all values associated.","level":9,"name":"Master Pokémon Ho","has_images":false,"description":"In Belo Horizonte, an electronic game has taken the streets and squares of the city: it is the pokémon Ho. The NlogNintendo startup that created the game did not expect such success. And she just hired you to find out the best way to become a master Pokémon Ho.\n\nIn Pokemon Ho, you have pokeballs that catch pokémons (game creatures). Each time a new Pokémon is captured, experience is gained, however repeated pokémons do not. A pokémon master Ho is a player with a lot of experience. And that's why you want to capture as many different types of Pokémon as possible. However, this is not an easy task. The Pokémon, when trying to be captured, can break the Pokeballs. Some more easily than others. In fact, for each pokémon i we have an associated probability pi of the pokémon to break the pokeball. To prevent some Pokémon from being captured, NlogNintendo assumed that pi ≤0.9. That is, at least 10% chance of catching a Pokémon is guaranteed. Furthermore, after each j-th attempt fails, pokemon i has a probability r {i, j} to escape the battle. If the Pokémon escapes, you can not try to capture it again. Since there are many attempts, NLogNintendo only offers Ri chance of escaping for each pokémon i. The probabilities ri, j, 1 ≤j ≤Ri are repeated at each Ri step.\n\nNlogNintendo sent you the following task: Given the probabilities and capture experiences associated with each Pokemon and a finite number of Pokeballs, find the expected experience value to be obtained by assuming that the Pokemon Master Ho always plays optimally.","id":"2580","category":"Ad-Hoc","statistics":{"level":"9 / 10","submissions":20,"solved":6,"ratio":"30.00%"}}