{"output":"For each pair of text and word, the program must print the position of the first letter present in the text. Mind that the words can be repeated in the text. In this instance, the positions must be printed one in front of other, separated with whitespaces. If the text doesn’t contain the word, return -1 (the number minus one).","input":"The input need be, exactly:\n\n\n\t\n\tThe first line: The N amount of the texts followed by word that must be read (2 ≤ N ≤ 100.000). There is a word for each text.\n\t\n\t\n\tFor the next lines, for each input, the program will be received, respectively:\n\n\t\n\t\t\n\t\tThe text, that contains N characters (10 ≤ N ≤ 128).\n\t\t\n\t\t\n\t\tThe word to be found in the text, that contains M characters (2 ≤ M ≤ 128).","level":5,"name":"Eachians II","has_images":false,"description":"The Eachians are still worried after They found out a new bomb and received a mount of texts from the neighboring planet. They still suspect that there is a pattern in the number represented by a word position in the text. These positions together, they say, represents a key to deactivate a bomb that is about to explode the EACH planet.\n\nYou were then summoned to developing a program that receive a set of a little texts followed by the words and the program need to return the first position of each word that is present in each text.\n\nConstraints:\n\n\n\t\n\tWord: can contain only lowercase letters of the alphabet ('a'-'z').\n\t\n\t\n\tText: can contain only lowercase letters of the alphabet ('a'-'z') separated by one whitespace. Text contains no line break ('\\n') and no special characters.\n\t\n\t\n\tThe size of the words will be never greater than the size of the text.\n\t\n\t\n\tPosition: You should consider that the first position of the text should be position 0 (zero). Thus, in a text with 50 characters, the last position will be the 49.\n\t\n\t\n\tYou should only search for the exactly word. For example, the word SHIP is different from FRIENDSHIP.","id":"2594","category":"Data Structures and Libraries","statistics":{"level":"5 / 10","submissions":1985,"solved":569,"ratio":"28.66%"}}