{"output":"For each test case, the message \" Experimento #e:\", followed by a line break, where e is the number of the test case (whose count begins with the number one) is printed. For each Q command, a line should be printed with the message \"w1/y1 a w2/y2\": dados consistentes\"or\" w1/y1 a w2/y2: dados corrompidos\", where w1, w2 represent weeks (with two digits And with leading zeros if necessary) and y1, y2 represent the years (with four digits and leading zeros, if necessary) of the requested range. For each command M the message should be \"Maior periodo consistente: w1/y1 a w2/y2\". Each message associated with a command must be on a single line and two successive test cases must be separated by a blank line.","input":"The input consists of T (1 ≤ T ≤ 10) test cases, where the value of T is given in the first line of the input. Each test case is represented by several lines: the first row contains the week w (1 ≤ w ≤ 52) and the year y (1 ≤ y ≤ 2015) where the experiment was started (ie where the first record was made ). Consider, for this problem, that each year consists of exactly 52 weeks. The second line contains the number N (1 ≤ N ≤ 105) of consecutive weeks that had registered transition matrices. The following N lines each contain four integer values a11, a12, a21, a22 (-100 ≤ aij ≤ 100), representing the transition coefficients of the matrix At (1 ≤ t ≤ N). Then there is a line with the number M (1 ≤ M ≤ 105) commands to be executed. The following M lines contain commands, following the following formatting:\n\n1. \"Q a b\", with 1 ≤ a ≤ b ≤ N, where a and b are the numbers of the initial and final week of the interval that must be consulted in order to check whether or not there are matrices corrupted in this interval;\n\n2. \"Ut a11 a12 a21 a22\", with 1 ≤ t ≤ N, where t is the number of the week that must have the matrix replaced by the matrix with the coefficients a ii given in this line;\n\n3. \"M\", which is the command that returns the longest interval where all consecutive matrices of the range are consistent (that is, has determinant other than zero).\n\nNote: There will be a maximum of 10^3 'M' commands.","level":9,"name":"On Behalf of The Science","has_images":false,"description":"A group of scientists has been conducting a comprehensive research about the behavior of bacteria, more specifically their reproductive cycle and evolution.\n\nThe data was recorded for weeks, and a series of experiments were carried out each week to determine a transition matrix At, of dimensions 2 x 2, so that the information of the vector ut of week t could be computed through the expression ut = At ut-1, considering the initial value u 0 being known. However, on the eve of the publication of this results in a major scientific journal, an electric discharge corrupted the rigid disks where the matrices were stored!\n\nThe team began the difficult job of trying to retrieve such information in a timely manner. Soon it became clear that some of the matrices recovered had determinants equal to zero, which indicated that the data were corrupted, since all transition matrices should have non-zero determinants.\n\nAssist the team by writing software that, given transition matrices recovered from N weeks, allows:\n\n1. Know if all matrices in a time interval are consistent or if there is any corrupted matrix;\n\n2. Update the matrix At of a given week;\n\n3. Determine the longest time interval where all consecutive matrices are consistent.","id":"2634","category":"Ad-Hoc","statistics":{"level":"9 / 10","submissions":84,"solved":13,"ratio":"15.48%"}}