{"output":"Display the maximum number of crates that can be stolen without being detected.","input":"The first line of input contains two integers r (1 ≤ r ≤ 100) and c (1 ≤ c ≤ 100), the number of rows and\ncolumns in the grid, respectively. Each of the following r lines contains c integers, the heights (in crates) of\nthe piles in the corresponding row. All heights are between 0 and 109 inclusive.","level":9,"name":"Mission Improbable","has_images":true,"description":"It is a sunny day in spring and you are about to meet Patrick, a close friend and former partner in crime.\nPatrick lost most of his money betting on programming contests, so he needs to pull off another job. For this\nhe needs your help, even though you have retired from a life of crime. You are reluctant at first, as you have\nno desire to return to your old criminal ways, but you figure there is no harm in listening to his plan.\n\nThere is a shipment of expensive consumer widgets in a nearby warehouse and Patrick intends to steal as\nmuch of it as he can. This entails finding a way into the building, incapacitating security guards, passing\nthrough various arrays of laser beams – you know, the usual heist techniques. However, the heart of the\nwarehouse has been equipped with a security system that Patrick cannot disable. This is where he needs\nyour help.\n\nThe shipment is stored in large cubical crates, all of which have the same dimensions. The crates are stacked\nin neat piles, forming a three-dimensional grid. The security system takes pictures of the piles once per hour\nusing three cameras: a front camera, a side camera and a top camera. The image from the front camera\nshows the height of the tallest pile in each column, the image from the side camera shows the height of the\ntallest pile in each row, and the image from the top camera shows whether or not each pile is empty. If the\nsecurity system detects a change in any of the images, it sounds an alarm.\n\nOnce Patrick is inside, he will determine the heights of the piles and send them to you. Figure C.1 shows a\npossible layout of the grid and the view from each of the cameras.\n\n\n\nFigure 1: Grid of heights and the corresponding camera views.\n\n\n\nFigure 2: Possible grid of heights after the heist\n\nPatrick wants to steal as many crates as possible. Since he cannot disable the security system, he plans to\nfool it by arranging the remaining crates into piles so that the next set of camera images are the same. In\nthe above example, it is possible to steal nine crates. Figure C.2 shows one possible post-heist configuration\nthat appears identical to the security system.\n\nPatrick asks you to help him determine the maximum number of crates that can be stolen while leaving a\nconfiguration of crates that will fool the security system. Will you help him pull off this final job?","id":"2640","category":"Computational Geometry","statistics":{"level":"9 / 10","submissions":162,"solved":11,"ratio":"6.79%"}}