{"output":"Seu programa deve verificar se a música está em algum tom maior. Em caso afirmativo, seu programa deve imprimir uma única linha com o tom maior (sem acentos) em que a música está. Caso contrário, seu programa deve imprimir uma linha contendo a palavra desafinado. Caso a música possa estar em mais de um tom maior imprima aquele relativo a menor nota musical básica, sendo que “do” < “do#” < “re”, . . .","input":"A primeira linha da entrada terá um número inteiro N, com 1 ≤ N ≤ 105 , correspondente ao número de notas musicais da música. Em seguida, serão fornecidos N números, um por linha, todos entre 1 e 61, inclusive, correspondendo às notas musicais.","level":4,"name":"Escala Musical","has_images":true,"description":"As notas musicais são as unidades mais básicas da composição musical no ocidente. Muitas pessoas acreditam que existem apenas 7 notas musicais:\r\n\r\ndó ré mi fá sol lá si\r\n\r\nChamaremos essas notas de notas elementares. Na verdade, existem notas além destas acima, normalmente identificadas pelo nome de uma das notas acima seguido do símbolo sustenido (#):\r\n\r\ndó dó# ré ré# mi fá fá# sol sol# lá lá# si\r\n\r\nAssim, existem 12 notas musicais básicas distintas. Entretanto, a rigor, esta sequência é infinita e periódica: após um “si” existe um outro “dó”, e a sequência se repete novamente.\r\n\r\nAs notas elementares são mais conhecidas, por estarem em um tom musical conhecido como “dó maior”. Em qualquer tom “maior”, as distâncias entre as possíveis notas seguem um padrão. No tom “dó maior”, por exemplo:\r\n\r\n\r\n\r\nNote que eu poderia usar qualquer “dó” na escala de “dó maior”, pois a nota seguinte ao “si” será, novamente, um “dó”. O mesmo vale para as demais notas. Um outro exemplo de notas em um determinado tom maior seria a escala de “dó# maior”:\r\n\r\n\r\n\r\nGuilherme está aprendendo a tocar um teclado com 61 teclas, numeradas de 1 a 61. Assim, a nota 1 corresponde a um “dó”, a nota 2 corresponde a um “dó #” e assim por diante, até chegar nas notas 60 (um “si”) e 61 (um “dó”).\r\n\r\nAcredita-se que as músicas com as melhores melodias são aquelas que estão em algum tom maior, ou seja, músicas em que todas as notas pertencem à escala de algum tom maior. Enquanto pratica no teclado, Guilherme usa um aparelho que grava todas as notas tocadas durante a música. Para ajudá-lo a melhorar sua técnica você decidiu criar um programa capaz de avaliar as músicas gravadas por ele e determinar se elas estão em algum tom maior ou não.","id":"2662","category":"Ad-Hoc","statistics":{"level":"4 / 10","submissions":748,"solved":419,"ratio":"56.02%"}}