{"output":"For each test case, the output will be displayed in three lines, the first line containing the phrase: \"Endereco de rede: \" followed by the network address in the format of 4 decimal blocks; In the second line the phrase: \"Endereco de broadcast: \" followed by the broadcast address for the network in the format of 4 decimal blocks; In the third line the phrase: \"Numero de maquinas: \" followed by the number representing the number of addresses that can be assigned to the machines in this network. After the three printed lines of a test case, a blank line must be printed, including after the last test case.","input":"The input contains several test cases, each test case occupies one line and represents an IP address and its network mask, which can be in two formats. Address and mask in the form of 4 blocks of bytes with a space separating IP and mask: \"IP1.IP2.IP3.IP4 M1.M2.M3.M4\" with 0 ≤ IP1,IP2,IP3,IP4,M1,M2,M3 ≤ 255 and 0 ≤ M4 ≤ 252, with the restriction that the number formed by the network mask blocks represents a 32-bit number where the 1s (all) bits are to the left of the 0s (all) bits; or in the format \"IP1.IP2.IP3.IP4/M\", the same limits imposed on the IP blocks, and 0 ≤ M ≤ 30. The test cases end with the end of the inputs.","level":7,"name":"Network Mask","has_images":false,"description":"In Internet Protocol (IP) network addressing, an IP address also has a number called \"Network Mask\". The network mask is used to allow, within the universe of possible IP addresses, a network to be isolated in a closed group. Consider the following network address: IP: 192.168.79.74 Netmask: 255.255.252.0.\r\n\r\nThe address itself is a 32-bit address, which here we separates into 4 blocks of 8 bits each for easier reading, the same goes for the address of the mask. Let's write these addresses in binary form:\r\n\r\nIP:      11000000.10101000.01001111.01001010\r\nNetmask: 11111111.11111111.11111100.00000000\r\n\r\nWe can see that the first 22 bits of the netmask are 1s, and the remaining 10 bits are 0s. Many times this address is represented as: 192.168.79.74/22, on account of its 22 bits 1s of the netmask. For this example the exclusive network to which this address belongs is defined by the first 22 bits of the addressing, all the machines belonging to this network have in their first 22 bits the same values. Each machine belonging to the network will use each of the 10 final bits to define a unique address for itself. In this case, this network can define 210 addresses for your machines (actually 210-2, since 2 of them are reserved), ranging from: 11000000.10101000.01001100.00000000 (192.168.76.0) to 11000000.10101000.01001111.11111111 (192.168.79.255). These two specific addresses are reserved, the first represents the network address itself, and the latter represents the broadcast address, thus leaving 1022 possible addresses for each of the machines. You have been asked to present the network information from its IP address with a netmask (which can be in both formats): network address, broadcast address and the number of possible machines on the network.","id":"2672","category":"Ad-Hoc","statistics":{"level":"7 / 10","submissions":107,"solved":42,"ratio":"39.25%"}}