{"output":"As in the given example, make sure the tag was used correctly. Your program should report \"Successful !!\" if the syntax is right or \"error\" if something is missing. The message should be displayed without the quotation marks, with the line break at the end.","input":"The entry contains an integer 0 < N < 100 that indicates the number of situations to check. The next N lines correspond to the situations, each with an integer K (0 or 1) (which will be the means of identifying the tag (s)), and then a line with the S code (0> S <200) to be verified.","level":10,"name":"Help Professor Webscript!!","has_images":false,"description":"Professor Webscript, one of the renowned professors at the Federal Institute of Muzambinho teaches his students to develop fully responsive and practical websites without the need for frameworks. It assists the most diverse types of students across the school, but tired of teaching the correct syntax of the tags (\">\" close and \"<\" opens) correctly. So, to get back the peace and tranquility that he had, he asks for your help.\n\nThere will be several types of tags, there is no need to text the tags, your program should indicate if a tag was used correctly or not. Do not forget that your program should follow some criteria as in the example below.\n\nI - The first parameter indicates the type of the tag:\n1 - When the tag is unique.\n0 - When the tag has two pairs of signals;\n\nII - Signals such as \">\" or \"<\" should only be used to indicate the closing or opening of a tag:\n0 <p> Home> Download> Sublime <\/ p> -> error\n1 <input type = \"text\" name = \"Next>\"> -> error\n0 <ul> <li> Ola <\/ li> <\/ ul> -> Successful\n1 <span> <br> -> right\n0 <> <\/ li> -> error\n\nWhen we enter the parameter, there are only tags of the chosen pattern, for example: if we put 0 (When the tag has two pairs of signals) the program will only check tags with two pairs of signals, the same thing happens when we put 1 tag is unique). So in a single tag there will not be both types.\n ","id":"2684","category":"Ad-Hoc","statistics":{"level":"10 / 10","submissions":458,"solved":28,"ratio":"6.11%"}}