{"output":"Print the row and column of the chair, \"linha > x coluna > y\" (row > x column > y), without quotation marks, where the average of the adjacent ones is less than the height of WBJ and the distance to the exit is the least possible.","input":"The program asks for an integer A (50 < A < 99) refers to its height of WBJ, and then a short x-ray of 13x13 from the cafeteria. It contains the possible locations (0) where it can sit, the exit (Line 1, Column 8), the walls (88), the patio (11), and the corridors (99). The exit will be by EOF.","level":10,"name":"Choosing a Place","has_images":true,"description":"Meals in the cafeteria of the Federal Institute of South Minas (IF), Muzambinho campus, are delicious. Every day students eagerly await to taste their delights. Webscrit Junior (WBJ) is always one of the last on the queue and always finds the place almost full, with only a few free seats. As WBJ is very observant, he walks through the halls looking for places to sit. One place he can sit is an available chair where the average height of adjacent persons in that seat is less than the size of WBJ and always as close to the exit (which is in row 1 column 8, indicated in the figure by number 77, just for easy viewing). All this care to then run in the free spaces, and not lose any second of your favorite subject (AED).\n\nBelow is an example of the empty cafeteria:\n\n\n\nAttention:\n- The priority chair is that one that has the adjacent average less than the height and the smallest way to the exit;\n- There are no seats available on the walls (88), in the spaces outside the cafeteria (11) or in the last places of the table (on the corners); you do not have a good view of the cafeteria sitting closer to the window;\n- Each chair that WEJ passes is considered 1 step;\n- There will be no tie, always have a chair that meets the requirements;\n- The \"00\" of the figure shows where are chairs, ONLY for easier viewing.\n- The exit of the cafeteria is fixed [Line 1 | Column 8] and will always be in this position. In the picture, this position is represented by number 77 only to promote a better visualization.\n- As the output is always fixed, the size of the cafeteria (13x13) is also fixed;\n- The adjacent ones of the chair are all the chairs that are around;\n- The exit (1,8) will always be a wall;\n\nTaking the entry below as an example we have:\n- Chair 1 with position (L = 3 | C = 3);\n- Chair 2 with position (L = 6 | C = 6);\n- Chair 3 with position (L = 8 | C = 12);\n* The count starts from one.\n\nSuppose that chair 1 and 2, located above (as base) meets the criteria of the average of its adjacent. We can conclude that chair 1 is closer to the exit than chair 2, because the number of chairs WBJ will pass to the exit, is smaller. And it is closer than chair 3 (L = 8 | C = 12) which is not only on the table top (a considerable place) but far from the exit.\n\nWhile standing in line, WBJ decided to call you and quickly help you choose the best place.","id":"2688","category":"Graph","statistics":{"level":"10 / 10","submissions":131,"solved":9,"ratio":"6.87%"}}