{"output":"Output a single line with the description of the operation that allows your friend to win the game or an “ * ” (asterisk) if there is no way to win. The description of the operation must follow the format shown on the statement, i.e. “ -x ”, “ +x ” or “ -x +y ”.","input":"The first line contains two integers K (3 ≤ K ≤ 1000) and N (1 ≤ N ≤ 104 ), indicating respectively the integer that Naebbirac chooses at the beginning of the game, and the length of the sequence written on the deck. The second line contains N integers S1 , S2 , . . . , SN (1 ≤ Si ≤ K for i = 1 , 2 , . . . , N) representing the written sequence; you can safely assume that the sequence is not complete.","level":7,"name":"Complete Naebbirac’s Sequence","has_images":false,"description":"Naebbirac is a young and easy-to-get-bored sailor. He likes sequences of integers and to come up with ways to classify them. Naebbirac says that a sequence is complete for a chosen integer K , if the sequence only contains integers between 1 and K , and each integer between 1 and K appears the same number of times.\r\n\r\nBased on that, Naebbirac created a game to entertain himself and his peers, when the waters calm down and there’s not much they can do to spend their time in the middle of the ocean.\r\n\r\nFirst he chooses a positive integer K and then he uses chalk to draw on the deck a sequence S having N integers between 1 and K . After that he challenges one of his peers. The goal of the challenged peer is to turn the sequence S into a complete sequence by performing exactly one of the following three possible operations:\r\n\r\n\r\n\t\r\n\t“-x”: remove one occurrence of integer x from S;\r\n\t\r\n\t\r\n\t“ +x ”: add a new integer with value x in S ; or\r\n\t\r\n\t“ -x +y ”: replace one occurrence of integer x from S by an integer with value y.\r\n\r\n\r\nNaebbirac is quite smart. He never writes a sequence that is already complete and often the written integers don’t follow a pattern, making it quite hard to find an operation that solves the puzzle. One of your friends, that usually sails with Naebbirac, is tired of always losing the game. Are you able to help your friend and create a computer program that can find a solution to Naebbirac’s game before they go on their next trip?","id":"2697","category":"Strings","statistics":{"level":"7 / 10","submissions":572,"solved":201,"ratio":"35.14%"}}