{"output":"For each case, you will have to print the value for E, and if this value does not follow the following property [0, M - 1], you wll have to print -1. Let's go, help Rangel!","input":"There are several case tests. Each case consists of three integers B, N, M where B and N (0 < B, N < 105) and M are a prime number.","level":10,"name":"Unlocking a Cell Phone","has_images":false,"description":"During cryptography class, Rangel is bored.\r\n\r\n-Gu, hey, Gu! - Rangel calls his friend.\r\n\r\n-Hey, man! - Gustavo replies.\r\n\r\n-Can I borrow your phone? - Rangel says hopefully.\r\n\r\n-No way, you are going to comment my social media posts – says Gustavo.\r\n\r\n-Ok – Rangel replies sadly.\r\n\r\nGustavo is a nice guy and does not want to see his friend sad. Considering that in his mind, he calls Vânia and they both come up with a challenge to get rid of Rangel's boredness and make him like cryptography.\r\n\r\n-Let's go Rangel, we challenge you! - say Gustavo and Vãnia, both smiling.\r\n\r\n-Challenge? What kind of challenge? - says Rangel.\r\n\r\n-Don't you want to use my phone? Come on, we have a challenge for you. Do you accept it? - they ask him.\r\n\r\n-Yes, let's do it! - says Rangel, even more curious.\r\n\r\n- OK, we are going to explain it:\r\n\r\nWe are going to change the password of my phone, and you have to find out what it is. It is not going to be an easy task. We will give you three numbers B, N and M, and we want you to find out the fourth number. This number will be my password! However, do not think this is going to be easy, because to discover the fourth number you need to solve the following equation:\r\n\r\nBE = N mod M\r\n\r\nSimple, right? We are interested that you discover the value of E, we assure you that the value of E is between [0, M - 1] and M is a prime number! Hahaha - Come on, you need to be fast! Well, you only have class time to solve!\r\n\r\n-Ok, I'll take it, but I will use my laptop to help me – says Rangel cheerfully.\r\n\r\n-Ok, show me what you can do. - say Gustavo and Vânia.\r\n\r\n-I am going to give you a clue. Remember, Rangel, the value is between [0,M -1], but if it is not, it is -1!\r\n\r\nRangel is ready to take the challenge and decided to use programming to help him out. He asked your help to develop the code. Are you going to turn down this challenge?","id":"2711","category":"Mathematics","statistics":{"level":"10 / 10","submissions":363,"solved":129,"ratio":"35.54%"}}