{"output":"The output is made up of one line per test case containing the amount paid by the elfss to the leprechauns in the local currency.","input":"The first line of the entry contains an integer T that represents the number of test cases to follow. The first line of a test case contains two integers N (2 ≤ N ≤ 103) and K (1 ≤ K ≤ 103) respectively representing the number of elfs living in Christmas Village and the local currency rate charged by each wire passing above the house of an leprechaun. It follows, then, N lines containing two integers X and Y (-104 ≤ X, Y  ≤ 104) each, representing the coordinates of an elf's house in the city. All the houses in Vila Natalina are in integers coordinates and the dimensions of the houses can be ignored.","level":5,"name":"Christmas Village","has_images":false,"description":"After a day of work at Santa's factory, elfs and leprechauns return to their homes in the quiet town of Christmas Village, which lies on the north pole near the factory. Vila Natalina is a beautiful and quiet place to live. White because of the snow and a well planned city since we can imagine the houses as vertices of a huge grid with all vertices containing a house. And they all lived in peace until the day when the elfs, who are fewer, began to say that their houses were very distant from each other and that this made it difficult to communicate among them since to simply talk they had to walk great distances because there are no telephone lines and no cellular network at the North Pole. The leprechauns did not bother with this because they had telepathic powers that eliminated this inconvenience.\n\n\t\t\t\tIf considered wronged the elfs decided to install a telephone network that worked by wire and connected all the elfs houses. And they did it wisely: with as few wires as possible and each strand well stretched to form a straight segment connecting two houses of different elfs. However, since the wires were not underground but above the height of the houses, some leprechauns felt uncomfortable and decided to charge a fee for each wire passed over their house. As the elfs are trying to economize, they obviously built the net in such a way as to pay as little as possible.\n\n\t\t\t\tGiven the location of the house of all the elfs and the fee charged by a leprechaun for each wire that passes over your house, determine the amount paid by the elfs to the leprechauns.","id":"2725","category":"Graph","statistics":{"level":"5 / 10","submissions":189,"solved":108,"ratio":"57.14%"}}