{"output":"The output is composed of one line per test case containing an integer representing the number of ways to choose a group according to requirements.","input":"The first line of the entry contains an integer T that represents the number of test cases. Then there are T test cases. The first line of a test case contains two integers N (1 ≤ N ≤ 50) and K (1 ≤ K ≤ 50) respectively representing the total number of Elves and the determined number of Elves to be boarded on the sled. The second line of a test case contains N integers Pi (1 ≤ Pi ≤ 1018) representing the weight in mg of the Elves. The third and last line of a test case contains two integers A and B (0 ≤ A ≤ B ≤ 1019) representing respectively the weight of the lighter group tested and the weight of the heaviest group tested. Both in mg.","level":9,"name":"Full Sleigh","has_images":false,"description":"It's Christmas Eve, and it's almost time for the sled to leave. Everything is already in Santa's sack and the reindeer in position, there is only one thing left: decide which helpers will work with Noel this year. Yes, contrary to popular belief, the good old man does not do everything himself. He always takes with him a group of elves on his round the world in one night.\n\n\t\t\t\tHowever, the elves must be chosen carefully, because their weight will directly affect the aerodynamics of the Sled. If it is very light it will swing very much during the flight and if it is very heavy it will tire the reindeers very early.\n\n\t\t\t\tAs it is in hurry Noel decided to make a try and chose a group of helpers. But the Reindeers soon accused them of being too light. Then Noel made a second attempt, chose another group. But again the Reindeers complained, however, stating that it was now too heavy. The good old man, who has an appointment time, became irritated and gave an ultimatum to his subordinates: \"That's enough! Choose K elves soon to go in such a way that the sled is neither too light nor too heavy! That is, the sum of the weights can not be less than that of the first group that I tried and neither greater than the second one.\n\n\t\t\t\tOf course the little ones despaired. Apart from the restriction of weights and now the number of Elves that have to be exact, they still have the fact that each Elf weighs twice as much or more than an Elf younger than him. Which obviously only complicates everything.\n\n\t\t\t\tKnowing that all Elves are of different ages can you help these little ones tell how many ways they can choose a group to go with Santa respecting all the requirements?","id":"2726","category":"Mathematics","statistics":{"level":"9 / 10","submissions":95,"solved":28,"ratio":"29.47%"}}