{"output":"For each file in the input, you have an output file. The output file has twelve rows as described in item 7 and 8. As shown in the following output example.","input":"The input consists of several test files. Each test file has two rows. In the first line there are two real numbers A and B (-1000.0 ≤ A, B ≤ 1000.0), separated by white space. In the second line there are two real numbers C and D (-1000.0 ≤ C, D ≤ 1000.0), separated by white space. As shown in the following input example.","level":7,"name":"Floating Number Input and Output","has_images":false,"description":"Your teacher would like to make a program with the following characteristics:\n\n\n\tCreate two variables to store real numbers of simple precision;\n\tCreate two variables to store double precision real numbers;\n\tRead the first simple precision number that will always have a decimal;\n\tRead the second simple precision number that will always have two decimal places;\n\tRead the first double precision number that will always have three decimal places;\n\tRead the second double precision number that will always have four decimal places;\n\tPrint the letter A, a blank, the equals sign, a blank, the number stored in the first variable read in step 3, a comma, a blank, the letter B, a blank, the sign of equal, a space, the number stored in the second variable read in step 4. Do not forget to skip line;\n\tPrint the letter C, a blank, the equal sign, a blank, the number stored in the first variable read in step 5, a comma, a blank, the letter D, a blank, the sign of equal, a space, the number stored in the second variable read in step 6. Do not forget to skip line;\n\tRepeat procedure 7, printing the numbers with one decimal place;\n\tRepeat procedure 8, printing the numbers with one decimal place;\n\tRepeat procedure 7, printing the numbers to two decimal places;\n\tRepeat procedure 8, printing the numbers to two decimal places;\n\tRepeat procedure 7, printing the numbers to three decimal places;\n\tRepeat procedure 8, printing the numbers to three decimal places;\n\tRepeat procedure 7, printing the numbers to three decimal places and in the form of scientific notation with the character E;\n\tRepeat procedure 8, printing the numbers to three decimal places and in the form of scientific notation with the character E;\n\tRepeat procedure 7, printing only the whole part of the number;\n\tRepeat procedure 8, printing only the entire part of the number.","id":"2758","category":"Beginner","statistics":{"level":"7 / 10","submissions":1960,"solved":700,"ratio":"35.71%"}}