{"output":"Write in the output a line containing a number: the smallest multiple of M that can be obtained by adding how many digits are needed to the right or left of N.","input":"The entry contains only one line with the two integers N and M, separated by space.\n\n1 ≤ N ≤ 1012\n\n1 ≤ M ≤ 2 × 105","level":10,"name":"Class","has_images":false,"description":"In a Number Theory class, Professor Gina was showing some properties of multiples of a number. She announced to the students that she would write on the board a multiple of 823. But in a sudden moment of distraction as she pondered the consequences of Burnside's lemma, she wrote the number 234, which was actually the amount of dimensions of the problem in which she thought about the previous dawn.\n\nImpatient, the students began to laugh. \"But teacher, 234 is not a multiple of 823! \"Said the smartest of the class, after using a calculating machine to verify this complex relationship between these two positive integers.\n\nBut Gina is a mathematician prepared for everything. Without thinking much, she replied: I have not finished writing yet. ''Then, he added a digit 1 to the left of the 234 and a digit 5 ​​on the right. Now yes, 12345 is a multiple of 823. She then followed with her explanation.\n\nAlthough she did well, she would like to be better prepared for such situations. As ideas about random problems arise at any moment, she prefers to have a program to save her in similar situations and thus free her mind to attain mathematical nirvana in peace.\n\nHelp Ginny. Given two numbers N and M, say which is the smallest multiple of M which can be obtained by adding digits to the right and / or left of N. Note that you may need to add multiple digits, and that it is not allowed to add digits in the middle of N. Gina does not want to delete the number she has already written, just write more digits to make it multiple of M. Besides that, you may not need to type any additional digits.","id":"2788","category":"Ad-Hoc","statistics":{"level":"10 / 10","submissions":225,"solved":17,"ratio":"7.56%"}}