{"output":"Write in the output a line with \\(N\\) integers separated by a space, which represent the order of the indexes to be excluded.","input":"The entry begins with a line containing an integer \\(N\\), indicating the number of elements in the array. The second entry line has \\(N\\) ntegers separated by space, indicating the order of deletion of the elements. It is guaranteed that, in the values of the second entry line, each of integers from \\(1\\) to \\(N\\) aappears exactly once.\n\n\\(1 \\leq N \\leq 5\\times10^5\\)","level":8,"name":"Golnaldinho","has_images":true,"description":"Golnaldinho was a brilliant football player, having marked passages in all the teams in which he acted during his career, whether national as Grêmio, Flamengo and Atlético-MG, or international, such as Milan, PSG and Barcelona. His genius with the ball in his foot earned him several calls to represent the Brazilian National Team, as well as a legion of fans around the world. This year, in search of new challenges, Golnaldinho decided to retire the boots and venture into the world of computing.\n\n\nThis news surprised several people who did not know the love of Golnaldinho by algorithms and data structures. Such love made the former player spend hours studying the subject while concentrating on football matches. During a press conference at which he announced his retirement, he himself stated that as he improved his programming skills, he was better at field performance.\n\n\nDuring his studies, Golnaldinho found a book of computational problems and he was intrigued by a specific problem, because he could not solve it. Competitive as he is and knowing his programming skills, Golnaldinho challenged him to solve it.\n\n\nThe statement of such a problem is as follows:\n\nSuppose an array with \\(\\displaystyle{N}\\) integers, where the i-th position of this array is occupied by the value \\(\\displaystyle{i}\\)hat is, position 1 is occupied by value 1, position 2 is occupied by value 2 and so on, as can be visualized in the figure below:\n\n\n\nKaka would like to remove all the numbers from this array. However, exclusions to be made must follow a specific order. Thinking about this, Kaká implemented a function that deletes a single element at a time, given the index of the element to be excluded. That is, if Kaka wants to delete element 2 in the array above, it would suffice to inform the index of the element, which in this case is equal to 2. As a result, the function would return the following array after performing the deletion:\n\n\n\nNow, if Kaká wanted to delete element 4 from the array, it would suffice to inform the index that in this case is equal to 3. The function would return:\n\n\n\nThis procedure is performed until there is no more element in the array.\nKaka is having trouble automating calls to this function. This is because you could not implement a script that provides the order of indexes to be excluded, respecting the order of deletion of the elements. That is, if for an array with \\(\\displaystyle{N=5}\\) the order of deletion of the elements is {2,4,5,1,3}, the order of the indices will be {2,3,3,1,1}. Could you help with this implementation?","id":"2792","category":"Ad-Hoc","statistics":{"level":"8 / 10","submissions":765,"solved":220,"ratio":"28.76%"}}