{"output":"Write in the output just one line containing an integer: the number of possible ways Isabel can categorize her stock.\n\n\nSince the answer can be very large, write the its remainder by \\(10^9+7\\).","input":"The entry contains only one line with a sequence of letters indicating the type of clothing in Isabel's shop:  M indicates a masculine clothing and F feminine clothing.\n\n\nThe entrance will contain between \\(2\\) and \\(10^7\\) clothes, and will always have the same number of men's and women's clothing.","level":4,"name":"HM","has_images":true,"description":"\"Men & Women\" is a clothing store in Montes Claros that Isabel leads. This store is very famous for having exactly the same number of men's and women's clothing. Very organized, Isabel wants to categorize her stock of clothes keeping the order in which they are stored.\n\n\n\nOrder in which clothes are stored. In this example we have MFFMFMFFMFMM where F denotes women's clothing and M men's clothing.\n\nIsabel still does not know how many categories she will need. She only decided two criteria:\n\n All categories will have the same number of men's and women's clothing.\n   \n The clothes are already hanging on a large hanger, and to minimize her work, she just wants to place divisions between the categories, without changing any local clothes.\n \n\n\n\nIn the example of the figure, if Isabel uses 2 categories, she can either put the first four clothes in one category and the other eight in the second, put the first six clothes in one category and the last six in the second. Isabel may also prefer to use a category only (encompassing all clothing) or use 3 different categories (separating the clothes in MFFM, FM, FFMFMM), but note that it is not possible to separate into four or more categories keeping the same number of men's clothing and feminine in each.\n\n\nHelp Isabel then define how many ways she can categorize her inventory without violating the company's tradition.","id":"2793","category":"Ad-Hoc","statistics":{"level":"4 / 10","submissions":158,"solved":67,"ratio":"42.41%"}}