{"output":"Write in the output a line containing only one character, which should be S if all rules are being met and Bibika can proceed with the test or N otherwise.","input":"The entry begins with a line containing three integers \\(N\\), \\(M\\) and \\(C\\) separated by space, being the dimensions of the classroom and the number of places that need to be vacant between two students with the same type of test.\nAfter that, there will be \\(N\\) lines, each describing the students in a line of classroom chairs.\nThe \\(i\\)sth of these lines will contain \\(M\\) integers describing  the type of test that the\n tudent sitting in the \\(i\\)-sth chair in each row posses. The integer  \\(0\\) means that the chair is empty,\\(1\\) means that whoever is sitting there is doing type 1 and \\(2\\) means whoever is sitting there is doing the type 2 test.\n\n\\(2 \\leq N, M \\leq 1000\\)\n\\(0 \\leq C \\leq N-1\\)","level":5,"name":"Applying Tests","has_images":true,"description":"Applying a test is not as trivial of a task as some think. Many students try to cheat and it is difficult to observe everyone at the same time. Professor Bibika always makes two completely different types of tests, which she calls test type 1 and test type 2. Furthermore , she has used a technique to position the students so that the occurrence of cheating is minimized. Bibika applies tests in several different classrooms. Let's say that one of your rooms has \\(M\\) rows with \\(N\\) chairs each. The Bibika’s technique consists in guaranteeing two rules:\n\n\n There can be no students in two consecutive rows.\n \n Based on trust in the class, Bibika chooses a $C$ number and requires that in each row, there are at least $C$ vacant places or with different types of tests between two students who have the same type of test.\n \n\n\n\nAs it was difficult to check if the students were following the rules during all the tests, Bibika installed a camera in the ceiling of the room that takes a photo and sends to yours email. Your task is to take this picture, process it and tell Bibika if she can start the test or not. She can only start the test if all rules are being followed.\n\n\n\nSome examples of student organization where all irregularities are circulated.\n\nExample 1 has students in neighboring rows. Examples 2 and 3 have students with the same type of test and between them there are less than \\(C\\) vacant places and / or with students with different type of tests. Example 4 shows a valid configuration.","id":"2797","category":"Ad-Hoc","statistics":{"level":"5 / 10","submissions":196,"solved":85,"ratio":"43.37%"}}