{"output":"The output consists of a single integer value representing the estimate of the minimum cost, in tens of thousands of reais, of constructing the railroad grid project. Or the message \"*\" if the distance matrix has changed.\n\n\t\t\t\tObs: It is guaranteed that the railroads have an integer size in km.","input":"The first line of the entry contains two integers N (1 ≤ N ≤ 450) and K (1 ≤ K ≤ 102), respectively representing the number of strategic cities and the average price, in tens of thousands of reais, of building a railroad . The next N lines contain N integers Di,j (0 ≤ Di,j ≤ 106) each representing the distance in km from city i to city j through the rail network. Di,j ≠ 0 para i ≠ j.","level":8,"name":"Railways","has_images":false,"description":"The North is the largest region of the country in area. With so much territorial extension and its 450 counties it was expected that there would be more Railroads, but this is not the reality. Much of the transportation is still done by highways or waterways.\n\n\t\t\t\tTo address this problem, Farcos has designed a rail network capable of connecting N counties of the North that he believes are strategic to commerce and tourism in the region. In this mesh a railroad always connects two different counties and has two rail lines that make the railroad capable of being traversed in both directions. In addition to always be possible to reach in all other N-1 counties from any countie in the network, either by a direct railroad or passing through other intermediate counties.\n\n\t\t\t\tAt the end of the design of its railway network and knowing the extension in km of each railroad, Farcos calculated which would be the smallest route between all the pairs of counties through the mesh and generated an array of distances which was attached to its design and sent to estimating the cost of producing such a project.\n\n\t\t\t\tAs the network design and matrix were not digitally shipped, the network design was lost and only the distance matrix arrived at the responsible authorities.\n\n\t\t\t\tIts task is to use only the distance matrix and the average price informed to build one railway (regardless of its size), to estimate the lowest cost for the project.\n\n\t\t\t\tHowever, care is needed. There are several people who are interested that the Farcos project does not even get to the analysis and may have altered positions of the distance matrix so that it does not correspond to a possible network designed by Farcos.","id":"2804","category":"Graph","statistics":{"level":"8 / 10","submissions":86,"solved":29,"ratio":"33.72%"}}