{"output":"For each portion you should print one row with the phrase \"porcao tipica\" if the portion is typical, or \"porcao comum\" if the portion is not typical.","input":"The input starts with an integer N, indicating how many typical ingredients there are (1 <= N <= 50). Following there will be N names, representing the N typical ingredients of the region.\r\n\r\nFollowing there will be an integer M, indicating how many portions should be analysed (1 <= M <= 100).\r\n\r\nFollowing there will be M input sets, each representing a portion.\r\nEach of these sets starts with a name Si and a number Ki, representing the name of a portion and the amount of components (typical, common or portions) that make up this portion (1 <= Ki <= 50).\r\nFollowing there will be Ki names, representing the components of this portion Si.\r\n\r\nThe names of all the components are composed of only letters from the alphabet (uppercase or lowercase) and hyphen, and will have at most 50 characters.","level":10,"name":"Typical Ingredients","has_images":false,"description":"The northern region of Brazil is home to a very rich and creative culinary. With typical ingredients, unique spices, peculiar combinations and preparation methods, the dishes of the region always enchant the residents and tourists.\r\n\r\nIn this culinary there are two kinds of ingredients: ingredients typical from the North, and ingredients common to the rest of the country. A portion is a mix of ingredients (typical and/or commons) and/or other portions, and is only considered typical if more than half of its components are typical.\r\n\r\nRafael is visiting the North for the first time, and after a few meals he is very pleased with the local gastronomy. He realized that the more typical components a portion has, the more he is surprised by the taste.\r\n\r\nAfter taking some notes, Rafael asked for your help: Given the list of typical ingredients, and a list of several portions, you must tell which of these portions are typical.","id":"2806","category":"Ad-Hoc","statistics":{"level":"10 / 10","submissions":194,"solved":24,"ratio":"12.37%"}}