{"output":"Display a single integer, the largest possible amount of gasoline that vehicles in a square L will fuel , given that there must be at least one vehicle of each type. If there is no square that characterizes the viewer's doubt, print -1.","input":"The first line of the input has two integers N, M (1 ≤ N, M ≤ 1000), representing the number of pumps and the number of vehicles queued in each pump. They follow N lines, each containing M characters 'C' or 'M' representing a car or a motorcycle, respectively. After this there will be an integer L (1 ≤ L ≤ 1000), representing the size of the square side that the viewer wishes to know","level":8,"name":"Darlan's Gas Station","has_images":true,"description":"One of the consequences of the truck drivers strike was the lack of gasoline across the country. In Santa Rita do Sapucaí, a city in the south of Minas Gerais, it was no different. Hundreds of cars and motorcycles lined up at the last station with gasoline available to fill their tanks before it drained, it looked like a zombie apocalypse movie scene.\n\nThe station has N bombs and in each of them there is a row in a straight line with M veículos (carros ou motos). vehicles (cars or motorcycles). Bellow, there's an illustration of a station with 4 bombs and a row of 2 vehicles per bomb.\n\n\n\t\n\n\nDarlan, owner of the station, limited the amount of gasoline that each car could fuel in 25 liters and each bike in 12 liters. Since all vehicles owners in queues were afraid they would never be able to refuel, they would certainly put the maximum gasoline allowed by Darlan.\n\nThe local TV station team was live with their drone filming the long lines of vehicles around Darlan’s station when a viewer asked a somewhat random question: \"If we take into account that the rows of cars feature a matrix of N lines by M columns, what is the largest amount of gasoline that vehicles in a square of size L will put? Given that in this square there must be at least one vehicle of each type (car and motorcycle).\"\n\nThe TV crew has no idea how to answer this question and needs your help!","id":"2817","category":"Mathematics","statistics":{"level":"8 / 10","submissions":142,"solved":60,"ratio":"42.25%"}}