{"output":"The output consists of one line per test case containing the number of ways to write the letter module 109+7.","input":"The first line of the entry contains an integer T that represents the number of test cases. The first line of a test case contains the integers C (1 ≤ C ≤ 109), N (1 ≤ N ≤ 26) and Q (0 ≤ Q ≤ 103) representing respectively the number of characters in the letter, the number of letters from the beginning of the alphabet that can be used and number of prohibited digraphs. The next Q lines of a test case contain two lowercase characters of the English alphabet each, representing the prohibited digraphs.","level":5,"name":"Letters To Santa","has_images":false,"description":"Giovana is a very smart girl and wants to earn a good Christmas present this year. For this she wants to send a good letter to Santa.\n\n\t\t\t\tAs she is very intelligent, Giovana discovered that those who receive Santa's letters are the Leprechauns, and they can tell if a child is a good boy or a good girl by analyzing the use of digraphs! That's right, by analyzing the number of forbidden digraphs in a letter, the leprechauns can tell whether or not the child deserves a good gift.\n\n\t\t\t\tNot to take risks Giovana wants to send a letter that does not contain any prohibited digraph. Although very smart, Giovana is still very young and does not master the whole grammar. One of your strategies for avoiding mistakes is to use only the first few letters of the alphabet.\n\n\t\t\t\tBesides that, the Leprechauns are very strict! Even though the first character of a digraph is at the end of a word and the second is at the beginning of the next word, the Leprechaun still consider it as a digraph. This made the girl make the dubious decision not to write any space characters in the letter.\n\n\t\t\t\tGiovana is still insecure and has asked for your help. Given the number of characters the letter will have and which letters of the alphabet it will use, your task is to determine how many forms this letter can be written without containing any forbidden digraphs.","id":"2819","category":"Mathematics","statistics":{"level":"5 / 10","submissions":35,"solved":18,"ratio":"51.43%"}}