{"output":"For each test case, your program must print two values ​​separated by a space and followed by endline. The first number is the highest number of cards received by one of the players (it can be any player). The number is the highest possible value considering the sum of all cards (this sum can refer to any of the players).","input":"The input contains two lines. The first line have an integer nCards (1 < nCards  < 60 ) and an integer nPlayers (1 ≤ nPlayers ≤ 10) that means the number of cards and the number of players, separated by a blank space. The second line contains each one of the nCards, separated by a blank space (there is no blank space after the last card).","level":4,"name":"Cards Distribution","has_images":false,"description":"Alan Parina loves to create new games with playing cards. Now he created a new game to play with his friends and wants your help to build a program to do a distribution of the cards based on their values ​​(A is worth 1, J is worth 11, Q is worth 12 and K is worth 13) and in some small rules that are presented below. \n\t\t\t\tAlan selects a number of cards that are in a stack and distributes them sequentially to his friends, from first to last. He can see the value of each card and must ensure that the division is as balanced as possible between all players, considering just the sum of the value of their cards. To make it clear, if for example Alan had 4 cards (3, 6, 2 and 10) to distribute between two players, he would have to give cards 3, 6 and 2 to the first player (sum = 11) and the card 10 to the second player. The division 9 and 12 would be discard because the first rule of the game is that the maximum sum must be as small as possible (11 is less than 12). \n\n\t\t\t\tThere is a second rule that must be respected in this game: once the maximum sum value is established, each player, starting with the first one, should try to keep a sum as close as possible to this value. This can be seen in the first test case (below). By distributing A, 7, 3, 2, 9, 5, 6, J, K, 10, 4 and A cards between 3 players, the first player would get the first 6 cards (A, 7, 3, 2, 9 and 5) whose sum would be 27. The second player would have the next two cards (6 and J) that would sum 17 and the last player would have four cards (K, 10, 4 and A) that would result in 28. The division 22, 22 and 28 wont be accetable because the first player could still take the value card 5 to get 27 (less than limit 28 in this case). Nor could divide into 21, 30, and 15, because we would be surpassing the smallest possible maximum value (which is 28). So we have that the maximum of cards for one of the players would be 6 and the maximum value obtained from the sum of these cards would be 28, which is the answer for the first test case presented below.\n\n\t\t\t\t Obviously we have others rules to play this game, but this can wait for another history.","id":"2821","category":"Data Structures and Libraries","statistics":{"level":"4 / 10","submissions":22,"solved":9,"ratio":"40.91%"}}