{"output":"The output should display the encrypted message according to the friends rule.","input":"The first line of the input consists of a keyword K (3 ≤ K ≤ 45), that represents the key to the cipher. This word is just composed by the alphabet (a-z) in lowercase, without spaces. The next line contains an integer N (1 ≤ N ≤ 150) that indicates how many messages we need to encrypt. The next N lines are the messages. These messages do not pass 105 characters and they are composed by the alphabet (a-z) in lowercase and by spaces.","level":5,"name":"Messaging","has_images":true,"description":"João and Enzo love encrypt their messages. To do this encrypt, they use the Vigènere cipher. This technique is really similar to the Cesar cipher, however its use a specific key for each letter in a word to be encrypted. The below table shows the ciphering pattern, that consists of the repetition of the alphabet 26 times, one time per row of this table, and in each row, the letters are displaced one space left. This 26 rows correspond to the 26 Cesar ciphers.\n\t\t\t\t\n\t\t\t\tA random word is chosen as the keyword and each letter of this word indicates a line of the table to use to cipher or decipher the encrypted message. For example:\n\t\t\t\t\n\t\t\t\t\tThe text to be ciphered is \"computer science\";\n\t\t\t\t\tThe key-word is \"obi\";\n\t\t\t\t\tNow, we should repeat the keyword many times as necessary to compose all the text to be ciphered:\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tcomputer science\n\t\t\t\t\t\t\tobiobiob obiobio\n\t\t\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\tTo do the encryption of the first letter, we should find the line of the letter \"o\" in the table, and look for the column of the first letter of the text to encrypt, \"c\". To the second letter, we should find the line of the letter \"b\" on the column \"i\", and so on, up to we find as result:\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tqpudvbss aqjmbdm\n\t\t\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\tOnce that do the encryption of all words in a message is a hard work, João and Enzo chosen to encrypt only words that initiate with a consonant letter. For this reason, they just apply the keyword on the words that they want to encrypt.\n\t\t\t\tGiven a keyword and a text message, your task is to encrypt this message with Vigènere cipher according to the João and Enzo added rule.","id":"2852","category":"Beginner","statistics":{"level":"5 / 10","submissions":328,"solved":164,"ratio":"50.00%"}}