{"output":"For each road the king considers building, output the maximum distance from a city to it's representative.","input":"The fist line of input consist of a number t (t <= 10): the number of test cases.\n\nEach case starts with a line that contains the number n (2<=n<=100000): the number of cities in the kingdom.\n\nThe following n-1 lines cointain two integers a and b (0<=a,b<n), which means that cities a and b are connected by a road.\n\nThe next line contains a number q (0<=q<=100000), the number of roads the king considers building.\n\nThe following q lines contain two integers i and j (0<=i,j<n), which means the king considers building a bidirectional road from city i to city j. It's guaranteed there is currently no road connecting i and j and this road should not be taken into account in the following queries.","level":8,"name":"Peace in Spar-Ta","has_images":false,"description":"The kingdom of Spar-Ta has grown a lot in the last few years. The king, not being able to oversee all the cities anymore, is going to send representatives to some of them.\n\nThe kingdom is composed of n cities connected by bidirectional road in such a way that there is a unique path between every pair of them. The king will build a new road connecting two currently unconnected cities and choose the cities he is going to send his representatives to.\n\nFor bureaucratic reasons, the representatives must be in constant communication, so the king demands that each one of them can contact two others at neighbouring cities. Of course, money is finite, so no city can have more than one representative and the number of cities with representatives must be as low as possible.\n\nIf there happens to be any issues in any city of the kingdom, the representative that lives the nearest from it must go there to check on the situation. The king fears, though, that if he takes too long the citizens of that city will get mad and might challenge peace in the kingdom. Your work is to determine, for every road the king considers building, what is the largest distance between a city and it's nearest representative.","id":"2860","category":"Data Structures and Libraries","statistics":{"level":"8 / 10","submissions":58,"solved":19,"ratio":"32.76%"}}