{"output":"In a single line, one should write \"Y\" if Tasco is indeed one of the teams that were more times runners-up considering all the championships, or \"N\" otherwise.","input":"The first line of the input consists of the integer 2 ≤ N ≤ 106 which is the number of teams. Each team is labeled by a distinct number from 1 to N, number 1 being reserved for Tasco. In the sequence, there are data from several championships. The first row of each championship is formed by the integer 1 ≤ M ≤ 105 which represents the number of matches occurred in such a championship. Each of the following M lines has the data of a match, in the format \"Team1 Score1 Team2 Score2\", where 1 ≤ Team1, Team2 ≤ N are the codes of the teams that disputed the match and 0 ≤ Score1, Score2 ≤ 100 are their respective numbers of goals. The score of each team in a championship is the sum of the points obtained in each match of the championship. In a match, the score for the team that gets the victory is 3 points, the tie is 1 point and the defeat is 0 points. A team is ahead of another in the championship if they have more points or, in the case of the same number of points, if they have a higher number of goals or, in case of the same amount of goals, if its code is smaller than the other. The end of the championship entry is characterized by reading the value 0 as value of M.","level":8,"name":"Tasco Is Always Runner-up!","has_images":false,"description":"It is well known the provocation that Tasco, one of the best soccer teams in Brazil, is always runner-up of the competitions in which it participates. While this is a compliment (being in such a high position with regularity is indeed a merit!), the Brazilian's inclination to value only the winner leads to the provocative effect to this statement. Of course, this is just another of the countless jokes that are part of the soccer folklore, but Eurico, a Tasco fan, decided to check whether there is any basis in it once and for all, analyzing the historical record of all the competitions in which Tasco participated.","id":"2889","category":"Data Structures and Libraries","statistics":{"level":"8 / 10","submissions":265,"solved":57,"ratio":"21.51%"}}