{"output":"For each input test case your program should print a single line containing the letter 'S' if it is possible to use the existing network as specified, or the letter 'N' otherwise.","input":"The first line of each test case contains two integers N and M separated by a blank space, that represent, respectively, the amount of capital (2 ≤ N ≤ 1.000) and the number of existing fiber optic branches (1 ≤ M ≤ 50.000). The capitals are numbered from 1 to N. Each one of M following lines of a test case contains two integers A and B (1 ≤ A, B ≤ N, A 6= B) separated by a blank space, indicating that there is a branch of fiber linking capital A to capital B. \n\t\t\t\tNote that for data communication the described branch can be used to send messages from both of A to B and that of B to A, but for material transfer it can be used in only one direction. There is at most a single branch of fiber linking a couple of capitals. The end of the entry is indicated by N = M = 0.","level":6,"name":"Series of Tubes","has_images":false,"description":"The year is 2010. The spectacular result of an ultra-secret project, begun three years earlier by a group of researchers from SBC (Brazilian Solutions in Cabling) is about to be released: SBC achieved the prowess of transporting matter through cables optical fiber! The poll runs counter to the famous and controversial phrase of the former US senator and current president who, at the time of the start of the research three years ago, said that \"the internet is not like a cargo truck, where you dump what do you want. The internet is actually a series of tubes \". As a result, the SBC, which currently leases its cable network to a pay-TV operator, is thinking about changing its business and starting the freight transport business - although the technology developed also serves to transport living things , there are political difficulties in the homologation of this means of transportation for human beings. SBC's fiber-optic network covers all the capitals of the country. The network is composed of fiber optic branches and concentrators. There is one concentrator in each capital, and one branch of fiber optic connects directly to a pair of hubs. Not every hub is connected directly by one branch of fiber to all other hubs, but the network is connected. That is, from a given concentrator there is a sequence of branches and concentrators that allows information generated in any of the concentrators can be sent to any other hub in the network. For data communication, it is normal for a fiber optic branch to be used to send messages in both directions. The developed technology, however, has a peculiarity: after a branch of optical fiber is used to transport matter in one direction, the optical fiber keeps a memory of that fact, and from then on this branch can only be used to transport matter in that direction. Hubs are not affected by this steering memory. SBC's research group is very good in physics, but very weak in computing. Therefore, you were hired to determine if the existing fiber optic network could be used by SBC to carry load between any pair of capitals, even considering the sense memory constraint of fiber optic branches.","id":"2899","category":"Ad-Hoc","statistics":{"level":"6 / 10","submissions":41,"solved":14,"ratio":"34.15%"}}