{"output":"The output is a single integer representing the number of leaves of regal victories that were left with some gram of food at the end of the journey of the jaçanã.","input":"The first line of the input contains three integers: P (1 ≤ P ≤ 20000),  C (1 ≤ C ≤ 20000) and N (1 ≤ N ≤ 100). Representing respectively the weight of the bird and the weight of the food it carries. Both given in grams. And the amount of royal-victories leaves lined up between the shores. The next line contains N integers V (1 ≤ V ≤ 40000) separated by a single space. Representing the weights in grams that the leaves of royal-victories, from left to right, support without sinking.\n\n\t\t\tOutput\n\n\t\t\t\n\t\t\t\t The output is a single integer representing the number of leaves of regal victories that were left with some gram of food at the end of the journey of the jaçanã.  \n\t\t\t\n\n\t\t\t\n\n\t\t\t\n\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\t\tInput Samples\n\t\t\t\t\t\tOutput Samples\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t5000 1200 5\n\t\t\t\t\t\t\t6100 5750 5500 5200 5050\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t4\n\n\t\t\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t\n\n\n    \n        \n        \n        \n            \n                \n\t\t\t\t\t800 300 4\n\t\t\t\t\t1200 1000 2000 900\n\n                \n                \n                    2\n\n                \n            \n        \n    \n\n        \n    \n    \n        \n        \n        \n            \n                \n\t\t\t\t\t800 300 4\n\t\t\t\t\t1050 1000 2000 900\n\n                \n                \n                    2\n\n                \n            \n        \n    \n\n    \n\n\n    \n        \n        \n        \n            \n                \n\t\t\t\t\t800 300 10\n\t\t\t\t\t1063 1075 1050 2000 1000 1024 989 900 961 932\n\n                \n                \n                    4\n\n                \n            \n        \n    \n    \n    \n    \n    \n        \n        \n        \n            \n                \n\t\t\t\t\t1000 500 7\n\t\t\t\t\t1400 1200 1123 1000 1000 400 100\n\n\n                \n                \n                    3\n\n                \n            \n        \n    \n    \n\n\t\t\t\n\t\t\t\tIII Maratona de Programação do Norte","level":5,"name":"Jaçanã","has_images":true,"description":"Jaçanã is a bird found in the Amazon region and commonly seen looking for food on the royal-victories that are aquatic plants typical of that region as well. These have a large, circle-shaped leaf with raised edges that lies on the surface of the water and can reach up to 2,5 meters in diameter and withstand up to 40 kilograms.\n\t\t\t\t\n\t\t\t\t\n\n\t\t\t\t One day, a broken-wing Jaçanã wanted to carry a number of insects she had collected to eat from the left margin of an igarapé to the right margin. For this he decided to jump with his food in the beak through a path of royal-victories that lined up between one margin and another. However, the royal-victories had varied sizes, so they held different weights. Then, whenever the jaçanã jumped into a leaf that held less weight than it carried, he had to leave some of his food where it was before jumping. Otherwise, it would sink when landing on the next floor. \n\n\t\t\t\t Note that depending on the capacity of the royal-victories on the path, the bird may not even have reached the right margin. However, it is his nature to go forward in any situation, never going back and always trying to bring as much food to the other margin.\n\t\t\t\t\n\t\t\t\t Their task is, given the weight of the jaçanã, the weight of their amount of insects, and the capacities of royal-victories from left to right, to tell in how many royal-victory leaves the bird left some of its food.","id":"2938","category":"Ad-Hoc","statistics":{"level":"5 / 10","submissions":229,"solved":81,"ratio":"35.37%"}}