{"output":"Para cada caso de prueba tendremos una línea de salida, que contiene \"MORTO\" (muerto) o \"RICO\" (rico) si la caza puede escoger la flor.","input":"La entrada contiene muchas instancias y termina con el final del archivo (EOF). Cada instancia consiste en una línea con seis enteros: R1 (1 ≤ R1) , X1(|X1|), Y1(|Y1|), R2 (R2 ≤ 1000), X2(|X2|), Y2 (Y2 ≤ 1000).\n\t\n\tEl círculo dibujado por el cazador tiene radio R1 y centro (X1; Y1). El círculo que representa el área de la flor tiene un radio R2 y centro (X2; Y2).","level":5,"name":"Flores de Fuego","has_images":false,"description":"Hoy en día una flor de fuego no es una cosa considerada extraña para muchos jóvenes. Esto se debe a que un famoso videojuego popularizó este tipo de flor. En este juego el protagonista ganó superpoderes tocando una flor de fuego, yendo a disparar pequeñas bolas de fuego para derrotar a sus enemigos.\n    \n\tSin embargo, ya se dijo acerca de flores de fuego hace mucho tiempo. En la mitología polaca, las flores de fuego son flores de gran poder místico custodiadas por espíritus malignos. Tenía ese nombre porque era tan brillante que era imposible mirarla directamente. Quién tiene tal flor poseía la capacidad de leer las mentes de los demás, encontrar tesoros ocultos y repeler todo mal.\n    \n\tPara conseguir una flor de fuego, una persona debe buscarla en un bosque antes de la medianoche en la víspera de Kupaly Noc. Exactamente a medianoche, ella florece. Para cosechar sería necesario dibujar un círculo alrededor de ella. Parece una tarea fácil, sin embargo, los espíritus malignos que protegen la flor de todos tratan de distraer a alguien tratando de recoger la flor. Si la persona fracasaba al tratar de dibujar un círculo alrededor de la flor, tendría su vida sacrificada.\n    \n\tDado dos círculos, uno diseñado por un cazador de flores de fuego ambicioso y otro representando el área de la flor, su tarea es determinar si el cazador muere o se enriquece con su conquista.","id":"1039","category":"Geometría Computacional","statistics":{"level":"5 / 10","submissions":12428,"solved":4756,"ratio":"38.27%"}}