{"output":"Para cada caso, imprima el número de caso seguido del tiempo mínimo requerido. Si es imposible moverlos como se describe, imprima 'trapped' en lugar del tiempo. Tenga en cuenta que el primer caso corresponde a la imagen anterior.","input":"La primera línea de entrada es un entero, T (T < 50), que indica el número de casos de prueba. Cada caso comienza con un entero N (2 < N < 10).  Cada una de las siguientes N líneas contiene N caracteres, cada uno llena el laberinto.","level":8,"name":"Vamos Juntos","has_images":true,"description":"Estás jugando un juego de computadora en el que tres robots (Aneed, Ben y Cindy) están atrapados en un laberinto. Inicialmente, los tres están situados en lugares diferentes dentro del laberinto. Hay tres salidas a través de las cuales los robots tienen que salir. Como era de esperar, hay varios obstáculos en el laberinto y los robots no pueden pasar por ellos.\n  \t\n    \n\n\tEl laberinto puede ser modelado como una grilla cuadrada de NxN celdas. Los robots se colocan en tres celdas diferentes del laberinto. Puedes darles órdenes para que se muevan mediante comandos. Se activará un solo comando para los tres robots simultáneamente. Un robot se moverá a una nueva posición si es una celda vacía dentro del laberinto o es una de las celdas objetivo, de lo contrario el comando será ignorado por ese robot. Tu tarea es darles órdenes de tal manera que todos ellos estén en las tres celdas de salida (en cualquier orden).\n\t\n    \n\tLos movimientos son los siguientes (Cada movimiento dura 1 unidad de tiempo):\n\tMover Norte - Los robots se mueven una celda al norte.\n\tMover Este  - Los robots se mueven una celda al este.\n\tMover Sur - Los robots se mueven una celda al sur.\n\tMover Oeste  - Los robots se mueven una celda al oeste.\n    \n\tCada celda consta de uno de los siguientes caracteres:\n\tA – Posición inicial de Aneed\n\tB – Posición inicial de Ben\n\tC – Posición inicial de Cindy\n\t. – Celda vacia\n\t# - Obstáculo\n\tX – Celda objetivo\n    \n\tSuponga que para cada laberinto cada una de las letras (A B C) aparecerá exactamente una vez y la letra X aparecerá exactamente 3 veces.","id":"1057","category":"Graph","statistics":{"level":"8 / 10","submissions":908,"solved":264,"ratio":"29.07%"}}