{"output":"Para cada caso, muestre el número de caso seguido por el número de configuraciones válidas.","input":"La primera línea de entrada es un entero T (T<100) que indica el número de casos de prueba. Cada caso consta de dos líneas. La primera línea es un entero P (2 < P < 40 y P es un múltiplo de 3). P representa el número de pelotones. La siguiente línea consiste en un string de tamaño P. Cada carácter de la cadena es 'R' o 'B'. El string da la posición de los pelotones en el orden de las agujas del reloj. 'R' indica rojo y 'B' indica negro. La posición inicial se elige arbitrariamente. Por lo tanto, el ejemplo anterior puede representarse por cualquiera de los siguientes: 'RBBBRB', 'BBBRBR', 'BBRBRB', 'BRBRBB', 'RBRBBB' o 'BRBBBR'.","level":9,"name":"Zonas de Ataque Independientes","has_images":true,"description":"Una técnica común, utilizada por los ejércitos invasores, es rodear una ciudad en lugar de entrar directamente en ella. Los ejércitos se dividen en pelotones que rodean de manera circular la ciudad. Para tomar el control interno de la ciudad, los pelotones se agrupan de a tres para cubrir regiones triangulares. Es obligación del General asegurar que no hay dos regiones triangulares superpuestas. Desafortunadamente, el proceso es más complicado porque hay dos tipos de ejércitos en la fuerza invasora. Los dos ejércitos diferentes se conocen como Ejercito Rojo y Ejercito Negro. Un pelotón consiste de un solo tipo de ejército. Mientras que el Ejército Negro tiene clara intención de servir al General, los Rojos podrían traicionarlo si tienen una oportunidad. Se decide que cada grupo triangular consistirá de como máximo un pelotón del Ejército Rojo para que los Rojos no dominen en ninguna asignación.\n    \n\tSupongamos que tenemos 6 pelotones (4 negros y 2 rojos) como se muestra en la siguiente figura:\n\t\n\t\n\t    \n\tComo hay 6 pelotones, podemos formar 2 grupos (6/3 = 2). Hay dos posibles arreglos para esta configuración.\n\t\n\t\n\t\n\t\n\tProblema: Recibirás el número de pelotones y sus colores correspondientes. Tendras que averiguar el número de configuraciones posibles, de tal manera que, cada pelotón forma parte de, exactamente, un grupo y también cumple con las restricciones anteriores.","id":"1058","category":"Paradigmas","statistics":{"level":"9 / 10","submissions":297,"solved":91,"ratio":"30.64%"}}