{"output":"La salida contiene las líneas que corresponden al número de casos de prueba. Cada línea contiene una secuencia de  I y R\n\tnecesarias para producir la salida. Si es imposible generar la secuencia I/R, se debe mostrar el mensaje \"Impossible\".","input":"La entrada consiste de varios casos de prueba, donde cada uno es un conjunto de tres líneas.\n\tLa primer línea es un número entero que representa el número de vagones. La segunda línea contiene la secuencia de entrada y la tercer línea\n    presenta la secuencia de salida deseada. La última línea de la entrada contiene solamente 0, indicando el final de la entrada.","level":4,"name":"Rieles Nuevamente... Trazando Movimientos","has_images":true,"description":"¿Recuerdas la estación de trenes de PopPush City? Para que recuerdes, es una estación de trenes en un país increíblemente montañoso.\nLa estación fue construída en el siglo pasado y desgraciadamente, los fondos eran extremadamente limitados en ese momento. Sólo fue posible construir vías superficiales.\nAdemás, resultó ser que la estación sólo podía estar al final de las vías (ver imagen), y debido a la falta de espacio disponible, sólo podía tener una vía.\n\n\n\n\n\n\t\n\n\tCada vagón que llega desde la dirección A debe continuar en la dirección B, pero con una reorganización determinada. Se puede asumir que cada uno\nde los vagones puede ser desconectado del tren antes de entrar a la estación y que pueden moverse por su cuenta hasta llegar a la vía\nen la direccion B para ser conectados a la otra locomotora. También se puede suponer que en cualquier momento en la estación hay tantos vagones como sea necesario.\nPero una vez que un vagón entró a la estación, no puede volver a la vía en la dirección A y también una vez que se fue de la estación en la dirección B no puede volver a la estación.\n\n\n\n\n\tTodos los vagones son identificados por letras de la  a a la z,\n todas en minúscula. Esto da 26 vagones como máximo. El jefe de reorganización de trenes debe saber que secuencia de movimientos es necesaria para conseguir la salida deseada para\nseguir yendo de la estación a la dirección B. Los movimientos adentro y afuera de la estación son descriptos por las letras  I y R\n(Insertar y remover respectivamente). Utilizando la figura de ejemplo, la entrada e,t,d,a y la salida deseada d,a,t,e, resulta en los movimientos I,I,I,R,I,R,R,R","id":"1063","category":"Estructuras de Datos y Bibliotecas","statistics":{"level":"4 / 10","submissions":5835,"solved":2062,"ratio":"35.34%"}}