{"output":"Para cada caso de prueba, imprima el mensaje Caso #n: indicando el número de caso de prueba (como se muestra a continuación). Seguido el vértice de cada segmento, un segmento por linea, separado por comas (incluyendo una coma al final de la línea).\nFinalizado el caso de prueba se debe imprimir un mensaje indicando el número de componentes conectados del grafo.\nCada caso de prueba debe tener una línea en blanco impresa al final, incluyendo la última.\n                \n                Importante: Los vértices deben imprimirse en orden ascendente y si existe un arco de a a b significa que existe un arco de b a a.","input":"La primera línea del archivo de entrada contiene un entero N que representa el número de casos de prueba que siguen. \n                    Cada caso de prueba contiene 2 números V y E, respectivamente el número de Vértices(V) y Aristas(E) del grafo. Las siguientes E líneas, cada una representa una de las aristas que conectan tal vértice. Cada vértice está representado por una letra minúscula del alfabeto. Esto significa 26 vérticos como máximo (a-z). Cada grafo tiene al menos un componente conectado.\n                    \n                    \n                    Observación: El vértice de cada caso de prueba comienza siempre con 'a'. Esto significa que un caso de prueba con 3 vértices tiene el vértice 'a', 'b' y 'c'.","level":4,"name":"Componentes Conectados","has_images":true,"description":"Basado en estas tres definiciones:\n                    \n                    Grafo conectado: Un grafo G (V, E) está conectado si para cada par de nodos u y v hay un camino entre u y v. Un grafo con un solo componente es un grafo conectado.\n                    \n                    Grafo desconectado: Un grafo G (V, E) está desconectado si está formado por 2 o más componentes conectados.\n                    \n                    Componente conectado: Los componentes conectados de un grafo son subgrafos conectados de ese grafo.\n                    \n                    El siguiente grafo tiene 3 componentes conectados. El primero está formado por los nodos a, b, c. El segundo está formado sólo por el nodo d, y el tercer componente está formado por los nodos e y f.\n                \n                    \n                    \n                \n                    Basándose en estos conceptos, donde cada entrada tiene identificación de cada uno de los vértices, aristas y los enlaces entre los nodos por las aristas, lista todos los componentes conectados que existen en el grafo, de acuerdo con la entrada dada.","id":"1082","category":"Graph","statistics":{"level":"4 / 10","submissions":7640,"solved":2609,"ratio":"34.15%"}}