{"output":"Como salida, para cada expresión de entrada se debe generar una línea que indica el resultado del procesamiento. Si la expresión es correcta, debe ser tranformada a la forma posfija. Si no es posible, los mensajes deben imprimirse indicando Lexical Error o Syntax Error en ese orden.","input":"En la entrada, son válidos:\n\t\t\t\t\t\ta) Operandos: Todas las letras mayúsculas y minúsculas ('a'...'z', 'A'...'Z') y números (0...9).\n\t\t\t\t\t\tb) Paréntesis.\n\t\t\t\t\t\tc) Operadores: Son aceptados todos los operadores siguientes con la prioridad mostrada en la tabla:\n\t\t\t\t\t\n\n\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\tOperador\n\t\t\t\t\t\t\tPrioridad\n\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t^\n\t\t\t\t\t\t\t\t6\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t*,/\n\t\t\t\t\t\t\t\t5\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t+,-\n\t\t\t\t\t\t\t\t4\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t>,<,=,#,\n\t\t\t\t\t\t\t\t3\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\tAND ( . )\n\t\t\t\t\t\t\t\t2\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\tOR ( | )\n\t\t\t\t\t\t\t\t1\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\n\n\t\t\t\t\tPara hacer su trabajo un poco más fácil, debe utilizar el punto como AND (.) y el pipe como OR (|).\n\n\t\t\t\t\tNo se permitirán expresiones con operadores unarios. Ejemplo: 4 * -2\n\n\t\t\t\t\tEl final de la entrada se determina por el final de archivo EOF().","level":7,"name":"LEXSIM - Validador Léxico y Sintáctico","has_images":false,"description":"Uno de los usos mas interesantes de la pila es en la evaluación de una expresión matemática. Podemos, a través de la pila, hacer el análisis léxico de la expresión (indicando si una expresión válida tiene un operando no inválido -un símbolo que no esta presente en la tabla de operadores o un simbolo que no esta presente en la tabla de operandos) y también el análisis. El análisis sintáctico puede indicar que falta uno o más paréntesis, olvidado uno o mas corchetes, olvidado al operador, dos operandos sucesivos, etc. La tarea aquí es determinar si una expresión es correcta o no lo es.","id":"1083","category":"Estructuras de Datos y Bibliotecas","statistics":{"level":"7 / 10","submissions":1539,"solved":389,"ratio":"25.28%"}}