{"output":"Para cada caso de prueba en la entrada, su programa debe imprimir una línea con un solo entero, la longitud de la secuencia más corta que satisfaga las restricciones de Juan, o la palabra \"impossivel\" (minúscula, que significa \"imposible\" en portugués) en caso de que sea imposible.","input":"La entrada contiene varios casos de prueba. La primera línea de un caso de prueba contiene un entero M (1 ≤ M ≤ 2000), que representa el número total de palabras compiladas por Juan. La segunda línea contiene dos cadenas distintas O y D, separadas por un espacio, indicando respectivamente el idioma de inicio y el idioma de finalización. Cada una de las siguientes M líneas contiene tres cadenas I1, I2 y P, separadas por un espacio, representando respectivamente dos idiomas y una palabra en común entre ambos idiomas  (I1 e I2 son siempre distintos). Todas las cadenas tendrán una longitud de al menos 1 y como máximo 50, y estarán compuestas sólo por letras minúsculas. El mismo par de lenguajes puede tener varias palabras asociadas a él, pero una palabra P nunca será repetida en un caso de prueba.\n                    El final de la entrada se indica mediante una línea que contiene sólo un cero.","level":7,"name":"Babel","has_images":false,"description":"Juan y María son hermanos y son entusiastas acerca de sus cursos de idiomas extranjeros. Cada uno está tomando varios cursos de idiomas. Cuando llegan a casa comentan sobre gramática, vocabulario, cultura de los diferentes países y así sucesivamente. En una de esas conversaciones se dieron cuenta de que algunas palabras son comunes a más de un idioma, aunque las palabras pueden tener diferentes significados en los idiomas. Por ejemplo, la palabra \"amigo\" existe en portugués y español y tiene el mismo significado, mientras que \"date\" es una palabra que existe en inglés y francés y puede tener diferentes significados, ya que \"date\" es también un fruto, además de significar una fecha del calendario. Por otro lado, \"red\" en español es una red, mientras que en inglés es un color.\n                    Emocionados por estos hallazgos, los hermanos decidieron escribir en un bloc de notas todas las palabras en común que pudieran pensar, asociando cada palabra a un par de idiomas. Observador e inteligente, Juan propuso un desafío a María: dado un idioma para comenzar y un idioma para finalizar, escribir abajo una secuencia de palabras tal que la primera palabra se incluya en el vocabulario del idioma de inicio y la última palabra se incluya en el vocabulario del idioma final. Dos palabras adyacentes en la secuencia deben estar en el vocabulario del mismo idioma. Por ejemplo, si el idioma de inicio es el portugués y el idioma de finalización es el francés, María podría escribir la secuencia \"amigo actual date\" (portugués / español, español / inglés, inglés / francés).\n                    Para sorpresa de Juan, María resolvió el problema con bastante facilidad. Molesto por el éxito de su hermana, decidió hacer el problema más difícil: María debe encontrar una solución en la que la secuencia tenga el número más pequeño de letras en total (sin contar espacios entre palabras), y, además, dos palabras consecutivas no deben tener la misma letra inicial.\n                    Note que la solución anterior no es válida, ya que \"amigo\" y \"actual\" comparten la misma letra inicial. Sin embargo, es posible encontrar otra solución, \"amigo red date\", con una longitud total igual a 12.\n                    Juan hizo una extensa investigación en Internet y compiló una enorme lista de palabras, y desafió a María a resolver el problema. Como puede haber más de una solución, él le pidió que contestara si hay una solución, y en ese caso contestar el número de letras en la mejor solución. ¿Puedes ayudar a María?","id":"1085","category":"Graph","statistics":{"level":"7 / 10","submissions":1949,"solved":585,"ratio":"30.02%"}}