{"output":"Para cada uno de los casos de prueba, tu programa debe imprimir una sola línea, conteniendo un entero, el número más pequeño de tablas necesitadas para cubrir todo el piso, satisfaciendo las restricciones establecidas. Si no es posible cubrir todo el piso satisfaciendo las restricciones establecidas, imprimir una línea con la palabra \"impossivel\" (que significa imposible en portugués).","input":"La entrada contiene varios casos de prueba. La primera línea contiene dos enteros N y M que indican las dimensiones, en metros, del salón de baile (1 ≤ N,M ≤ 104). La segunda línea contiene un entero L que representa el ancho de las tablas, en centímetros (1 ≤ L ≤ 100). La tercera línea contiene un entero K, indicando la cantidad de tablas donadas (1 ≤ K ≤ 105). La cuarta línea contiene K enteros Xi, separados por espacios, que representan el largo, en metros, de una tabla (1 ≤ Xi ≤ 104 for 1 ≤ i ≤ K). El final de entradas es indicado por una línea conteniendo solamente dos ceros, separados por un espacio.","level":8,"name":"El Salón de Baile del Club","has_images":true,"description":"El club social Tingua está construyendo su nuevo salón de baile. Los miembros del club desean que el piso esté cubierto con tablas de madera, ya que ellos consideran que es lo mejor para bailar. Una maderera de la zona donó una gran cantidad de tablas de madera de buena calidad para ser usadas en el salón de baile. Las tablas donadas tienen todas el mismo ancho, pero tienen distintos largos.\n\n\n\tEl salón de baile es un rectángulo con dimensiones de N x M metros. Las tablas deben ser colocadas yuxtapuestas, así ninguna tabla se superpone con otra, y todo el piso debe estar cubierto. Deben estar alineadas, a lo largo, con uno de los lados del salón de baile, y todas las tablas deben ser paralelas. Los miembros del club no quieren muchas uniones en el piso, y si una tabla no es suficientemente larga para cubrir la distancia entre dos lados opuestos del salón de baile, se puede unir con, como mucho, una sola tabla más para completar la distancia. Además, el carpintero en jefe tiene un gran respeto por todas las maderas, y prefiere no ver ninguna tabla. Por lo tanto, él quiere saber si es posible cubrir el piso con el set de tablas donadas, observando las restricciones descriptas; en caso de que sea posible, el carpintero en jefe desea saber el menor número de tablas que puede usar.\n\n\t\n\n\tLa figura de arriba representa dos posibles formas de cubrir el piso del salón de baile con dimensiones de 4 x 5 metros con un set de 10 tablas donadas, con 100 cm de ancho, y largos de 1,2,2,2,2,3,3,4,4 and 5 metros.","id":"1086","category":"Ad-Hoc","statistics":{"level":"8 / 10","submissions":3632,"solved":885,"ratio":"24.37%"}}