{"output":"Para cada caso de prueba en la entrada el programa debe mostrar una sola línea, conteniendo un solo entero, el número de picos que existen en el loop musical.","input":"La entrada consiste de varios casos de prueba. La primer línea de un caso de prueba contiene un entero  N, que representa el número de muestras en el loop musical compuesto por Fernanda (2 ≤ N ≤ 104), \r\n\tLa segunda línea contiene N enteros Hi separados por espacios, que representan la secuencia de magnitudes muestreadas (-104 ≤ Hi ≤ 104 para 1 ≤ i ≤ N, H1 ≠ HN y Hi ≠ Hi+1 para 1 ≤ i < N). Nótese que H1 sigue a HN cuando el loop es reproducido.\r\n                                                                                                                                                                                                                                                                                                                                                                                \r\n\tEl fin de la entrada se indica por una línea que contiene un solo cero.","level":3,"name":"Loop Musical","has_images":true,"description":"Un loop musical es una pequeña sección de música compuesta para ser reproducida de manera continua (o sea, la sección se reproduce de vuelta cuando llega al final). Los loops son utilizados en varios estilos de música popular (hip hop, techno, etc), así como también en juegos de computadora, especialmente juegos simples de Internet.\r\n \r\n\tLos loops pueden ser digitalizados por ejemplo utilizado PCM (Pulse Code Modulation), una técnica para representar señales analógicas muy utilizada en audio digital. En PCM, la magnitud de la señal es muestreada a intervalos regulares, y sus valores muestreados son guardados en secuencia. Para producir el sonido de los datos muestreados, el procedimiento es aplicado en reversa (demodulación).\r\n\r\n\tFernanda trabaja para una empresa de desarrollo de juegos, y compuso un hermoso loop musical, codificado en PCM. Analizando la forma de onda (Waveform) de su loop en un software de edición de audio, a Fernanda le llamó la atención el número de \"picos\". Un  pico  en una onda (Waveform) es el valor de una muestra que representa un máximo o un mínimo relativo. La figura de abajo ilustra (a) una forma de onda (Waveform) y (b) el loop formado con esta onda (Waveform), el cual contiene 48 picos.\r\n  \r\n\t\r\n\r\n\tFernanda es tu amiga, y te pidió ayuda para determinar la cantidad de picos que existen en su loop musical.","id":"1089","category":"Ad-Hoc","statistics":{"level":"3 / 10","submissions":9123,"solved":4728,"ratio":"51.83%"}}