{"output":"Para cada caso de prueba, tu programa debe imprimir una sola línea, conteniendo un entero, indicando el mayor número de sets que se pueden armar con las cartas dadas.","input":"La entrada tiene varios casos de prueba. La primer línea de un caso de prueba contiene un entero N (3 ≤ N ≤ 30000), indicando el número de cartas en la mesa. Cada una de las siguientes N líneas contienen la descripción de una carta.\n\n\tLa descripción de una carta es dada por dos palabras, separadas por un espacio. La primer palabra es:\n\n\t\n\t\t\"um\" (uno en Portugues); o\n\t\n\t\t\"dois\" (dos en Portugues); or\n\t\n\t\t\"tres\"\n\n\n\tindicando el número de figuras en la carta. La segunda palabra es\n\n\t\n\t\t\"circulo\" o \"circulos\"; o\n\t\n\t\t\"quadrado\" o \"quadrados\" (cuadrado en Portugues); o\n\t\n\t\t\"triangulo\" o \"triangulos\"\n\n\n\tindicando el tipo de figura en la carta. El fin de la entrada es indicado por una línea que contiene solo un cero.","level":10,"name":"Set","has_images":true,"description":"Set es un juego de cartas en el cual cada carta tiene una, dos o tres figuras. Todas las figuras, en una carta dada, son iguales. Las figuras pueden ser círculos, cuadrados o triángulos. Por lo tanto, cada carta tiene dos características: el número de figuras y el tipo de figura. Un set es un grupo de tres cartas tal que, por cada característica (número y figura), las tres cartas sean iguales o las tres sean diferentes.\n\n\tPor ejemplo, en la imagen debajo, (a) es un set válido, dado que todas las cartas tienen la misma figura y todas tienen un número diferente de figuras. En el ejemplo (b), tanto el tipo de figuras como el número de figuras son diferentes, haciéndolo un set válido. Por otro lado, (c) no es un set válido, dado que las dos últimas cartas tienen la misma figura, que es diferente de la figura en la primer carta.\n\n\n\t\n\n\n\tEl objetivo del juego es formar el mayor número posible de sets con las cartas que hay en la mesa. Cuando se forma un set, las tres cartas son sacadas del juego.\n\n\tCuando hay pocas cartas en la mesa, es fácil determinar el mayor número de sets que se pueden formar; sin embargo, cuando hay muchas cartas en la mesa el número de combinaciones es demasiado grande. Un amigo quiere practicar para el Campeonato Mundial de Set, y te ha pedido que escribas un programa que calcule el mayor número de sets que se pueden formar con un grupo de cartas dado.","id":"1090","category":"Ad-Hoc","statistics":{"level":"10 / 10","submissions":1172,"solved":94,"ratio":"8.02%"}}