{"output":"Para cada caso de prueba de entrada, el programa debe imprimir una línea conteniendo:\r\n\t\r\n\r\n\t\r\n\t\tla palabra divisa (significa frontera en Portugues) si la residencia esta en una de las lineas frontera (Norte-Sur or Este-Oeste);\r\n\t\r\n\t\tNO si la residencia esta en Nlogonia del Noroeste;\r\n\t\r\n\t\tNE si la residencia esta en Nlogonia del Noreste;;\r\n\t\r\n\t\tSE si la residencia esta en Nlogonia del Sureste;;\r\n\t\r\n\t\tSO si la residencia esta en Nlogonia del Suroeste;.","input":"La entrada contiene varios casos de prueba. La primer línea de un caso de prueba contiene un entero K indicando el número de consultas que se van a realizar (0 < K ≤ 103). La segunda línea del caso de prueba contiene dos enteros N  y M que representan las coordenadas del punto de división (-104 < N, M < 104). Cada una de las K lineas siguientes contiene dos enteros X y Y representando las coordenadas de residencia (-104 ≤ X, Y ≤ 104).\r\n\r\n\tEl final de la entrada es representado por una línea con un solo cero.","level":1,"name":"Division de Nlogonia","has_images":true,"description":"Luego de siglos de hostilidades y escaramuzas entre las cuatro naciones viviendo en la tierra generalmente conocida como Nlogonia, y años de negociaciones involucrando diplómaticos, políticos y las fuerzas armadas de todas las partes interesadas, con mediacion por la ONU, OTAN, G7 y la SBC, fue finalmente acordado por todos la forma de terminar la disputa, dividiendo la tierra en cuatro territorios independientes.\r\n    \r\n\t\r\n\tFue acordado que un punto, llamado punto de división, con coordenadas establecidas en las negociaciones, definiría la division del país en la siguiente manera: dos líneas, ambas conteniendo al punto de división, una en la dirección Norte-Sur y otra en la dirección Este-Oeste, serían dibujadas en el mapa, diviendo así la tierra en cuatro nuevos países. Comenzando desde el cuadrante Oeste-Norte, en la dirección de las agujas del reloj, los nuevos países serían llamados Nlogonia del Noroeste, Nlogonia del Noreste, Nlogonia del Sureste y Nlogonia del Suroeste.\r\n\r\n\t\r\n\t \r\n\r\n\tLa ONU determinó que debe existir una página de Internet de tal manera que los habitantes puedan registrar en que país están sus casas. Y tú fuiste contratado para ayudar en la implementación del sistema.","id":"1091","category":"Ad-Hoc","statistics":{"level":"1 / 10","submissions":9134,"solved":5801,"ratio":"63.51%"}}