{"output":"Para cada caso de prueba de la entrada, tu programa debe imprimir una sola línea, conteniendo el tamaño de la mayor submatriz que, linealizada, resulta en una secuencia creciente.","input":"La entrada contiene varios casos de pruebas. La primera línea de un caso contiene dos enteros N y M indicando las dimensiones de la matriz (1 ≤ N, M ≤ 600). Cada una de las siguientes N líneas contiene M enteros, separados por un espacio, describiendo los elementos de la matriz. El elemento Xi,j de la matriz es el entero en la posición j de la línea i en la entrada (-106 ≤ Xi,j ≤ 106).\n\n\tEl fin de la entrada es indicado por una línea conteniendo dos ceros, separados por un espacio.","level":10,"name":"Subsecuencia Creciente Máxima","has_images":true,"description":"El problema de determinar la subsecuencia creciente máxima en una lista de números es un clásico en las competencias de programación. A pesar de este hecho, ese es el problema que deben resolver aquí. Pero, para evitar que bostezen mientras resuelven el problema, introducimos un pequeño cambio: la lista de números sera dada como una matriz bidimensional, y la secuencia creciente debe estar \"incrustada\" en una submatriz de la matriz original.\n\n\tDefinamos el problema de una manera más precisa. La Linealización de una matriz bidimensional es la concatenación de sus líneas, de la primera a la última. Una submatriz es una región rectangular de la matriz bidimensional (con lados paralelos a los lados de la matriz). El tamaño de la submatriz es su número de elementos. Debes escribir un programa que, dado una matriz de enteros, determine la mayor submatriz tal que, cuando sea linealizada, resulte en una secuencia creciente. La figura debajo muestra algunos ejemplos de submatrices de mayor tamaño que contienen secuencias crecientes. Noten que pueden existir más de una submatriz en una matriz dada.","id":"1092","category":"Ad-Hoc","statistics":{"level":"10 / 10","submissions":709,"solved":168,"ratio":"23.70%"}}