{"output":"Para cada caso de prueba de la entrada, tu programa debe imprimir una sola línea que contenga un número real, con una precisión de un dígito decimal, indicando el área de Nlogonia que sería destruida por el ataque.","input":"La entrada contiene varios casos de prueba. Cada caso está compuesto por dos líneas. La primera línea contiene tres enteros X, Y, R, donde (X, Y)   representa las coordenadas del centro de la muralla protectora (0 ≤ X ≤ 1000 y 0 ≤ Y ≤ 1000), y R su radio (1≤R≤100). La segunda línea contiene cuatro enteros P, Q, A y T, donde (P, Q) representa las coordenadas del cañón (0≤P≤1000 and 0≤Q≤1000), A representa la dirección del haz de protones en grados (0≤A≤359), y T representa el ángulo de propagación, también en grados (1≤T≤179). El ángulo A se mide en sentido contrario a las agujas del reloj desde el eje x, y el cañón siempre está fuera de la muralla.\n\n\tEl final de entrada se indica con tres ceros separados por un espacio.","level":10,"name":"Ataque Mortal","has_images":true,"description":"Desde que el Rey de Nlogonia construyó, décadas atrás, una enorme muralla protectora rodeando el reino completo, sus habitantes han vivido seguros. La muralla es gigante, extremadamente reforzada, y tiene forma de círculo, encerrando todos los dominios del Rey.\n\n\tSin embargo, en las últimas semanas los habitantes de Nlogonia están molestos. Se rumorea que científicos de Quadradonia, una nación bárbara en las cercanías de Nlogonia, han desarrollado un arma letal, capaz de destruir cualquier cosa que esté a su alcance.\n\n\tLa nueva arma es un cañón que emite un haz de protones que se propagan con un ángulo desde la boca del cañón. La dirección del haz de protones está determinada por un ángulo, medido en sentido contrario a las agujas del reloj. La siguiente figura muestra (a) un ejemplo de ataque, (b) lo que quedaría de Nlogonia y (c) el área que sería destruida.\n\n\t\n\n\tDadas las coordenadas del cañón, la dirección del haz de protones y el ángulo de propagación, así como las coordenadas del centro de la muralla y su radio, debes escribir un programa que calcule el área de Nlogonia que será destruida.","id":"1102","category":"Geometría Computacional","statistics":{"level":"10 / 10","submissions":590,"solved":67,"ratio":"11.36%"}}