{"output":"Por cada caso de prueba, su programa deberá mostrar una línea que contenga un número entero que indique el número máximo de cartas que Alicia y Bety pueden intercambiar.","input":"La entrada contiene distintos casos de prueba. La primera línea de un caso de prueba, contiene dos número enteros A y B, separados por un espacio en blanco, que indican la cantidad de cartas que tienen Alicia y Bety (1 ≤ A ≤ 104 y 1 ≤ B ≤ 104). La segunda línea contiene  A enteros Xi, separados por un espacio, que indican los números de las cartas de Alicia (1 ≤ Xi ≤ 105). La tercera línea contiene B enteros Yi separados por un espacio, que indican los números de las cartas de Bety (1 ≤ Yi ≤ 105). Las cartas de Alicia y Bety se enumeran en orden ascendente.\r\n                \r\n                    El final de la entrada se indica con una línea conteniendo solamente dos ceros, separados por un espacio en blanco.","level":4,"name":"Intercambios de Cartas","has_images":false,"description":"Alicia y Bety coleccionan cartas de Pokemon. Las cartas son impresas para un juego que imita un sistema de batalla de uno de los videojuegos más populares de la historia, pero Alicia y Bety son muy pequeñas para entender el juego, y solamente están interesadas en las cartas. Para hacerlo más fácil, asumiremos que cada carta tiene un identificador único, dado como un número entero.\r\n                \r\n                    Las niñas tienen un conjunto de cartas, y, como la mayoría de los niños de su edad, quieren intercambiarlas. Ellas, obviamente, no se preocupan por las cartas que tienen repetidas entre ellas, y tampoco quieren recibir cartas repetidas en el intercambio. Además, las cartas se intercambian en una sola operación: Alicia le da a Bety  N cartas distintas, y recibe otras N cartas distintas.\r\n                \r\n                    Las niñas quieren saber cuál es el máximo número de cartas que pueden cambiar. Por ejemplo, si Alicia tenía las cartas  {1, 1, 2, 3, 5, 7, 8, 8, 9, 15} y Bety las cartas {2, 2, 2, 3, 4, 6, 10, 11, 11} pueden intercambiar como máximo cuatro cartas.\r\n                \r\n                    Escriba un programa que, dado el conjunto de cartas que tienen Alicia y Bety, determine el número máximo de cartas que se pueden intercambiar.","id":"1104","category":"Ad-Hoc","statistics":{"level":"4 / 10","submissions":7771,"solved":3093,"ratio":"39.80%"}}