{"output":"Para cada caso de prueba, el programa debe imprimir una sola línea, conteniendo un solo caracter: 'S', si es posible liquidar todos los bonos sin un rescate financiero del Banco Central de Nlogonia, ó 'N' si el rescate es necesario.","input":"La entrada consiste de varios casos de prueba. La primer línea de cada caso de prueba contiene dos enteros B and N, que indican el número de bancos (1 ≤ B ≤ 20) y el número de bonos impresos por ellos (1 ≤ N ≤ 20). Los bancos son identificados por enteros entre el 1 y B. La segunda línea contiene B enteros Ri separados por espacios, indicando las reservas monetarias de cada uno de los B bancos (0 ≤ Ri ≤ 104, para 1 ≤ i ≤ B). Las N líneas siguientes contienen cada una tres enteros separados por espacios: un entero D, indicando el banco deudor (1 ≤ D ≤ B), un entero C , indicando el banco creditor (1 ≤ C ≤ B e D ≠ C) y un entero V, indicando el valor de los bonos (1 ≤ V ≤ 104).\r\n                                                                                                                                                                                                                                                                                                                     \r\n\t\t\t\t                     \r\n\t\t\t\tEl final de la entrada es indicado por una línea conteniendo solamente dos ceros, separados por espacios.","level":3,"name":"Sub-primo","has_images":false,"description":"La crisis económica mas reciente fue causada parcialmente por la manera en la que los bancos daban préstamos a personas que no podían pagarlos y luego los revendian a otros bancos como bonos. Obviamente, cuando la gente no pudo pagar sus préstamos, el sistema colapsó.\r\n                    \r\n                \r\n                    La crisis fue tan profunda que afectó a países de todo el mundo, incluyendo Nlogonia, donde el honorable primer ministro Man Dashuva ordenó al presidente del Banco Central dar una solucion al problema. Al presidente se le ocurrió una idea brillante: si todos los bancos pueden liquidar sus bonos con sus reservas monetarias, todos los bancos pueden sobrevivir y la crisis puede ser evitada.\r\n                   \r\n\t\t\t\t\r\n                    Sin embargo, con el número elevado de bonos y bancos involucrados, esta tarea fue extremadamente difícil, por lo que pide tu ayuda para hacer un programa que, dados los bancos y los bonos impresos por ellos, determine si es posible que todos los bancos paguen sus deudas utilizando sólo sus reservas monetarias y créditos.","id":"1105","category":"Ad-Hoc","statistics":{"level":"3 / 10","submissions":4951,"solved":2808,"ratio":"56.72%"}}