{"output":"Para cada caso en la entrada, tu programa debe imprimir una sola línea, que contenga un número real, con precisión de seis decimales, que indicará la probabilidad que tiene Rubens de ganar el torneo.","input":"La entrada consiste en varios casos de prueba. La primera línea de cada caso contiene un solo entero N, que indica el número de competidores en ese torneo (2≤N≤300). En la descripción del torneo, cada competidor es identificado por un número entre 1 y N, y las carreras con números entre N + 1 y 2 x N - 1. Rubens siempre se identifica con el número 1. Las siguientes N líneas describen la matriz de probabilidades calculadas por Rubens. La i-ésima línea contiene N números reales M[i, j] Separados por espacios(0 ≤ M[i, j] ≤ 1, donde 1 ≤ i ≤ N y 1 ≤ j ≤ N). Cada elemento de la matriz M[i, j] indica la probabilidad del competidor i de ganar una carrera contra en competidor j (0.001 ≤ M[i, j] ≤ 0.999 y M[i, j] + M[j, i] = 1 para i ≠ j , y M[i, j] = 0 para i = j).\n                \n                    Las probabilidades siempre se darán con tres decimales. Cada una de las siguientes N - 1 líneas contiene dos enteros A y B, que describen una carrera. A y B son identificadores de carreras o de competidores (1 ≤ A ≤ 2 x N - 1 y 1 ≤ B ≤ 2 x N - 1). La primera de estas líneas describe la carrera N + 1, la siguiente línea la carrera N + 2, y así sucesivamente. Cuando un identificador de carrera k aparece en la entrada como A, significa que el ganador de la carrera k correrá contra B; igualmente, cuando un identificador de carrera k aparece en la entrada como B, el ganador de la carrera k correrá contra A.\n                \n                    EL final de la entrada está dado por una línea con un solo cero.","level":6,"name":"Picadas","has_images":false,"description":"Las carreras de picadas no son muy populares en Brasil, pero atraen multitudes en Estados Unidos. Los fans disfrutan ver a los autos correr a velocidades de hasta 400 km/h, aunque sea solo por unos segundos. Varios competidores son aficionados a la mecánica y agregaron cohetes y otros artefactos para crear autos ultra rápidos.\n                \n                    Las competiciones de picadas son torneos de eliminación, donde en cada carrera corren dos competidores mano a mano y solo uno de ellos es declarado ganador (el más rápido, obviamente). Los ganadores compiten en nuevas carreras, hasta que solo queda uno, que es declarado ganador del torneo.\n                \n                    Rubens es un piloto experimentado, con experiencia en varias categorías, entre ellas Formula 1. Sin embargo, luego de enfrentar algunas dificultades, decidió dedicarse a las picadas. Gracias a su vasta experiencia en Formula 1, puede, observando a los competidores, dar la probabilidad de que un competidor gane una carrera entre dos competidores cualesquiera.\n                \n                    Aunque Rubens es un buen piloto, no es muy bueno en matemática ni programación, así que te pidió a ti que escribas un programa que, dadas las probabilidades calculadas por Rubens para todas las carreras entre cada par de pilotos, y la descripción de la estructura del torneo, determine su probabilidad de ganar el torneo.","id":"1106","category":"Paradigmas","statistics":{"level":"6 / 10","submissions":260,"solved":130,"ratio":"50.00%"}}