{"output":"Por cada caso de prueba en la entrada, tu programa debe producir una línea conteniendo o “Mission impossible” o “Contact informer K”, donde “K” es el índice del informante (como es dado en la entrada) con el mayor coeficiente de información que puede ser alcanzado por el espía sin atravesar ningún área cubierta por radar. Si hay más de un informante que satisface esta condición, elige aquel con el menor índice.","input":"La entrada consiste en varios casos de prueba. La primera línea de cada caso describe la frontera del país enemigo, en el formato\n\t\n\tB X1 Y1 X2 Y2 ... XB YB \n\t\n\tdonde 3 ≤ B ≤ 1000 es el número de puntos del borde, y cada Xi Yi es la coordenada del i-ésimo punto en la frontera. El límite del país consiste de segmentos entre puntos i e i+1, y entre puntos B y 1. La segunda línea da el número de informantes y sus respectivas posiciones, en el formato\n\t\n\tN X1 Y1 X2 Y2 ... XN YN \n\t\n\tdonde 1 ≤ N ≤ 1000 es el número de informantes, y Xi Yi es la coordenada del i-ésimo informador. La tercera línea describe las posiciones y radios de los radares, en el formato\n\t\n\tM X1 Y1 R1 X2 Y2 R2 ... XM YM RM \n\t\n\tdonde 1 ≤ M ≤ 30 es el número de radares, Xi Yi es la coordenada del i-ésimo radar, y Ri es el radio del i-ésimo radar. Todas las coordenadas son enteros 0 ≤ X, Y ≤ 1000. Los radios de los radares son enteros pretenecientes al rango 1 ≤ R ≤ 1000. Un caso de prueba donde B = N = M = 0 indica el final de la entrada. Este caso no debe ser procesado.","level":8,"name":"Misión Imposible","has_images":true,"description":"Has sido contratado para explorar territorio enemigo. Es un asunto riesgoso, lo sabes. Entonces, mejor que estés preparado! El enemigo ha colocado un número de puntos de seguridad por todo su país, donde sus radares están detectando a cualquier vehículo en movimiento dentro de su rango de cobertura. Cualquier objeto detectado será destruido inmediatamente. Afortunadamente, tu gobierno te ha proporcionado un mapa del territorio enemigo, que consiste en coordenadas y los radios de cobertura de cada radar. También tienes una lista de informantes locales (junto con sus respectivas localizaciones) que debes contactar para obtener información valiosa. Tu misión es tratar de contactar a uno de estos informantes, preferiblemente el que tiene el mayor coeficiente de información. El coeficiente de cada informantes es, simplemente, la distancia desde el informante hacia la frontera del país, donde dicha distancia es definida como la menor de todas las distancias del informante hacia cada punto de la frontera. Por sentido común, el informante con el mayor coeficiente de información es aquel que está localizado lo más dentro del país posible, y tendrá, presumiblemente, mayor información valiosa sobre el país.\n\t\n\tTu primera tarea es, entonces, diseñar un programa de computadora que verificará si hay un camino desde tu localización inicial, siempre el punto (2000, 2000), hacia cualquiera de las localizaciones de los informantes, sin cruzar ninguna región cubierta por radar. Cuando sea posible, el programa debe indicar cuál informante alcanzable es el que tiene que ser contactado, de acuerdo con el criterio del coeficiente de información descripto anteriormente.\n                    \n                        \n                    \n                        Figura 1: Escenario posible, el país del enemigo tiene la forma de un polígono simple (no necesariamente convexo).\n                    Recuerda que un polígono es denominado simple si es descripto por un contorno único y no interceptable. Los bordes del país serán dados como secuencias de coordenadas (X, Y) correspondientes a la secuencia de vértices del polígono. Puedes asumir que todos los centros de los radares y las coordenadas de los informantes estarán localizadas dentro de los límites del país. Note, de todas formas, que el área cubierta por los radares puede incluir regiones fuera de la frontera.\n                            \n                    En el escenario del ejemplo de la Figura 1, el informante I1 no puede ser contactado ya que está dentro de la región cubierta por los radares. El informante I2, aunque está fuera de la región de los radares, tampoco puede ser contactado ya que cualquier viaje hacia su localización pasará a través de las letales regiones cubiertas por radares. El informante I3 y el I4 pueden ser contactados, entonces el informante I4 es elegido ya que su coeficiente de información es mayor que el del I3.","id":"1268","category":"Geometría Computacional","statistics":{"level":"8 / 10","submissions":91,"solved":29,"ratio":"31.87%"}}