{"output":"For each test case output a line with an integer representing the number of different words that can\n                be constructed by concatenating a non-empty prefix of a word in the first set (Portuguese words) and\n                a non-empty suffix of a word in the second set (Spanish words).","input":"Each test case is described using several lines. The first line contains two integers P and S representing\n                    respectively the number of Portuguese words and the number of Spanish words (1 ≤ P, S ≤ 1000).\n                    Each of the next P lines contains a Portuguese word, and after that each of the next S lines contains\n                    a Spanish word. Each word is a non-empty string of at most 1000 characters; each character is one\n                    of the 26 standard lowercase letters (from 'a' to 'z'). You may assume that within each test case no\n                    two Portuguese words are the same, and that the sum of the lengths of all the Portuguese words is at\n                    most 105. The same holds for the Spanish words.\n                    The last test case is followed by a line containing two zeros.","level":8,"name":"Diccionario Portuñol","has_images":false,"description":"Portuñol is a special language that was naturally developed in Latin America. Since almost half of\n                    Latin America speaks Portuguese (Português) and almost half speaks Spanish (Español), the mixing\n                    of both languages is natural.\n                \n                    Each word in Portuñol is made by taking a non-empty prefix of a Portuguese word and a non-empty suffix of a Spanish word, and concatenating them together. A prefix of a word is any word that\n                    can be obtained by erasing zero or more characters from its right end. A suffix of a word is any word\n                    that can be obtained by erasing zero or more characters from its left end. The name of the language\n                    itself comes from taking a prefix of the word \"Português\" (Portu) and a suffix of the word \"Español\"\n                    (ñol), and concatenating them.\n                \n                    Of course, not every possible way of combining two words will result in something meaningful, or\n                    even pronounceable, but that is not important. We want you to write a program to count the number\n                    of different Portuñol words.\n                \n                    It will be given to you two non-empty sets of words to test your program. The first set will represent\n                    Portuguese words and the second set will represent Spanish words. You need to calculate the number\n                    of different Portuñol words that can be made using the prefix and suffix rule described above. Note\n                    that the same word may be constructed in several ways, but it still needs to be counted as one. Also\n                    note that the input sets are just to test your program, so they do not need to be made out of actual\n                    Portuguese or Spanish words.","id":"1313","category":"Strings","statistics":{"level":"8 / 10","submissions":365,"solved":135,"ratio":"36.99%"}}