{"output":"Para cada caso de prueba en la entrada, su programa debe imprimir una línea simple, conteniendo el número   de \n\t\t\t\t\tcuadrados diferentes para la entrada correspondiente.","input":"La entrada contiene varios casos de prueba. Cada caso de prueba está compuesto de una línea simple, conteniendo  sólo un entero  \n\t\t\t\t\tN, representando el número de cuadrados en cada lado de la cuadrícula (1 ≤ N ≤ 100).\n\n                \n                    El fin de la entrada viene indicado por una línea que sólo contiene un cero.","level":1,"name":"Feynman","has_images":true,"description":"Richard Phillips Feynman fue un físico estadounidense muy conocido y galardonado con el Premio Nobel de Física.\n\t\t\t\t\tTrabajó en la física teórica y también fue pionero en el campo de la computación cuántica. Visitó América del Sur durante diez meses, \n\t\t\t\t\tdando conferencias y disfrutando de la vida en el clima tropial. También es conocido por sus libros \"Surely You're Joking, Mr. Feynman!\"\n\t\t\t\t\ty \"¿What Do You Care What Other People Think?\", que incluyen algunas de sus aventuras por debajo del ecuador . \n\t\t\t\t\t\n\n                \n\t\t\t\t    Su pasatiempo a lo largo de su vida fue la resolución y creación de puzzles, cerraduras y cifrados. Recientemente, un viejo granjero en \n\t\t\t\t\tAmérica del Sur, que fue un anfitrión del joven físico en 1949, encontró unos papeles y notas que se cree que han pertenecido a Feynman. \n\t\t\t\t\tEntre las notas sobre mesones y el electromagnetismo, había una servilleta donde escribió un rompecabezas simple: \n\t\t\t\t\t\"¿cuántos cuadros diferentes hay en una cuadrícula de & nbsp ; N & nbsp ; & nbsp × N ; cuadrados? \".\n\n                \n                    En la misma servilleta había un dibujo que se reproduce a continuación, mostrando que, para N=2, la respuesta es 5.\n\n                ​","id":"1323","category":"Matemáticas","statistics":{"level":"1 / 10","submissions":6553,"solved":4741,"ratio":"72.35%"}}