{"output":"For each test case, output a single line with the uppercase character “Y” if, according to Martin,\n                    Isa is the winner, and with the uppercase character “N” otherwise.\n                \n                    The output must be written to standard output.","input":"The input contains several test cases. Each test case is described in a single line that contains\n                    two strings SM and SI , and an integer C, separated by single spaces. SM is the 7-character\n                    string sent by Martin, which is always a legal plate. SI is the 7-character string answered\n                    by Isa, which was generated using her random generator. C is Martin’s confidence number\n                    (1 ≤ C ≤ 109).\n                \n                    The end of input is indicated by SM = SI = \"*\" and C = 0.\n                \n                    The input must be read from standard input.","level":8,"name":"Car Plates Competition","has_images":false,"description":"Martin and Isa are very competitive. The newest competition they have created is about looking\n                    at the plates of the cars. Each time one of them sees a car plate on the streets, he or she sends\n                    to the other an SMS message with the content of that plate; the one who has seen the newest\n                    plate is in the lead of the game. As the Automobile Car Management (ACM) office assigns the\n                    plates sequentially in increasing order, they can compare them and find out who is the winner.\n                \n                    Martin has a very smart eye and he has stayed on the lead for several weeks. Maybe he keeps\n                    looking at the streets instead of working, or maybe he stays all day in front of the car selling\n                    companies waiting for new cars to go out with new plates. Isa, tired of being always behind,\n                    has written a program that generates a random plate, so the next time Martin sends a message\n                    to her, she will respond with this generated plate. In this way, she hopes to give Martin a hard\n                    time trying to beat her.\n                \n                    However, Martin has grown suspicious, and he wants to determine if Isa actually saw a car with\n                    the plate she sent or not. This way, he will know if Isa is in the lead of the game.\n                \n                    He knows some facts about the plates assigned by the ACM:\n                \n                    Each plate is a combination of 7 characters, which may be uppercase letters (A-Z), or\n                        digits (0-9).\n                    There exists two kinds of plate schemes: the old one, used for several years, and the new\n                        one which has been in use for some months, when the combinations of the old one were\n                        exhausted.\n                    In the old scheme, the first three characters were letters, and the last four were digits, so\n                        the plates run from AAA0000 to ZZZ9999.\n                    In the new scheme, the first five characters are letters, and the last two are digits. Unfortunately\n                        the chief of ACM messed up with the printing system while he was trying\n                        to create a poster for his next campaign for mayor, and the printer is not able to write\n                        the letters A, C, M, I, and P. Therefore, in this new scheme, the first plate is BBBBB00,\n                        instead of AAAAA00.\n                    The plates are assigned following a sequential order. As a particular case, the last plate\n                        from the old scheme is followed by the first plate from the new scheme.\n                \n                \n                    As Isa is not aware of all of this, she has just made sure that her random generator creates a\n                    combination consisting of seven characters, where the first three characters are always uppercase\n                    letters, the last two characters are always digits, and each one of the fourth and fifth characters\n                    may be an uppercase letter or a digit (possibly generating an illegal combination, but she has\n                    not much time to worry about that).\n                \n                    Of course, Martin will not consider Isa the winner if he receives an illegal combination, or if he\n                    receives a legal plate, but equal to or older than his. But that’s not all of it. Since Martin knows\n                    that new plates are not generated too fast, he will not believe that Isa saw a car with a plate\n                    newer than the one he sent, but sequentially too far. For example, if Martin sends DDDDD45,\n                    and receives ZZZZZ45, he will not believe that Isa saw a car with that plate, because he knows\n                    that the ACM couldn’t have printed enough plates to get to ZZZZZ45 in the time he received\n                    that answer.\n                \n                    So, Martin has decided to consider Isa the winner only if he receives a legal plate, newer than\n                    his, and older than or equal to the C-th consecutive plate after the one he sent. He calls C his\n                    confidence number. For example, if Martin sends ABC1234, and his confidence number is 6, he\n                    will think that Isa is the winner only if he receives any plate newer than ABC1234, but older\n                    than or equal to ABC1240.","id":"1363","category":"Ad-Hoc","statistics":{"level":"8 / 10","submissions":300,"solved":113,"ratio":"37.67%"}}