{"output":"For each test case in the input your program \n                    should produce one line of output, containing a real value representing \n                    the length of the wooden board Indiana Jones must carry. The length must\n                    be printed as a real number with two-digit precision, and the last \n                    decimal digit must be rounded. The input will not contain test cases \n                    where differences in rounding are significant.","input":"Your program should process several test cases. Each test case starts with an integer N indicating the number of wall sections remaining in the city (2 ≤ N ≤ 1000). Each of the next N\n                    lines describes a wall section. The first wall section to appear is the\n                    section where Indiana Jones stands at the beginning. The second section\n                    to appear is the section where the trapped person stands. Each wall \n                    section description consists of three integers X, Y and L (–10000 ≤ X, Y, L ≤ 10000), where X an Y\n                    define either the southernmost point of a wall section (for South-North\n                    sections) or the westernmost point (for West-East wall sections). The \n                    value of L determines the length and direction of the wall: if L ≥ 0, the section is West-East, with length L; if L < 0, the section is North-South, with length |L|. The end of input is indicated by N = 0.","level":8,"name":"Will Indiana Jones Get There?","has_images":true,"description":"Indiana Jones is in a deserted city, annihilated \n                    during a war. Roofs of all houses have been destroyedand only portions \n                    of walls are still standing. The ground is so full of mines that the \n                    only safe way to move around the city is walking over the remaining \n                    walls. The mission of our hero is to save a person who is trapped in the\n                    city. In order to move between two walls which are not connected \n                    Indiana Jones thought of taking with him a wooden board which he could \n                    place between the two walls and then cross from one to the other.\n                \n\n                \n\t\t\t\t\n\t\t\t\tFig. 1: City map with rout used by Indiana Jones\n\t\t\t\n\t\t\t\t\n\n                \n                    Initial positions of Indiana Jones and the trapped person are both on\n                    some section of the walls. Besides, walls are either in the direction \n                    South-North or West-East.\n                \n\n                \n                    It will be given to you a map of the city remains. Your mission is to \n                    determine the minimum length of the wooden board Indiana Jones needs to \n                    carry in order to get to the trapped person.","id":"1402","category":"Graph","statistics":{"level":"8 / 10","submissions":167,"solved":68,"ratio":"40.72%"}}