{"output":"For each test case in the input your program must produce an answer. The first line of an answer must contain a test case identifier, in the form ’#i’ where i starts from 1 and is incremented for every test case. Then, if there is a valid configuration for the puzzle, your program must produce M lines of output, describing one such configuration. Each line must contain two integers L and C, separated by a blank space, indicating the position of a black square (L indicates a line number and C indicates a column number, with 1 ≤ L ≤ N and 1 ≤ C ≤ M). If more than one valid configuration is possible, print any one of those. If a valid configuration for the puzzle is not possible, your program must output as answer a single line containing the value 0.","input":"The input contains several test cases. The first line of a test case contains three integers N, M and K, indicating respectively the number of lines in the puzzle (2 ≤ N ≤ 2000) the number of columns in the puzzle (1 ≤ M ≤ 2000) and the number of lengths of words (1 ≤ K ≤ 4000). The second line contains K integers Wk, representing the lengths of words that must be put in the down (vertical) direction (1 ≤ Wk ≤ N-1). The end of input is indicated by N = M = K = 0.","level":10,"name":"Crossword With No Words","has_images":true,"description":"Although word square games go back to ancient times – a word square was found in the Roman ruins of Pompeii – it was only in 1913 that the Sunday New York World printed a puzzle called a ’word-cross’ invented by Arthur Wynne, a journalist who had the job of devising a weekly puzzle for the comic section of the newspaper. The puzzle was an immediate success, became a weekly feature, and nowadays is probably the most popular and widespread word game in the world.\n\n                (For those weird people who do not know it, crossword is a puzzle in which a player must fill in words indicated by verbal clues down and across a checkered pattern so as to fit wherever they cross.)\n\n                A crossword configuration is the figure formed by empty squares and black squares in a puzzle. Over the first years several types of shapes and figures (diamond, circle, square) were tried before the familiar rectangular shape with a few black squares (used to separate words) was universally adopted. For this problem, we will define that a configuration for a puzzle with N lines and M columns is valid only if\n\n                \n                    each column contains exactly one black square; and\n                    black squares are not in adjacent columns in the same line.\n                \n\n                \n\n                Invalid configuration (on the left) and valid configuration (on the right).\n\n                Given a list of lengths of words, all of which must be put in the down (vertical) direction, your task is to find a valid configuration for a puzzle with N lines, M columns and M black squares.","id":"1453","category":"Ad-Hoc","statistics":{"level":"10 / 10","submissions":58,"solved":13,"ratio":"22.41%"}}