{"output":"Deberías mostrar el texto resultante usando las siguientes reglas:\n\n                    Si leés una palabra en la entrada y la línea resultante no se vuelve mayor a 80 caracteres, imprímela, si no, imprímela en una nueva línea.\n                    Si lees un <br> en la entrada, empueza una nueva linea.\n                    Si lees un <hr> en la entrada, empieza una nueva línea a menos que ya estés en el comienzo de una línea, en ese caso, mostrar 80 caracteres '-' y empezar una nueva línea (nuevamente).\n\n                    La última línea termina con un carácter de salto de linea.","input":"La entrada consta de un texto que deberías mostrar. Este texto consta de palabras y comandos de HTML separados por uno o más espacios, tabulaciones o saltos de línea.\n                    Una palabra es una secuencia de letras, números y signos de puntuación. Por ejemplo, \"abc,123\" es una palabra, pero \"abc, 123\" son dos palabras denominadas \"abc,\" y \"123\". Una palabra siempre es más corta que 81 caracteres y no posee ningún '<' o '>'. Todos los comandos de HTML son o <br> o <hr>.","level":8,"name":"HTML","has_images":false,"description":"Si alguna vez intentaste leer un documento HTML en una Macintosh (Mac) , sabes lo difícil que es si no hay un navegador Netscape instalado. Ahora, ¿Quién puede olvidarse instalar un navegador HTML? Es muy fácil porque la mayoría de las veces no lo necesitas en una Mac dado que hay un Acrobat Reader que ya viene con la Mac. Pero si alguna vez necesitas uno, ¿qué hacés? Tu tarea es escribir un pequeño navegador-HTML. Debería mostrar sólo el contenido del archivo de entrada y reconocer sólo los comandos (tags) de HTML, los cuales son el salto de linea <br>\n                    y linea horizontal <hr>. Después deberías tratar todas las tabulaciones, espacios y saltos de línea como un espacio y mostrar el texto resultante con no más de 80 caracteres en una línea.","id":"1667","category":"Strings","statistics":{"level":"8 / 10","submissions":2402,"solved":392,"ratio":"16.32%"}}