{"output":"Para cada caso de prueba, imprima “Caso #X:”, donde X es el número del caso actual, comenzando en 1. Para cada operación del tipo 2, imprima en una nueva línea con la cadena S después de haber aplicado todas las operaciones anteriores sobre ella.  El archivo de salida contiene alrededor de 3*10⁶ caracteres.","input":"La primera línea de entrada contiene un entero T (1 ≤ T ≤ 100), que es el número de casos de prueba. La primera línea de cada caso de prueba contiene S (1 ≤ |S| ≤ 10⁴), que es la cadena de Guga. La segunda línea de entrada contiene un entero Q (1 ≤ Q ≤ 10⁵), que es el número de operaciones que Guga va a hacer en S. Cada una de las siguientes Q líneas contiene operaciones como las descritas anteriormente. Para cada operación, 0 ≤ x ≤ |S|.","level":8,"name":"Guga y la Cadena","has_images":false,"description":"Guga tiene una cadena S que contiene sólo letras minúsculas y quiere hacer algunas operaciones en ella. Cada operación puede ser uno de los siguientes tipos:\n\n                \n                \t\n                \t0 x, mueva cada vocal de S x posiciones de izquierda a derecha. (Comenzando de nuevo al principio si es necesario).\n                \t\n                \t\n                \t1 x, mueva cada consonante en S x posiciones de izquierda a derecha. (Comenzando de nuevo al principio si es necesario)\n                \t\n                \t\n                \t2, imprima S tal como está.\n                \t\n                \n\n                Las vocales que estamos considerando son las letras a, e, i, o y u.\n\n                Una operación de tipo 0 sólo mueve las vocales a través de posiciones en S que contienen vocales.\n\n                Una operación de tipo 1 sólo mueve consonantes a través de posiciones en S que contienen consonantes.\n\n                \n\n                Por ejemplo,\n\n                La cadena \"computador\" después de la operación 1 2 se convierte en \"dorcumapot\", es decir, cada consonante va a la posición de la segunda consonante siguiente.\n\n                La cadena \"abe\" después de la operación 0 1 se convierte en \"eba\".","id":"1781","category":"Strings","statistics":{"level":"8 / 10","submissions":4284,"solved":535,"ratio":"12.49%"}}