{"output":"La salida de tu programa tiene que consistir de una sola línea, mostrando la palabra YEAH si el escape es posible o la palabra OUCH en caso contrario.","input":"La primera línea de la entrada determina el número N de pisos en el edificio (1 ≤ N ≤ 106) y el valor de HAR (0 < HAR < 104). Cada una de los siguientes N líneas describe un piso del edificio con tres enteros: XC, YC y S (0 < XC, YC, S < 104),  que representan, respectivamente, las coordenadas del centro y la longitud del lado del piso. Los pisos son descritos en orden decreciente de altura.","level":9,"name":"Rápido y Curioso","has_images":true,"description":"Vin Gasoline y su mejor amigo Paul Runner estan el el piso más alto de un edificio en Abu Dhabi robando un súper auto HyperSport. Es el año 2300, y los pisos de los edificios ya no están uno encima del otro, sino que flotan en el aire y se mueven cada tanto, manteniendo su altitud. En el edificio que estan nuestros héroes, los pisos tienen forma cuadrada. La figura de la izquierda muestra el edificio visto desde arriba y la figura de la derecha lo muestra de frente, representando el suelo con la línea más gruesa.\n\n\t\t\t\t \n\n\t\t\t\tGasoline y Runner quieren abandonar el edificio tan pronto como sea posible, con lo que necesitan acelerar el súper auto con el objetivo de saltar del último piso al penúltimo, luego de allí al antepenúltimo, y así sucesivamente hasta llegar al piso y escapar. \n\t\t\t\t\n\t\t\t\tEllos saben que el auto HyperSport puede saltar del piso i-ésimo al j-ésimo si y sólo si j=i-1 (es decir, los pisos son consecutivos), y además la distancia horizontal que separa los pisos no es mayor que el Alcance Horizontal Aéreo (HAR por sus siglas en inglés) del auto. En la computadora a bordo tienen la información completa de la ubicación de los pisos, pero necesitan calcular rápidamente si el escape es posible o no.","id":"1797","category":"Geometría Computacional","statistics":{"level":"9 / 10","submissions":594,"solved":166,"ratio":"27.95%"}}