{"output":"Imprime un entero indicando la mínima cantidad de puntos por los cuales IBO debe pasar para realizar su tarea.","input":"La primera línea de entrada contiene dos enteros Puntos (4 ≤ Puntos ≤ 4000) y Conexiones (4 ≤ Conexiones ≤ 5000) que representan respectivamente el número de puntos estratégicamente marcados por las letras y la cantidad de conexiones existentes entre estos puntos. Las líneas siguientes indican todas las conexiones entre los puntos. La conexión entre dos puntos indica que cualquiera de los dos puede ser la origen.","level":3,"name":"El Ratón en un Laberinto","has_images":true,"description":"En 1942, un estudio hecho por Robert Tryon concluyó que las características genéticas a menudo pueden contribuir a la conducta, independientemente del ambiente. Para hacerlo, Tryon creó un experimento que evaluaba la eficiencia de sucesivas generaciones de ratones para completar un laberinto, separando a aquellos que cometían menos errores como \"brillantes\", y aquellos con más errores como “mediocres”. Continuando con este proceso por siete generaciones, él creó dos razas distintas de ratones: \"brillantes\" y \"mediocres\".\r\n\r\n\t\t\t\tIBO es un ratón descendiente de la raza de \"brillantes\" y es el mejor realizando este experimento. Él puede entrar, tomar el queso y salir de cualquier laberinto sin perderse, y siempre usa el camino más corto posible.\r\n\r\n\t\t\t\tTu tarea en este problema es, dado el diseño del laberinto y la posición del queso, determinar por cuántos puntos estratégicamente marcados por palabras contiendo las letras del alfabeto (o letras) IBO debe pasar para obtener el queso (indicado por el caracter '*') y salir, siempre partiendo desde el punto de Entrada y siempreterminando en el punto de Saida (palabra que significa salida). En el ejemplo de abajo, la secuencia de IBO desde la Entrada sería: A, F, J, *, I, M, K, Saida, lo que daría como resultado 8, que es la cantidad mínima de puntos por los cuales IBO debe pasar para hacer su tarea. Si IBO tiene que pasar por un punto dos veces (una vez que va para el queso y una que va a la salida) se cuenta como dos puntos visitados.","id":"1799","category":"Graph","statistics":{"level":"3 / 10","submissions":1178,"solved":659,"ratio":"55.94%"}}