{"output":"Imprima el valor de la suma de los valores de los K conjuntos distintos de libros más caros.","input":"La entrada consiste en 6 líneas: La primera línea contiene un entero P (5 ≤ P ≤ 10), que indica que Bino tiene P tipos diferentes de libros de portugués, seguido por P enteros vi  (1 ≤ vi ≤ 1000), que representan los valores de cada libro de portugués.  La segunda línea contiene un entero M (5 ≤ M ≤ 10), que indica que Bino tiene M tipos diferentes de libros de matemática, seguido por M enteros vi  (1 ≤ vi ≤ 1000), que representan los valores de cada libro de matemática. La tercera línea contiene un entero F (5 ≤ F ≤ 10), que indica que Bino tiene F tipos diferentes de libros de física, seguido por F enteros vi  (1 ≤ vi ≤ 1000), que representan los valores de cada libro de física. La cuarta línea contiene un entero Q (5 ≤ Q ≤ 10), que indica que Bino tiene Q tipos diferentes de libros de química, seguido por Q enteros vi  (1 ≤ vi ≤ 1000), que representan los valores de cada libro de química. La quinta línea contiene un entero B (5 ≤ B ≤ 10), que indica que Bino tiene B tipos diferentes de libros de biología, seguido por B enteros vi  (1 ≤ vi ≤ 1000), que representan los valores de cada libro de biología. La sexta línea contiene un entero K (1 ≤ K ≤ P*M*Q*F*B), que indica la cantidad de conjuntos distintos de libros que aparecerán en el catálogo.","level":2,"name":"Catálogo de Libros","has_images":false,"description":"Bino está elaborando un catálogo de libros escolares. Él está organizando un catálogo con conjuntos distintos de libros para vender en su tienda online. Cada conjunto de libros está formado por 5 libros, siendo uno de cada materia (portugués, matemática, física, química y biología). Dos conjuntos de libros se consideran distintos si existe por lo menos un libro que está en uno de los conjuntos y no está en el otro. Bino quiere mostrar en el site únicamente los conjuntos distintos más caros, y pidió tu ayuda para eso.\n\n\t\t\t\tEl valor de un conjunto es la suma de los valores de cada libro del conjunto. Tu tarea es calcular la suma de los valores de los K conjuntos distintos de libros más caros. En caso de empate entre conjuntos más caros, Bino elige cualquiera de los conjuntos empatados.","id":"1802","category":"Ad-Hoc","statistics":{"level":"2 / 10","submissions":1430,"solved":814,"ratio":"56.92%"}}