{"output":"Para cada línea \"? i\", imprime una línea que contenga el número de personas de la excursión que todavía quedan detrás del buggy i en ese momento. ¡Pero no seas bugueiro (nada de poner bugs en tu código)!","input":"Un entero N (1 ≤ N ≤ 105) constituye la primera línea de la entrada, que representa el número de buggies que salieron desde el hotel. La segunda línea de la entrada consiste de N enteros pi (1 ≤ pi ≤ 5, 1 ≤ i ≤ N), cada uno representando el número de personas en el buggy i (incluyendo el conductor). Cada una de las líneas siguientes puede contener:\r\n\r\n\t\t\t\t\r\n\t\t\t\t\tun caracter ‘a' seguido de un entero i (1 ≤ i ≤ N), el cual indica la abducción del buggy i (que aún no había sido abducido);\r\n\r\n\t\t\t\t\tun caracter ‘?' seguido de un entero i (1 ≤ i ≤ N), el cual indica que, en ese momento, el conductor del (aún) no abducido buggy i quisiera saber cuántas personas de la excursión quedaban atrás de su buggy.\r\n\t\t\t\t\r\n\r\n\t\t\t\tConsidere que el identificador i de un buggy no cambia. Así, el tercer buggy en dejar el hotel deberá ser siempre identificado con el entero 3, incluso si los buggies 1 y 2 fueran abducidos.","level":6,"name":"Marte Necesita Matemáticos","has_images":false,"description":"Se realizó la semana pasada en la ciudad de Beberibe, Ceará, Brasil, el VIII Latin-American Algorithms, Graphs and Optimisation Symposium (LAGOS 2015), una conferencia que reunió matemáticos y científicos de la computación de todo el mundo para discutir algunos desafíos computacionales. Para que los participantes pudieran relajarse un poco, los organizadores del evento contrataron buggies para llevar a los investigadores a algunos puntos turísticos de la región. Los buggies salieron del hotel formando una fila, uno atrás del otro.\r\n\r\n\t\t\t\tQuien conoce los paseos en buggy de Ceará sabe que el turista puede pedir al conductor del buggy un paseo con emoción o sin emoción. Sin embargo, la excursión del LAGOS contó con una emoción extra. Como en Marte actualmente hay una carencia de investigadores en Algoritmos, Grafos y Optimización, alienígenas marcianos comenzaron a abducir algunos buggies, con todas las personas a bordo (incluyendo al pobre conductor, que no tenía nada que ver). Fue muy triste para nuestro planeta perder mentes tan brillantes, pero la tragedia habría sido menor si cada conductor hubiese mantenido actualizada la información de cuántas personas en total estaban en los buggies detrás de él — de este modo, podría percibir la aproximación de la sonda alienígena y acelerar el buggy.","id":"1804","category":"Estructuras de Datos y Bibliotecas","statistics":{"level":"6 / 10","submissions":1731,"solved":855,"ratio":"49.39%"}}