{"output":"Imprime la mínima cantidad de criminales que Bino tendrá que eliminar.","input":"La primera línea contiene cuatro enteros, N(1 ≤ N ≤ 10000), C(1 ≤ C ≤ 50000), S(1 ≤ S ≤ 50000) y B(1 ≤ B ≤ 10000), que representan respectivamente el número de lugares que hay en la ciudad, el número de rutas conocidas por Bino, el número de rutas conocidas sólo por los criminales y el número de criminales. Cada una de las siguientes C líneas contiene tres enteros a(1 ≤ a ≤ N), b(1 ≤ b ≤ N) y v (1 ≤ v ≤ 1000), que representan que existe una ruta entre los lugares a y b con una longitud de v metros. Cada una de las siguientes S líneas contiene tres enteros a(1 ≤ a ≤ N), b(1 ≤ b ≤ N), v(1 ≤ v ≤ 1000) que indican que existe una ruta secreta entre los lugares a y b con una longitud de v metros. La siguiente línea contiene B enteros li (1 ≤ li ≤ N) que indican que el criminal i comienza en el lugar li. La última línea contiene dos enteros K(1 ≤ K ≤ N), y F(1 ≤ F ≤ N), que representan respectivamente el lugar inicial de Bino y el lugar donde tiene que entregar el mensaje secreto.","level":7,"name":"Agent 004","has_images":false,"description":"Una organización criminal de la ciudad se esta volviendo más poderosa cada día, y como consecuencia de este avance, la organización protectora de la ciudad esta inviertiendo fuertemente en el entrenamiento de sus hombres. Bino, también conocido como Agente 004, es el mejor agente de la organización protectora, así que él fue asignado a una misión especial.\n\n\t\t\t\tLa misión de Bino es entregar un mensaje secreto de un cuartel de entrenamiento de agentes especiales a otro. La ciudad está llena de criminales que quieren interceptarlo antes de que pueda enviar su mensaje secreto.\n\n\t\t\t\tBino ha pasado la mayor parte de su vida en cuarteles de entrenamiento especial y no conoce todas las rutas de la ciudad, a diferencia de los criminales, quienes pasaron la mayor parte de sus vidas en las calles y conocen todas las posibles rutas.\n\n\t\t\t\tComo Bino es el mejor agente del mundo, es capaz de eliminar instantáneamente a cualquier número de criminales. Los criminales pueden interceptar a Bino en cualquier sitio de la ciudad (en todas las rutas y todos los lugares, incluso en el cuartel de salida y el cuartel de destino). Bino y los criminales se mueven a 12 m/s. Bino siempre usa el camino por el que encontrará menos criminales, pero los criminales siempre usan los mejores caminos para interceptar a Bino.\n\n\t\t\t\tTu tarea es descubrir cuál es el mínimo número de criminales que Bino tendrá que eliminar para entregar el mensaje secreto. Está garantizado que existe al menos un camino desde cualquier punto de la ciudad hacia cualquier otro.","id":"1806","category":"Graph","statistics":{"level":"7 / 10","submissions":453,"solved":171,"ratio":"37.75%"}}