{"output":"For each instance, print a real number rounded to 3 decimal places, the minimum expected difference between two inscriptions. Print the answer with exactly 3 decimal places.","input":"The first line of the input has an integer T corresponding to the number of instances.\n\nEach instance starts with 3 integers N, M (1 ≤ N, M ≤ 3.000), and K (0 ≤ K ≤ 100.000), where N is the length of the first inscription and M is the length of the second inscription. The next two lines contain, respectively, the first and second inscription. An inscription is a string of characters from 'a' to 'z'.","level":9,"name":"The chedis of Kamphaeng Phet","has_images":false,"description":"A chedi (also known as stupa, dagoba, or pagoda) is a relic usually shaped as a conic tower built over the remains of someone Buddhists consider important. Some historical Thai sites have dozens such structures, dedicated to monks or nuns or other religious leaders (known as bhikkhu - ภิกษุณี in Thailand). For instance, in Kamphaeng Phet some chedi inscriptions refer to Garuda (ครุฑ), and similarly in Si Satchanalai and Sukhothai.\n\nThe differences between some Thai symbols are very subtle, making it hard for experts to analyze words. For instance, when any symbol of the word Ramakien (รามเกียรติ์) is changed, its meaning is altered completely. Since many of the sites are over 700 years old, the inscriptions are very worn.\n\nAn example is the pair of inscriptions below, found in distinct chedis:\n\nจัดษุตังขึ้นโดยพรภิะบมพุธานุญาษุ\n\nจัดตั้งขึ้โกดยพระบรมษุพุทธานญาต\n\nExperts believe both refer to the same entity. They developed a method to validate their hypothesis; this is called the method of minimum probabilistic difference.\n\nThe method works as follows. Let a = a1a2...aN and b = b1b2...bM be two inscriptions with N and M characters, respectively. The parameter called difference is initially set to zero. At each step, we analyze a pair (ai, bj) of characters with 1 ≤ i ≤ N + 1 and 1 ≤ j ≤ M + 1, starting with (a1, b1). Note that when i = N + 1, ai is the empty character. The same happens to bj when j = M + 1. If ai = bj, we consider the corresponding characters to match and we update the current pair to (ai+1, bj+1). There is not match if ai ≠ bj and a character from one inscription never matches two characters in the other. If there is no match between the characters of the pair, then we update the difference parameter following one of these rules:\n\n\n\t\n\twe increment the difference and update the current pair to (ai+1, bj) or (ai, bj+1);\n\t\n\t\n\twe add K to the difference and update the current pair to (ai+x, bj+y), where x and y are chosen randomly with uniform distribution in the intervals [1,N-i+1] and [1, M-j+1], respectively. If i > N, then only x is chosen randomly. If j > M, then only y is chosen randomly.\n\t\n\n\nThe analysis ends when ai and bj) are both the empty character. Note that the difference parameter may vary with the choices made in the procedure.\n\nThe experts consider that, the smaller the computed difference, the higher correspondence between the inscriptions. They want you to write a program to compute the minimum expected difference between two inscriptions.","id":"1888","category":"Ad-Hoc","statistics":{"level":"9 / 10","submissions":67,"solved":23,"ratio":"34.33%"}}