{"output":"For each instance, print a single line containing the minimum area for the instance, rounded to 2 decimal places; if it is not possible to build a triangle from the larvae, print -1.\n\n.","input":"The input is composed of many instances. The first line of the input contains an integer T which indicates the number of instances.\n\nEach instance starts with an integer N, (1 ≤ N ≤ 2*103) the number of larvae, followed by N space-separated real numbers, representing their lengths. The lenght of each larva is a real number between 1 and 500.","level":8,"name":"Training With the Larvae of Phuket","has_images":false,"description":"Thai cuisine is known for combining seasonings so that every dish has flavors that are sweet (sugar, fruits, bell peppers), spicy, sour (vinegar, tamarind, lime), and salty (soy sauce, fish sauce). The most exotic dish, however, is the one containing fried insect larvae; naturally, it is often showcased to tourists. Westerners usually shudder at the thought of eating larvae, but they are highly valued in Thailand and they are a huge success in parties. Thai children often play with food. They specially like building triangles up using fried larvae as the edges.\n\nMarcos \"the (Rubik) solver\" coaches his university's team on a famous computer programming contest. Next year, the contest's world finals will take place in Phuket, Thailand.\n\nMarcos knows how Thai children like to play with larvae, so he had an idea for a special training session. His idea involves preparing a large amount of fried larvae of several different lengths. Each of his friends, in turn, must select three larvae to build a triangle. Then, the amount of fried larvae each friend has to eat is proportional to the area of the triangle she or he built.\n\nMarcos hopes that, since you want to eat as little larvae as possible, you'll write a program to choose the larvae that forms a triangle of minimum area. Thus, besides training your computer programming skills, you'll also be training to face Thai cuisine. If you actually enjoy this dish, you may use this program to help your other friends, making sure that there will be more fried larvae left for you.","id":"1889","category":"Ad-Hoc","statistics":{"level":"8 / 10","submissions":347,"solved":105,"ratio":"30.26%"}}