{"output":"La salida deberá contener \"Y\" en caso de que Charlinho consiga realizar una combinación válida para invocar Prassódia o \"N\" en caso contrario.","input":"La primera línea de entrada contiene 4 enteros, el primer entero N ( 1 ≤ N ≤ 20) representa el número de cartas en la mesa seguido por 3 enteros A,D,H (1 ≤ A,D,H, ≤ 1000) que representan respectivamente el ataque, la defensa y la habilidad exactas para invocar a Prassódia. Cada una de las N líneas siguientes representa una carta de la mesa, donde cada línea contiene los atributos en el orden X,Y,Z (1 ≤ X,Y,Z ≤ 50) ataque, defensa y habilidad respectivamente.","level":6,"name":"¡Es Hora del Duelo!","has_images":false,"description":"Duelo de Monstruos es el campeonato de cartas más famoso del mundo. Cada duelo se disputa entre dos jugadores, cada uno de los cuales comienza con 8000 Puntos de Vida y su Baraja. Cada carta representa un monstruo que tiene los atributos de Ataque, Defensa y Habilidad. Estamos en el duelo final con los dos mayores duelistas de la historia. De un lado Charlinho, un chico al que le gusta mucho estudiar, pero que también sabe sentir el corazón de las cartas. Del otro lado Gilmar, que no se crió a leche con pera, pero es reconocido como el Maestro de las Cartas. Es el turno de Charlinho, y él acaba de combinar sus monstruos en la mesa para obtener al prohibido \"Prassódia\". \n\t\t\t\t\tPrassódia es el monstruo más fuerte del juego, y cuando se lo invoca, la partida finaliza inmediatamente y el jugador que lo invocó gana el duelo. Para invocar a Prassódia es necesario combinar dos o más cartas en la mesa sumando ataque con ataque, defensa con defensa y habilidad con habilidad para obtener los atributos de Prassódia informados al inicio del duelo.\n\t\t\t\t\tSi una carta se elige para ser combinada, los atributos de la carta tienen que ser utilizados por completo, siendo inválido usar sólo el ataque o sólo la defensa o sólo la habilidad de esa carta; más aún, tampoco se puede utilizar sólo una parte del ataque y/o una parte de la defensa y/o una parte de la habilidad. \n\t\t\t\t\tGilmar se espanta por un momento, pues él fue el único en toda la historia que consiguió invocar a Prassódia, pero acaba dudando de la jugada de Charlinho porque habían varias cartas en la mesa, lo que hace a la jugada muy sospechosa. \n\t\t\t\t\tTú eres el Juez del duelo y tienes la responsabilidad de evaluar si Charlinho realmente consiguió invocar o no a Prassódia con las cartas de la mesa.","id":"1896","category":"Ad-Hoc","statistics":{"level":"6 / 10","submissions":1071,"solved":434,"ratio":"40.52%"}}