{"output":"Imprime una única línea que contenga Y si es posible acertar el blanco, o N en caso contrario.","input":"La primera línea contiene el entero N (0 ≤ N ≤ 1000). Las próximas N líneas contienen tres enteros cada una, describiendo las paredes. La línea i (1 ≤ i ≤ N) contiene los enteros Di, Ai y Bi (1 ≤ Di ≤ 104, 1 ≤ Ai < Bi ≤ 104). La última línea contiene tres enteros DT, AT y BT (1 ≤ DT ≤ 104, 1 ≤ AT < BT ≤ 104). Puedes asumir que D1 < D2 < ... < DN < DT.","level":8,"name":"¡Acierta el Blanco!","has_images":true,"description":"\"¡Acierta el Blanco!\" es un juego muy popular en Nlogónia. Las reglas del juego son muy simples. Hay una pelota en el suelo. Además, hay una pared a DT metros de distancia de la bola, la cual contiene un blanco. El blanco comienza a AT metros del suelo, y termina a BT metros del suelo (luego, la longitud del blanco es de BT-AT metros).\n\nTú debes patear la pelota en alguna dirección. La pelota seguirá una línea recta en la dirección en la que fue lanzada. El objetivo del juego es patear la pelota en una dirección tal que la misma acierte cualquier punto del blanco.\n\nPor otra parte, hay también N paredes entre la pelota y el blanco. La pared i (1 ≤ i ≤ N) está a Di metros de distancia de la pelota. Existe sólo una abertura en cada pared. La pared i tiene una abertura que comienza a Ai metros del suelo y finaliza a Bi metros del suelo.\n\nNaturalmente, la pelota debe pasar por todas las aberturas y acertar el blanco. En caso de que la pelota pase exactamente por un punto en el cual una abertura comienza o termina (esto es, a Ai o Bi metros del suelo), considera que la pelota pasa por la abertura con éxito.\n\nDependiendo de las posiciones de las paredes y de las aberturas, puede suceder que no haya una manera de acertar el blanco. Tu tarea es determinar si es posible acertar el blanco o no.\n\nLa siguiente imagen muestra el primer ejemplo de entrada y una posible ruta para la pelota, probando que es posible acertar el blanco en este caso.","id":"1899","category":"Ad-Hoc","statistics":{"level":"8 / 10","submissions":1277,"solved":273,"ratio":"21.38%"}}