{"output":"The single output line shall consist of only one integer, representing the number of possibilities for Professor Antônio Neri's new password, considering that the keypad contains a key for each integer from 1 to N and that the new password is a sequence of K numbers that appear consecutively in a Collatz sequence.","input":"The single input line consists of two positive integers N and K (N, K ≤ 106).","level":9,"name":"Collatz Passwords","has_images":false,"description":"When Professor Antônio Neri, younger, knew the Collatz Conjecture, he got very fascinated. If you do not know the Collatz Conjecture yet, it states that, for any positive integer X, the Collatz sequence for X eventually reaches 1. By the way, the Collatz sequence for a positive integer X is defined as the infinite sequence a0, a1, a2… such that a0 = X and, for each i > 0, ai = ai-1 / 2 if ai-1 is even or ai = 3 × ai-1 + 1 if ai-1 is odd. For example, for X = 7, the first 20 terms of the Collatz sequence are:\n\n\t\t\t\t\t7, 22, 11, 34, 17, 52, 26, 13, 40, 20, 10, 5, 16, 8, 4, 2, 1, 4, 2, 1…\n\n\t\t\t\t\tThe Collatz Conjecture has not been proved yet, despite of existing many brilliant mathematicians in this world, as Professor Antônio Neri. He is still so fascinated by the subject that, the other day, while looking at the alarm system keypad of his house, which contains a key for each integer between 1 and N, he decided to reset his password so that the new password is a sequence of K numbers that appear consecutively in a Collatz sequence. For example, if N = 20 and K = 5, there are 11 possibilities for Professor Antônio Neri's new password:\n\n\t\t\t\t\t1, 4, 2, 1, 4\n\n\t\t\t\t\t2, 1, 4, 2, 1\n\n\t\t\t\t\t3, 10, 5, 16, 8\n\n\t\t\t\t\t4, 2, 1, 4, 2\n\n\t\t\t\t\t5, 16, 8, 4, 2\n\n\t\t\t\t\t6, 3, 10, 5, 16\n\n\t\t\t\t\t8, 4, 2, 1, 4\n\n\t\t\t\t\t10, 5, 16, 8, 4\n\n\t\t\t\t\t12, 6, 3, 10, 5\n\n\t\t\t\t\t16, 8, 4, 2, 1\n\n\t\t\t\t\t20, 10, 5, 16, 8","id":"1906","category":"Ad-Hoc","statistics":{"level":"9 / 10","submissions":502,"solved":65,"ratio":"12.95%"}}