{"output":"For each case, output a single line, the least amount of button clicks required to get from the source channel to the destination or -1 if it is impossible to reach the destination channel due to the restrictions of Clotilde.","input":"There will be several test cases. Each one begins with three integers, O, D and K (1 ≤ O, D ≤ 105, 0 ≤ K ≤ 100), representing, respectively, the source channel, destination, and the amount of channels that Clotilde does not want to pass. The second line contains the K channels banned by Clotilde. It is guaranteed that the source and destination channel will never be banned.\n\n\t\t\t\t\tThe input ends with O = D = K = 0, which should not be processed.","level":8,"name":"Help Clotilde","has_images":true,"description":"Clotilde loves watching television, but her television control is not conventional. It has only six buttons, the on/off button and five buttons to change channels.\n\n\t\t\t\t\tThe channel change buttons work as follows: +1 (advances one channel), -1 (subtract one channel), x2 (double the current channel), x3 (triple the current channel) and /2 (goes to the half of the current channel, this button only works if the current channel is even).\n\n\t\t\t\t\t\n\n\t\t\t\t\t Here’s the Clotilde famous controll.\n\n\t\t\t\t\tThe Clotilde neighbors often visit her house on weekends, watch television and do not return to channel it was before, causing Clotilde waste lots of time trying to find the channel of her interest again.\n\n\t\t\t\t\tYour task is, given the number of the current channel and the number of the channel that Clotilde wants to watch, you must calculate the least amount of button clicks needed to get out of one and get the other. Remeber that as Clotilde is a serious woman, she does not like to go through some specific channels even if you have to press more buttons to get to the destination channel. Another constraint is, there is no channel that is lower or equal to 0 or greater than 105. Ex: If you are in the channel number 55000, you can’t press the button x2 or x3.","id":"1910","category":"Graph","statistics":{"level":"8 / 10","submissions":3172,"solved":781,"ratio":"24.62%"}}