{"output":"For each test case, your program should print a single line with the value the height of the largest cylinders tower that can be built, followed by the word \"centimetro(s)” (centimeters in portuguese).","input":"The input contains several test cases. The first line of each test case contains an integer N (1 ≤ N ≤ 10³), representing the number of cylinders arranged on the table, following N rows, each row having a height h (1 ≤ h ≤ 1000) of the cylinder in centimeters, the radius r (1 ≤ r ≤ 1000) of the cylinder base and a word p, representing the color of the cylinder. The word can be: VERMELHO (red in portuguese), LARANJA (orange in portuguese), VERDE (green in portuguese), or AZUL (blue in portuguese). The end of input is indicated as N == 0, which should not be processed.","level":8,"name":"Help Mr. Barriga","has_images":true,"description":"Nhonho, son of Mr. Barriga is participating of a new game created by the townhouse’s children, the game is well know by “cylinders Tower”. The game is to build the tallest tower made up of cylinders, respecting all the rules, of course! Just below it is described the operation of the game.\n\n\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tWill be arranged on the table, an amount of N cylinders.\n\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tEach cylinder has one color: Red, orange, green or blue.\n\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tEach cylinder has one heigth h and a base with radius of size r.\n\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tTo the build the tower, the cylinders should to be stacked, and the top cylinder should ever have the base smaller that the base of the cylinder below it. Except the first cylinder, it can have the base of any size, since there is no other cylinder below it.\n\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\tThere are also some restrictions very interesting on colors of the cylinders. They are described below.\n\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\tA red cylinder cannot to be put on an orange cylinder\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\tAn orange cylinder cannot to be put on a blue cylinder\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\tA blue cylinder cannot to be put on a green cylinder\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\tA green cylinder cannot to be put on a red cylinder\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t\t\n\n\t\t\t\t\tTired of seeing his son complain of losing forever and consequently to hear the phrase \"Look at him huh! Look at him huh! Look at him ... \" multiple times, Mr. Barriga want to give a small tip for Nhonho, telling the height greater than can be built given the list with the characteristics of cylinders available for construction of the tower. However, although being good at math and collect the rent properly, Mr. Barriga was unable to calculate the maximum height that the tower may have due to the large amount of available cylinders. So he hired you to write a program able to inform this value.\n\n\t\t\t\t\tTo help you better understand the problem, Mr. Barriga showed him through a drawing the height of the highest possible tower to be built with five parts, following all the rules of the game. Below you can see the drawing of Mr. Barriga.","id":"1913","category":"Paradigmas","statistics":{"level":"8 / 10","submissions":391,"solved":133,"ratio":"34.02%"}}