{"output":"For each test case, your program should print a line with the number of hours and minutes that are currently registered in the simulated hour bank for Jaiminho in the following format: \"S HH:MM\", where S may be the sign \"-\" representing negative hours in the bank, or \"+\" sign representing plus hours in the bank, HH is the number of hours and MM is the number of minutes of the hour bank simulado. In the case of the HH:MM equals midnight, you can consider how plus hours.","input":"The first input line contains a single integer QT ( 1 ≤ QT ≤ 100) indicating the number of test cases following. Each test case starts with a line containing a single integer N (1 ≤ N ≤ 10³) representing the number of records in Jaiminho sheet, follow N lines, each line containing the description of the entry and exit times in the following format \" A1:B1 A2:B2 | C1:D1 C2:D2 \", where A1 and B1 respectively represent the hours and minutes of input in the first period of work, A2 and B2 respectively represent the hours and minutes output of the first Labor Day period, C1 and D1 represent respectively the hours and minutes of input the second period of the work and C2 and D2 respectively represent the hour and minute output of the second period of work in the day. Jaiminho ensures that never slept at work which (A1:A2 ≤ B1:B2 && C1:D1 ≤ C2:D2) and the hours and minutes in your hour bank never exceed 2 digits. Remember, one day has 24 hours and 1 hour has 60 minutes.","level":5,"name":"Jaiminho’s Bank Hours","has_images":false,"description":"The company in which the postman Jaiminho works has a bank hours policy very interesting. Every time an employee starts his activities he must register his arrival at \"point machine\" getting a little proof, just as every time the employee terminates its activities it must also record the end. Most employees never had the curiosity to know how the \"point machine\" processes the number of hours worked, but Jaiminho well as being an excellent employee is rather curious.\n\n\t\t\t\t\tTo register your digital (the first day of work) Jaiminho was informed by a lady who works in the Human Resources department that there is a 5-minute tolerance in both input and output. The Jaiminho workday consists of two periods, from 08:00 hrs to 12:00 hrs and 14:00 hrs to 18:00 hrs (accounting for 8 hours worked per day), so if he gets to 07: 55 hrs and leave at 12:03 hrs, the \"point machine\" notice that he respected tolerance and not register any minute more or less in the bank of hours of Jaiminho, but in the second part of his shift, he register their input to 13:54 hrs and 18:02 hrs to his output, the machine will realize that he abused tolerance and then add six minutes extra in your bank hours.\n\n\t\t\t\t\tAs Jaiminho is a dedicated employee and always tries to avoid fatigue, he set up a spreadsheet with the record (entry and exit times) every day worked, but unfortunately he is not a programmer and needs your help to simulate the bank hours of company that he works.","id":"1916","category":"Ad-Hoc","statistics":{"level":"5 / 10","submissions":169,"solved":97,"ratio":"57.40%"}}