{"output":"For each test case, print a single line with the amount of virus that will be alive at the end of the minutes requested by Chapolin Colorado.","input":"There will be several test cases. Each case begins with two integers, X and Mf (1 ≤ X≤ 105, 1 ≤ Mf ≤ 105) representing respectively the initial amount of inserted virus on planet earth and the minute Chapolin want to know the amount of virus that will be living on the planet.\n\n\t\t\t\t\tThe input ends with X = Mf = 0, which should not be processed.","level":8,"name":"Help Chapolin Colorado!","has_images":true,"description":"Tripa Seca is an accomplished computer programmer, but unfortunately he is part of an entity formed by the most ruthless villains of the universe. After mastering countless planets, the next target of this entity is the planet Earth and the focus is to capture all the technology of the Terrans. The organization's headquarters until a few days ago had never been sighted by any wight of the planet Earth, but the mighty Colorado Chapolin with all his cunning, accomplished this feat and managed to enter the meeting room of super villains. And guess what? The villains was having a large meeting!\n\n\t\t\t\t\tChapolin heard all the talk of villains and discovered that the plan to conquer the planet Earth, is to create a super powerful virus able to master any device that uses some kind of terrestrial technology. Just then Chapolin Colorado took his audio recorder and began recording Tripa Seca explaining the operation of the virus. Below is described a part of the recording:\n\n\t\t\t\t\t\"[..] First my virus is able to reproduce, but unfortunately I messed up somewhere in the algorithm and the virus has a limited lifetime (Admit, nobody's perfect!), So at the end of the second minute of life the virus dies, but the beginning of each minute 1 virus is born of another older viruses alive, and that is able to inherit the same characteristics as the parent virus, such as the ability to reproduce and also the limited lifetime. Even living with the problem of limited lifetime, I'm pretty sure that the devastation is huge and we dominate all the technology this futile planet... My idea is this: put a virus X amount of earthlings on the planet and I will let them to meet the rest of the service! For example, if I will put the beginning only 1 virus, according to my calculations already in the end of the third minute have 5 virus! [..] \"\n\n\t\t\t\t\tAlthough Chapolin be a great hero, he's not very good to understand certain explanations and asked the teacher Girafales explained to him the ability to destroy those viruses, so it has a sense of how the Earth is in danger. After several unsuccessful attempts, the teacher Girafales decided to design the process and show Chapolin. See the teacher's drawing Girafales below:\n\n\t\t\t\t\t \n\n\t\t\t\t\t\n\n\t\t\t\t\tHowever Chapolin found the design a great insult to his mental ability and asked to inform you that the amount of virus that will at any given minute, given the amount of virus initially inserted by Tripa Seca. An important detail, Chapolin hate broken numbers or debris, he likes to see the original number without any court!","id":"1917","category":"Ad-Hoc","statistics":{"level":"8 / 10","submissions":219,"solved":96,"ratio":"43.84%"}}