{"output":"Print the position (row and column) of the chair Ordan must sit in.","input":"In the first line there’s two integers 1 ≤ l, c ≤ 1000, representing respectively the number of rows and columns of the auditorium. In the next l rows there will be c characters. The characteres can be ('n','b,'*').","level":10,"name":"Ordan and The Girls","has_images":false,"description":"Ordan is at the great Campina Grande Shopping Mall, he’s going participate of an anime and game convention. Today is the first day of the convention and the opening is about to start, it’ll be at the auditorium of the mall. Some people already took their places, there a lot of boys, but also many girls. To be around girls makes Ordan very happy.\n\n\t\t\t\t\tOrdan wants to sit at a chair of the room that's adjacent to the maximum number of girls together, so then he can flirt with them, of course. The room can be seem as a two dimension matrix, and the chairs are identified by two integers, the number of the column and the number of the row.\n\n\t\t\t\t\tIf there’s an ‘n’ in the position it means that is a girl sitting in that chair, if there’s a ‘b’ it means there’s a boy sitting in the chair, in the case of an ‘*’ it means the chair of that position is empty.\n\n\t\t\t\t\t    1 2 3 4\n\n\t\t\t\t\t1  n n n n\n\n\t\t\t\t\t2  b n * n\n\n\t\t\t\t\t3  n b * b\n\n\t\t\t\t\t4  b b n b\n\n\t\t\t\t\tIn this example, there are two empty chairs, if Ordan sit in the chair (2,3) he will be close to 6 girls that are together, in the other hand if he sits in the chair (3, 3) he will be close to only a girl, so he prefers to sit in the (2,3).\n\n\t\t\t\t\tYour task is to determine which empty chair Ordan must sit to be around the maximum number of girls. In the case of a draw you must pick the one in the position more at north, if it is still a draw you must pick the one more at left.\n\n\t\t\t\t\tIt’s guaranteed that will always have an empty chair.","id":"1925","category":"Graph","statistics":{"level":"10 / 10","submissions":736,"solved":129,"ratio":"17.53%"}}