{"output":"Your program shall print two lines, informing in the first how many left coxinhas are inside the packet and the price of each one, and in the second the same information but for right coxinhas. The output must follow strictly the format clarified in the samples below.","input":"Three lines make the input. The first input line consists of 3 values, N, D and P, such that the first is an integer and the others are given with two digits after the decimal point: N (3 ≤ N ≤ 106) represents the number of measurements reported by the scanner, D (0.01 ≤ D ≤ 100.00) represents the difference between the price of a left coxinha and the price of a right one, and P (0.01 ≤ P ≤ 10000000.00) represents the total price of the coxinhas in the packet. The second input line consists of N positive integers not greater than 30, which represent the results of the measurements reported. The last input line consists singly: of a left coxinha, represented by <), if the left coxinhas are more expensive than the right ones; or a right coxinha, represented by (>, otherwise.","level":10,"name":"The Search for Spock","has_images":true,"description":"‘Coxinha’ is the name given to a traditional Brazilian food which consists of shredded chicken meat covered in dough and fried. Recently Mr. Spock, the chef of Enterprise, a restaurant in Chapecó, has won an important gastronomy award, for making the most delicious coxinhas in the world. You should try a Mr. Spock's coxinha. They are so amazing that the flavour will boldly take you to where no man has gone before. But it is not easy to get a coxinha in Enterprise. The search for Spock is such that it is needed to place an order at least 42 days earlier.\n\nMr. Spock likes to make coxinhas of different sizes and shapes. In order to shape a coxinha, he first picks up at least two circular bottomless pans of same height but diameters all distinct. Then he puts one pan over the other in decreasing order of diameter from the base to the top, tying them with a string on the side. Finally, he uses the pans to shape his coxinha. The first and the second figures show the pan structure as seen respectively from above and from the front. The third and the forth figures show the resulting coxinha, also as seen respectively from above and from the front.\n\n\n\nAiming to better serve his clients, Enterprise also offers delivery service. Something important that Mr. Spock has found out is that, if he does not want the coxinhas to lose their flavour and crunchiness, he must put them in the packet sequentially, one after the other, always reclined in a manner that the bases stay perfectly perpendicular to the bottom of the packet. Further, consecutive coxinhas in the sequence must always have either their bases or their tops touching, and the touching parts must always have the same diameter. Coxinhas whose tops point to the left are called ‘left coxinhas’, those whose tops point to the right are called ‘right coxinhas’, and Mr. Spock uses the coxinhas orientation so the client can know the type of seasoning in the filling of each one. No matter the size, two coxinhas are sold by the same price if and only if either both are left coxinhas or either both are right. There is always at least one left coxinha and at least one right coxinha in a packet. The figure below illustrates a packet (dashed lines) containing 4 coxinhas (continuous lines). As you can see, the coxinhas always fit perfectly in the packet.\n\n\n\nYou have been hired to work in Enterprise quality control team. Your function is to take the already full packets, pass them through an X-ray scanner and, based on the measurements reported by the scanner, determine how many left and how many right coxinhas there are in the packets. The measurements are made from the left to the right, at a spacing identical to the height of the pans used in the shaping of the coxinhas. In each measurement it is reported the height of the coxinha inside the packet at that point, but only if the result of the measurement is different from the result of the previous measurement (otherwise, nothing is reported). In the figure above, 14 measurements are illustrated by the dotted lines. Note that only 10 of them are reported.\n\nAs you are new in the team, your colleagues have hidden from you the coxinhas prices and they want you not only to calculate how many left and how many right coxinhas there are in the packet, but also to guess the price of left coxinhas and the price of right coxinhas. For this purpose, they have told you the total price of the coxinhas in the packet, the difference between the two prices and the type of the coxinhas which are more expensive.","id":"1965","category":"Ad-Hoc","statistics":{"level":"10 / 10","submissions":207,"solved":37,"ratio":"17.87%"}}