{"output":"For each event of the form -> A B, output a line containing a value that represents the number of the possibilities for the file entered into the machine. After processing all events, output an extra line containing a value that represents the number of possibilities for the file which A. K. M. would enter into the machine if he wanted to send a message for all the G generations. As the numbers of possibilities represented in each output line can be very large, output only the remainder they leave when divided by 109 + 7.","input":"The first input line consists of two integers, G e E (1 ≤ G, E ≤ 105), which represent respectively the number of generations registered in the machine and the number of events described in the input. The generations are identified in the input by the integers from 1 to G. The second input line consists of G integers, in a way that the ith integer, Ci (2 ≤ Ci ≤ 1010, 1 ≤ i ≤ G), represents the message length settled by the generation i. Each one of the E lines following represents an event and follows one of formats below:\r\n\r\n                    \r\n                        \r\n                            -> A B\r\n                            indicates that A. K. M. has entered a file into the machine to send a message to each generation from A to B (1 ≤ A, B ≤ G);\r\n                        \r\n                        \r\n                            <- A C\r\n                            indicates that the message length settled by the generation A must be updated to C (1 ≤ A ≤ G, 2 ≤ C ≤ 1010).","level":10,"name":"Generations","has_images":false,"description":"It is not possible yet to build a machine that allows time travel to a body made of matter. However, the physicist Asdrubal Keyla Monteiro has already developed a machine able to send messages through time, communicating with generations of the future. Theoretically it would be also possible to use this machine to send messages to generations of the past, but they would not have the technology to receive those messages. Each message is a binary sequence of a fixed length settled by the generation with which A. K. M. is communicating. The end of each message is always marked by 11, a pattern that obviously cannot happen in any other place of the message, otherwise the message would arrive truncated at its destination. For example, if the message length settled by the generation with which A. K. M. is communicating is 6, there are 5 possibilities for the message sent to that generation:\r\n\r\n000011      001011      010011      100011      101011\r\n\r\nThe interesting thing about this communication protocol is that, by concatenating the messages it is possible to enter a single file into the machine so that the machine sends a message to each one of a specified set of generations. For example, if A. K. M. wants to communicate with the generations registered in the machine respectively as 1, 2 and 3, and if the message lengths settled by the generations are respectively 3, 5 and 3, there are 3 possibilities for the file that can be entered into the machine:\r\n\r\n01100011011      01101011011      01110011011\r\n\r\nThe machine developed by A. K. M. only sends messages. For now, it is not possible to receive messages from the future. The only thing possible to receive from a generation of the future is the message length information. Often the generations update this value, and A. K. M. needs to be alert.","id":"1969","category":"Matemáticas","statistics":{"level":"10 / 10","submissions":189,"solved":36,"ratio":"19.05%"}}