{"output":"If it is not possible to satisfy the conditions of Pikachu S. A., print a line containing singly the smiley :[. Otherwise, print two lines: the first containing singly the smiley :]; and the second containing three values, representing respectively the number of trainees needed, the number of permanent employees and the minimum cost needed to restore the infrastructure.","input":"The first input line contains two integers, N and M (2 ≤ N ≤ 103, 0 ≤ M ≤ 105), which respectively represent the number of towers and the number of connections in the old infrastructure, such that each connection is described in one of the M lines following by two integers, i and j (1 ≤ i, j ≤ N), which identify the towers that were connected. Finally, the ith of the N last input lines describes the binary code, of positive length not greater than 100, of the tower i.","level":10,"name":"Into Darkness","has_images":true,"description":"And this was the 3rd UFFS Junior Programming Contest! We sincerely hope you have had fun! If you have maybe not been able to solve a problem, discuss it later with your colleagues and professors, study the contents you do not master yet, and face the problem again. All the problems in this contest will be available at URI Online Judge as soon as possible. If you had never joined a Programming Contest before and have liked it, come and join our Programming Club, so you can improve your skills, learn more and train!\n\n                    \n\n\t\t\t\t\tBut before we can say goodbye, we still have another task for you. Santa Catarina's west region has fallen into complete darkness, for a tornado devastated the region. Before, the electrical infrastructure was amazing, so that two energy towers were connected directly by energy cables if and only if between those towers there was a road. The tornado did not damage the roads, only the towers and energy cables. Among all companies which proposed to restore the electrical infrastructure of the region, the one which has presented the best proposal was Pikachu S. A. In order to start the jobs, Pikachu S. A. has asked the Government for some information. If this information does not satisfy some conditions, Pikachu S. A. will annul the contract and the Government will have to hire another company, for our sadness. By the way, the conditions required by Pikachu S. A. are:\n\n\n\tThe company will not build any new tower, only will restore all the old towers.\n\tThe company will not connect two towers by energy cables if those towers were not connected before.\n\tThe company will make only the minimum number of connections between towers needed to interconnect all towers, directly or indirectly, and will spend as least as possible of metres of cabling.\n\tEach tower restored will need to receive a Pikachu S. A.'s employee to monitor the tower daily. This employee can be either a permanent employee or a trainee.\n\tIf the employees that two towers receive are trainees, then there must be a road connecting both towers directly.\n\tIf the employees that two towers receive are permanent employees, then there cannot be a road connecting both towers directly.\n\tThe number of permanent employees must be minimal.\n\n\nA curiosity about the old infrastructure is that to each tower a binary code has been assigned, so that the connection between two towers, if there was any, would cost, in centimetres of cabling, exactly the length of the greatest binary subcode common to the codes of both towers. For example, if the codes of two towers were respectively 000011 e 001100, the cost of the connection between these two towers was, and still is, 4.","id":"1974","category":"Graph","statistics":{"level":"10 / 10","submissions":40,"solved":11,"ratio":"27.50%"}}