{"output":"Para cada caso de prueba, imprimir en la salida una lÍnea conteniendo un entero que representa la mÍnima cantidad de rutas que es necesario agregar para que cada isla pertenezca al menos a un circuito turÍstico.","input":"Cada caso de prueba se describe utilizando varias líneas. La primera línea contiene dos enteros N y M que indican respectivamente la cantidad de islas y la cantidad de rutas entre ellas (3 ≤ N ≤ 100, 1 ≤ M ≤ 1000). Las islas son identificadas por enteros diferentes entre 1 y N. Cada una de las M líneas siguientes describe una ruta distinta utilizando dos enteros diferentes U y V que identifican a las islas conectadas por esa ruta (1 ≤ U < V ≤ N). Asumir que en cada caso de prueba no hay más de una ruta que conecte el mismo par de islas. El final de la entrada se indica con una línea que contiene dos veces el número −1.","level":10,"name":"Circuitos Turísticos","has_images":false,"description":"Todo el mundo conoce el archipiélago de Nordenskjold del ártico siberiano, el cual depende del Krai de Krasnoyarsk, integrante de la Federación de Rusia. El archipiélago esá formado por N islas y M rutas acuáticas bidireccionales. Cada ruta conecta directamente un determinado par de islas, y para cada par de islas existe a lo sumo una ruta que las conecta.\n                    \n                    Dada la popularidad que tiene hoy en día el archipiélago de Nordenskjold, el gobierno de Krasnoyarsk está preocupado por el valor turístico del mismo. El valor turístico del archipiélago está dado por la cantidad de islas que pertenecen al menos a un “circuito turístico”. Un circuito turístico es un recorrido que comienza y termina en la misma isla, tiene al menos 3 islas, no llega más de una vez a la misma isla, y utiliza las rutas acuáticas para pasar de una isla a otra.\n                    \n                    El gobierno de Krasnoyarsk quiere saber cuál es la mánima cantidad de rutas adicionales que es necesario construir para que cada isla del archipiélago de Nordenskjold pertenezca al menos a un circuito turístico. Ustedes fueron contratados para responder esa pregunta. Dado que el clima en el archipiélago es extremadamente severo, nuestra recomendación es que hagan ahora mismo un programa que resuelva el problema, y de ese modo eviten viajar hasta allá.","id":"1988","category":"Graph","statistics":{"level":"10 / 10","submissions":44,"solved":7,"ratio":"15.91%"}}