{"output":"Para cada caso de prueba, imprimir en la salida línea por línea conteniendo un entero que representa la cantidad de conjuntos equilibrados que se pueden obtener agregando un elemento al conjunto de entrada.","input":"Cada caso de prueba se describe utilizando dos líneas. La primera línea contiene un entero impar N que indica la cantidad de elementos que debe tener el conjunto equilibrado (3 ≤ N ≤ 499). La segunda línea contiene N − 1 enteros distintos Zi que representan a los N − 1 elementos ya prefijados (−1014 ≤ Zi ≤ 1014 para 1 ≤ i ≤ N − 1). El final de la entrada se indica con una línea que contiene el número −1.","level":9,"name":"Equilibrio","has_images":false,"description":"La media y la mediana muchas veces confunden a los estudiantes por sus nombres similares, pero son dos cosas muy diferentes. En este problema vamos a trabajar con la media y la mediana de un conjunto formado por una cantidad impar de enteros, todos distintos entre sí. En este caso, si N es la cantidad de elementos del conjunto, la media es la suma de los mismos dividido N, mientras que la mediana es aquel elemento del conjunto que tiene (N−1)/2 elementos menores que él y (N−1)/2 mayores. Por ejemplo, si el conjunto es {0, 2, 6, 4, 13}, la media es 5 mientras que la mediana es 4.\n                    \n                    Queremos simplificar la tarea de los estudiantes generando conjuntos “equilibrados”, donde no haya diferencia entre media y mediana. Decimos que un conjunto es equilibrado si está formado por una cantidad impar de enteros, todos distintos entre sí, y la media coincide con la mediana. Por ejemplo, el conjunto {0, 2, 6, 4,−2} es equilibrado, ya que tiene N = 5 enteros distintos, y tanto la media como la mediana valen 2.\n\n                    Se sugirió el siguiente procedimiento para obtener conjuntos equilibrados. Se elige cualquier conjunto con una cantidad par de enteros distintos entre sí, y se le agrega otro entero diferente a los que tenía, de manera tal que en el conjunto obtenido la media coincida con la mediana. Para ver si el procedimiento funciona, necesitamos un programa que dados N − 1 enteros distintos entre sí, con N impar, nos diga cuántos conjuntos equilibrados de N elementos se pueden obtener usando el procedimiento descripto.","id":"1990","category":"Matemáticas","statistics":{"level":"9 / 10","submissions":176,"solved":78,"ratio":"44.32%"}}