{"output":"Para cada caso de prueba, imprimir en la salida una línea conteniendo un racional que representa la longitud en metros del puente más corto que conecta ambas costas del río en la dirección norte-sur. Redondear el resultado al racional más cercano con 2 dígitos decimales. En caso de empates, redondear hacia arriba. Siempre utilizar exactamente 2 dígitos luego del punto decimal, incluso si eso significara terminar con un cero.","input":"Cada caso de prueba se describe utilizando tres líneas. La primera línea contiene un entero A que indica el ancho en metros del río (3 ≤ A ≤ 107). La segunda línea describe la costa norte del río, mientras que la tercera describe la costa sur del mismo.\n\n                    La descripción de cada costa comienza con un entero C que representa la cantidad de semicircunferencias que modelan esa costa (1 ≤ C ≤ 200). Luego sigue un caracter “N” o “S” indicando respectivamente que la semicircunferencia que está más hacia el oeste en esa costa está orientada hacia el norte o hacia el sur. La descripción termina con C enteros Ri que representan los radios en metros de las semicircunferencias de esa costa (1 ≤ Ri < A/2 para 1 ≤ i ≤ C). Las semicircunferencias se describen ordenadas desde la que está más hacia el oeste en esa costa (radio R1) hasta la que está más hacia el este (radio RC). Las orientaciones de las semicircunferencias se alternan entre norte y sur a partir de la orientación que se indica para la semicircunferencia que está más hacia el oeste. Asumir que en cada caso de prueba las costas están alineadas entre sí, lo que implica que la suma de los radios de las semicircunferencias de cada costa es la misma.\n                    \n                    El final de la entrada se indica con una línea que contiene el número −1.","level":10,"name":"Fábrica de Puentes","has_images":true,"description":"En el Área Central de Macedonia (ACM) hay un río que corre en dirección oeste-este. Los habitantes de la región quieren construir un puente que atraviese el río en dirección nortesur, para lo cual contrataron a la fábrica de puentes más barata que conocen, la Industria Constructora de Puentes Cortos (ICPC). Como su nombre lo indica, la constructora se especializa en fabricar los puentes más cortos posibles para cada río.\n\n                    Lo primero que hizo la ICPC fue modelar las costas (norte y sur) del río. Cada una de ellas se considera formada por semicircunferencias de radios diversos, orientadas alternadamente hacia un lado y hacia el opuesto, con sus centros todos colineales. Las dos rectas que quedan definidas por los centros de las semicircunferencias de cada costa tienen dirección oeste-este, y están a una distancia A una de la otra. Este valor A recibe el nombre de ancho del río. Las costas están alineadas entre sí, es decir, la costa norte no comienza ni termina más al oeste ni más al este que la costa sur.\n\n                    En la siguiente figura aparece el modelo de cierto río. En la costa norte la semicircunferencia que está más hacia el oeste está orientada hacia el norte, mientras que en la costa sur la semicircunferencia que está más hacia el oeste está orientada hacia el sur. En cada costa las orientaciones de las sucesivas semicircunferencias se alternan. El puente más corto posible en dirección norte-sur es el mostrado.\n\n                   \n                        \n\n\n                    La tarea de ustedes es ayudar a la constructora determinando la longitud del puente más corto que conecta ambas costas del río del ACM en la dirección norte-sur.","id":"1991","category":"Geometría Computacional","statistics":{"level":"10 / 10","submissions":91,"solved":22,"ratio":"24.18%"}}