{"output":"Para cada caso de prueba, imprimir en la salida una línea conteniendo un racional que representa el mínimo tiempo (en segundos) que se necesita para realizar el recorrido sin infringir ninguna de las reglas, o un asterisco (“*”) si es imposible lograrlo. Redondear el resultado al racional más cercano con 2 dígitos decimales. En caso de empates, redondear hacia arriba. Siempre utilizar exactamente 2 dígitos luego del punto decimal, incluso si eso significara terminar con un cero.","input":"Cada caso de prueba se describe utilizando varias líneas. La primera línea contiene cuatro enteros N, L, A y D. El valor N representa la cantidad de puntos de control que hay en el recorrido (1 ≤ N ≤ 105). El valor L indica la longitud del recorrido (2 ≤ L ≤ 107). Los valores A y D representan respectivamente la aceleración y desaceleración máximas permitidas según fue explicado antes (1 ≤ A,D ≤ 100). Cada una de las N líneas siguientes describe un punto de control diferente utilizando tres enteros X, V y W que representan respectivamente la distancia entre el punto de control y el inicio del recorrido (1 ≤ X ≤ L − 1), la velocidad mínima, y la velocidad máxima de un micro que pasa por ese punto (1 ≤ V ≤ W ≤ 100). Asumir que en cada caso de prueba los puntos de control aparecen ordenados de manera estrictamente creciente de acuerdo a su distancia desde el inicio del recorrido. Las longitudes están expresadas en m, las velocidades en m/s, y las aceleraciones en m/s2. El final de la entrada se indica con una línea que contiene cuatro veces el número −1.","level":2,"name":"Ganando Tiempo","has_images":false,"description":"Graciela maneja un micro escolar. Lamentablemente, día a día es objeto de burlas por ser una de las pocas mujeres que se dedica a esa profesión. Para mejorar su imagen ha decidido agregar a su prudencia en el manejo, eficiencia en el tiempo de viaje. La idea de Graciela es realizar su recorrido en el menor tiempo posible, pero sin transgredir las normas de tránsito.\n\n                    El micro que maneja Graciela tiene un sistema muy moderno que le permite ajustar la aceleración a cualquier número real instantáneamente. Por lo tanto, la aceleración es constante por intervalos, saltando a otra aceleración cuando Graciela así lo decide. Si v es la velocidad del micro en un momento dado y a su aceleración que se mantiene constante durante un intervalo de tiempo t, entonces la velocidad al final del intervalo será v + at. Además, el micro habrá avanzado una distancia at2/2+vt durante ese intervalo de tiempo.\n\n                    Las normas del Tratado Argentino de Interacción con Pedales (TAIP) impiden que un micro utilice una aceleración mayor a A o una desaceleración mayor a D, es decir, que los valores permitidos para la aceleración son únicamente los números reales entre −D y A, inclusive. Además, el tratado establece la existencia de puntos de control, en los cuales la velocidad de un micro no puede estar por debajo de cierta velocidad mínima ni por arriba de cierta velocidad máxima.\n                    \n                    Graciela conoce los puntos de control que aparecen en el recorrido que realiza, la longitud del mismo, y las constantes A y D. Al inicio del recorrido, tanto la velocidad como la aceleración del micro son 0. No hay restricciones adicionales respecto de la velocidad ni de la aceleración que puede tener el micro al finalizar su recorrido (en particular, no es obligatorio que frene). El trabajo de ustedes es utilizar esos datos para determinar el mínimo tiempo que necesita Graciela para realizar su recorrido apegándose a las normas del TAIP.","id":"1992","category":"Matemáticas","statistics":{"level":"2 / 10","submissions":12,"solved":2,"ratio":"16.67%"}}