{"output":"Para cada caso de prueba, imprimir en la salida una línea conteniendo un racional que representa la mínima distancia que Humberto tiene que caminar para ir desde el punto de partida hasta el punto de llegada, utilizando eventualmente las catapultas. Redondear el resultado al racional más cercano con 2 dígitos decimales. En caso de empates, redondear hacia arriba. Siempre utilizar exactamente 2 dígitos luego del punto decimal, incluso si eso significara terminar con un cero.","input":"Cada caso de prueba se describe utilizando varias líneas. La primera línea contiene cinco enteros N, PX, PY , LX y LY . El valor N representa la cantidad de catapultas que hay en el campo (1 ≤ N ≤ 100). El par (PX, PY ) indica el punto de partida en el plano XY del recorrido de Humberto, mientras que el par (LX, LY ) indica análogamente el punto de llegada (1 ≤ PX, PY , LX, LY ≤ 109). Cada una de las N líneas siguientes describe una catapulta diferente utilizando tres enteros CX, CY y F, los cuales indican que en el punto (CX,CY ) hay instalada una catapulta de fuerza F (1 ≤ CX,CY , F ≤ 109). Esto significa que Humberto se puede transportar, sin necesidad de caminar, desde el punto (CX,CY ) hasta cualquier punto que esté a una distancia de exactamente F del punto (CX,CY ). Asumir que en cada caso de prueba todos los puntos informados son distintos (el punto de llegada es distinto al punto de partida, no hay catapultas en ninguno de los dos, y no hay dos catapultas en el mismo punto). El final de la entrada se indica con una línea que contiene cinco veces el número −1.","level":8,"name":"Holgazán","has_images":false,"description":"Humberto es muy holgazán. Es tan perezoso que hasta le da fiaca ser vago. No es extraño que casi no haya trabajado durante toda su vida, pero tuvo suerte y ganó mucho dinero en la lotería. Con parte de ese dinero compró un campo vacío e hizo contruir varias casas dentro del mismo, a donde se mudaron Humberto junto con sus familiares y amigos. Es así que Humberto puede ir en línea recta de cualquier punto a cualquier otro del campo, sin tener que caminar de más por culpa del diseño urbano (consideramos insignificante rodear un árbol, una casa o cualquier otro elemento que se interponga en el camino de Humberto).\n\n                    Lamentablemente, la situación de Humberto es de una holgazanería tal que esto no le bastó. Para caminar aún menos, hizo instalar catapultas en ciertos lugares estratégicos del campo. Cada catapulta puede enviarlo desde el punto donde está instalada a cualquier punto a una cierta distancia fija que depende de la fuerza de la catapulta.\n                    \n                    La fortuna por fin parecía sonreirle a Humberto, hasta que se le presentó un nuevo problema. Caminar en línea recta era muy fácil, mientras que ahora con las catapultas los recorridos son más complicados. Humberto ya está cansado de tantos problemas. Como todavía tiene mucho dinero, los contrató a ustedes para que le digan la mínima distancia que tiene que caminar para movilizarse de un punto a otro del campo.","id":"1993","category":"Graph","statistics":{"level":"8 / 10","submissions":432,"solved":117,"ratio":"27.08%"}}