{"output":"Para cada caso de prueba, imprimir en la salida una línea conteniendo un entero que representa la mínima cantidad de años luego de los cuales es posible que un único imperio domine todas las fortalezas.","input":"Cada caso de prueba se describe utilizando dos líneas. La primera línea contiene un entero N que representa la cantidad de fortalezas (2 ≤ N ≤ 104). Las segunda íınea contiene N −1 enteros Pi indicando que al construir la (i+1) -ésima fortaleza, ésta fue conectada por un camino directo a la fortaleza Pi (1 ≤ Pi ≤ i para 1 ≤ i ≤ N − 1). El final de la entrada se indica con una línea que contiene el número −1.","level":8,"name":"Imperialismo","has_images":true,"description":"La sed de conquista es algo común en la historia de la humanidad. . . y del universo entero.\n\n                    En el planeta Imperius hay actualmente N fortalezas que fueron contruídas de a una por vez. Cada fortaleza en el momento de ser construída recibió un número diferente entre 1 y N, según su orden cronológico de construcción. Además, cada fortaleza (excepto la primera) fue conectada a exactamente una de las fortalezas ya existentes por un camino directo que servía de vía comercial. Esto era suficiente para que cualquier fortaleza pudiera comerciar con cualquier otra, eventualmente pasando por otras fortalezas intermedias.\n\n                    El planeta era cada vez más próspero y pacífico, hasta que se dejaron de construir fortalezas. En ese momento, N imperios diferentes se formaron, y cada uno dominó una fortaleza diferente. De manera previsible, la sed de conquista se apoderó de Imperius. Es así que cada año, exactamente uno de los imperios sobrevivientes conquista a los imperios vecinos a él, y pasa a dominar todas las fortalezas que eran dominadas por ellos. Dos imperios son vecinos si existen al menos dos fortalezas, una dominada por un imperio y la otra por el otro, tales que se construyó un camino directo entre ambas fortalezas.\n\n                    En la parte izquierda de la siguiente figura aparece un posible escenario en el cual 6 fortalezas están dominadas inicialmente por 6 imperios diferentes. Para cada fortaleza se indica con un número entre 1 y 6 el imperio que la domina. Los caminos construídos entre fortalezas están representados por líneas. Si el primer año el imperio 2 conquista a sus vecinos, la situación sería la mostrada en la parte central de la figura. Si luego de eso, en el segundo año el imperio 5 conquista a sus vecinos, todas las fortalezas pasarían a estar dominadas por este imperio, como se ve en la parte derecha de la figura.\n\n                    \n\n                    Notar que los imperios conquistados desaparecen. Como cada año desaparece al menos un imperio, al cabo de cierta cantidad de años un único imperio dominará todas las fortalezas. Se pide encontrar la mínima cantidad de años en que eso puede ocurrir.","id":"1994","category":"Graph","statistics":{"level":"8 / 10","submissions":276,"solved":107,"ratio":"38.77%"}}