{"output":"Para cada caso de prueba, imprimir en la salida una línea conteniendo un racional que representa la máxima cantidad esperada de juegos que puede tener el torneo correspondiente. Redondear el resultado al racional más cercano con 2 dígitos decimales. En caso de empates, redondear hacia arriba. Siempre utilizar exactamente 2 dígitos luego del punto decimal, incluso si eso significara terminar con un cero.","input":"Cada caso de prueba se describe utilizando varias líneas. La primera línea contiene cuatro enteros K, S, J y D. El valor K representa la cantidad de rondas en el torneo (1 ≤ K ≤ 3). El valor S indica la cantidad de sets que es necesario ganar para ganar un partido (1 ≤ S ≤ 10). El valor J es la cantidad mínima de juegos que es necesario ganar para ganar un set, mientras que el valor D indica que un jugador debe ganar esa cantidad de juegos más que su oponente para ganar el set (1 ≤ D ≤ J ≤ 100). Los jugadores son identificados por enteros diferentes entre 1 y N = 2K. Cada una de las N líneas siguientes contiene N valores.\r\n\r\n                    En la i-ésima línea, el j-ésimo valor es un entero Pij tal que pij = Pij/100 es la probabilidad de que el jugador i le gane un juego al jugador j (0 ≤ Pij ≤ 100 para 1 ≤ i, j ≤ N). Asumir que Pii = 0 (ya que un jugador no juega contra sí mismo), mientras que Pij +Pji = 100 para i 6= j.\r\n                    \r\n                    El final de la entrada se indica con una línea que contiene cuatro veces el número −1.","level":10,"name":"Juego, Set y Partido","has_images":true,"description":"La Asociación de Clubes Modernos (ACM) organiza todos los años un torneo de CompuTenis, un deporte especialmente adaptado a un público sin estado físico mensurable. Las reglas del CompuTenis son muy complejas (basta decir que involucran programar con el codo pegado a la oreja), pero afortunadamente no es necesario conocer sus detalles para resolver este problema. Sólo hace falta saber que en un partido de CompuTenis compiten dos jugadores, ganando el partido aquel que gane primero S sets; a su vez, cada set está formado por varios juegos, y para ganar un set se requiere vencer en al menos J juegos, con una diferencia de al menos D juegos ganados más que el oponente.\r\n\r\n                    El torneo que organiza la ACM tiene K rondas, y en él participan N = 2K jugadores. Todos los jugadores participan de la primera ronda. En cada ronda cada jugador que todavía está en competencia se enfrenta en un único partido contra otro jugador que también sigue en carrera. El ganador de cada partido pasa a la siguiente ronda, mientras que el perdedor queda automáticamente descalificado. El ganador del único partido de la K-ésima ronda es el ganador del torneo.\r\n\r\n                    La ACM desea hacer un torneo lo más largo posible, ya que los partidos son televisados y la ACM cobra por cada minuto de emisión. Dado cualquier par de jugadores distintos, la ACM conoce la probabilidad de que uno de los jugadores le gane un juego al otro. Ustedes son miembros del comité organizador de la ACM. La tarea que tienen es organizar los partidos de cada ronda a fin de maximizar la cantidad esperada de juegos en el torneo. Organizar los partidos de la primera ronda significa indicar los pares de jugadores que van a enfrentarse en cada partido. Organizar los partidos de cada una de las otras rondas significa indicar los pares de partidos de la ronda anterior cuyos ganadores van a enfrentarse en cada partido de la nueva ronda; esto sólo puede depender de la identificación de los partidos de la ronda anterior. La siguiente figura muestra una posible organización para K = 3 rondas con N = 2K = 8 jugadores.\r\n\r\n                    \r\n                        \r\n\r\n                    Por el momento, la ACM únicamente quiere estimar su ganancia, de modo que basta que ustedes digan la máxima cantidad esperada de juegos que puede tener el torneo.","id":"1995","category":"Matemáticas","statistics":{"level":"undefined","submissions":-1,"solved":-1,"ratio":"undefined"}}