{"output":"Para cada caso de prueba, imprimir en la salida una línea conteniendo un entero que representa la cantidad de carpas válidas diferentes que se pueden armar con los pilotes dados.","input":"Cada caso de prueba se describe utilizando dos líneas. La primera línea contiene un entero N que indica la cantidad de pilotes (1 ≤ N ≤ 60). La segunda línea contiene N enteros Hi que representan las alturas de los pilotes en metros (1 ≤ Hi ≤ 109 para 1 ≤ i ≤ N). El final de la entrada se indica con una línea que contiene el número −1.","level":9,"name":"Armado de Carpas","has_images":true,"description":"El grupo Instaladores de Carpas Para Circo (ICPC) tiene una forma particular de armar sus carpas, que depende básicamente de una vista bidimensional de las mismas.\r\n\r\n                    Una carpa dada se arma utilizando una cantidad N de pilotes de diversas alturas. El procedimiento utilizado por el ICPC para armar la carpa es el siguiente. Primero se marcan en el suelo N + 2 puntos alineados, donde la distancia entre cada par de puntos consecutivos es de exactamente 2 metros. Luego se coloca verticalmente un pilote en cada uno de los N puntos centrales. Finalmente, se coloca la tela de la carpa uniendo el extremo (superior) de cada pilote con los extremos de los pilotes vecinos, y en el caso del primer y el último pilotes, se los une con los puntos libres que quedaron en el suelo.\r\n\r\n                    La siguiente figura muestra 3 posibles maneras de armar una carpa utilizando las instrucciones anteriores, con pilotes de alturas 4, 5, 7, 8 y 9.\r\n\r\n                    \r\n                        \r\n\r\n                    Luego de ãnos de trabajo, el ICPC llegó a la conclusión de que para obtener carpas útiles y resistentes, es necesario que el ángulo que forman dos porciones consecutivas de tela en el extremo de cada pilote, medido hacia adentro de la carpa, sea estrictamente menor a 180 grados. En la figura mostrada, sólo la carpa de la izquierda cumple esa condición. En la carpa del centro el ángulo es mayor a 180 grados en los pilotes de alturas 4 y 7, mientras que en la carpa de la derecha el ángulo tiene exactamente 180 grados en el pilote de altura 8. Llamamos carpas válidas a aquellas que cumplen la recomendación del ICPC.\r\n\r\n                    Por supuesto, dada la cantidad de pilotes y sus alturas, hay muchas formas de colocarlos y de ese modo obtener carpas diferentes, algunas de las cuales van a ser válidas y otras no. La tarea en este caso es, dados esos datos, contar la cantidad de carpas válidas diferentes que es posible armar. Dos carpas válidas se consideran diferentes si la secuencia de alturas de los pilotes de una de ellas, leída de izquierda a derecha, es distinta de la secuencia de alturas de la otra, leída de igual manera.","id":"1996","category":"Paradigmas","statistics":{"level":"9 / 10","submissions":37,"solved":8,"ratio":"21.62%"}}