{"output":"Para cada caso de prueba, imprimir en la salida una línea conteniendo un entero que representa la mínima cantidad de jugadas necesarias para pasar de la disposición de las fichas representada por S a la disposición representada por T.","input":"Cada caso de prueba se describe utilizando una línea. La línea contiene dos cadenas S y T no vacías y de igual longitud. La cadena S representa la disposición inicial de las fichas, mientras que la cadena T representa el patrón objetivo. Ambas cadenas utilizan solamente las letras mayúsculas “B” y “N”, que representan respectivamente al color blanco y al color negro. Las cadenas tienen a lo sumo 500 letras. El final de la entrada se indica con una línea que contiene dos asteriscos (“*”).","level":2,"name":"Blanco y Negro","has_images":false,"description":"El famoso juego Blanco y Negro es un solitario que utiliza fichas iguales entre sí. Cada ficha tiene dos caras de colores diferentes. Sorpresivamente, esos colores son blanco y negro.\n\n                    Para jugar se comienza ubicando N fichas formando una sola fila. Cada ficha tiene una de sus caras hacia arriba, elegida al azar. También al azar se elige un patrón objetivo. Dicho patrón es una secuencia ordenada de N colores blanco o negro. En cada jugada se elige un conjunto de fichas consecutivas, y todas ellas se invierten, de manera tal que en cada una de ellas el color que estaba arriba pasa a estar abajo y viceversa. El objetivo del juego es lograr que las caras superiores de las fichas muestren el patrón que se eligió al comienzo.\n\n                    Barby descubrió este solitario hace poco tiempo, y rápidamente se dió cuenta de que siempre se puede ganar, ya que cada ficha se puede invertir individualmente. Para hacer el juego más interesante, Barby decidió intentar formar el patrón en la menor cantidad posible de jugadas. A Barby sólo le interesa la cantidad de jugadas, independientemente de cuántas fichas se inviertan en cada jugada. Para saber qué tan bien lo está haciendo, Barby les pide que hagan un programa que a partir de la disposición inicial de las fichas y el patrón objetivo, indique la mínima cantidad de jugadas necesarias para ganar el solitario. ¿Le van a decir que no?","id":"1997","category":"Ad-Hoc","statistics":{"level":"2 / 10","submissions":305,"solved":211,"ratio":"69.18%"}}