{"output":"Para cada caso de prueba, imprimir en la salida una línea conteniendo un carácter que representa si es posible ganar o no el juego. Si es posible ganar el juego el carácter debe ser la letra “S” mayúscula; caso contrario el carácter debe ser la letra “N” mayúscula.","input":"Cada caso de prueba se describe utilizando dos líneas. La primera línea contiene un entero N que indica la cantidad de cajas (1 ≤ N ≤ 500). La segunda línea contiene N enteros Pi que representan las cantidades de piedras que hay en las cajas al comienzo del juego, desde la caja 1 hasta la caja N (0 ≤ Pi ≤ 500 para i = 1, 2, . . . , N). Al menos una caja no está vacía, es decir, existe i entre 1 y N tal que Pi 6= 0. El final de la entrada se indica con una línea que contiene el número −1.","level":5,"name":"Awari 2.0","has_images":true,"description":"El Awari es un solitario proveniente de las Antillas, que se juega con cajas y piedras en lugar de cartas. Una variante particular del Awari se juega con N cajas numeradas de 1 a N, cada una conteniendo al comienzo del juego cero o más piedras. Las reglas de este solitario son muy simples, ya que la única jugada válida consiste en elegir una caja i que contenga exactamente i piedras, tomar todas esas piedras, y usarlas para agregar una piedra en cada una de las cajas desde la 1 hasta la i − 1; la piedra remanente queda en poder del jugador. Las jugadas se suceden mientras exista una caja i que contenga exactamente i piedras. Cuando eso ya no ocurre, el juego termina. El solitario se gana si en ese momento todas las cajas están vacías, y caso contrario se pierde.\n                    \n                    En la parte izquierda de la siguiente figura aparece un posible estado inicial de un juego en el que hay N = 5 cajas (las circunferencias) que contienen P1 = 0, P2 = 1, P3 = 3, P4 = 0 y P5 = 2 piedras (los pequeños círculos negros). Si se eligiera la caja 3 que contiene P3 = 3 piedras para realizar una jugada, el resultado sería el que se muestra en la parte derecha de la figura.Además, el jugador tendría una piedra en su poder.\n\n                    \n                    \n                    Dado el estado inicial del juego, determinar si es posible ganar, es decir, si existe una sucesión de jugadas válidas luego de las cuales todas las cajas quedan vacías.","id":"1998","category":"Ad-Hoc","statistics":{"level":"5 / 10","submissions":548,"solved":275,"ratio":"50.18%"}}