{"output":"Para cada caso de prueba, imprimir en la salida una línea conteniendo un entero que representa la cantidad de formas distintas en que es posible elegir el número de invitados de cada reino para que se realicen N bailes respetando las restricciones mencionadas.","input":"Cada caso de prueba se describe utilizando una línea. La línea contiene un entero N que indica la cantidad total de bailes que debe haber en el evento (1 ≤ N ≤ 104 ). El final de la entrada se indica con una línea que contiene el número −1.","level":4,"name":"Baile de Reconciliación","has_images":false,"description":"Todos los años los reinos de Cubiconia, Cuadradonia y Nlogonia organizan una ceremonia para conmemorar el fin de la guerra que azotó a la región durante mucho tiempo. Cierto número de cortesanos de cada reino es invitado a participar del evento, y se espera que cada par de invitados provenientes de reinos diferentes bailen entre sí exactamente una vez. Esto es, cada uno de los invitados de Cubiconia debe bailar una vez con todos los de Cuadradonia y todos los de Nlogonia, y del mismo modo cada uno de los invitados de Cuadradonia debe bailar una vez con todos los de Nlogonia. Asimismo, los invitados de un mismo reino nunca deben bailar entre sí.\n\n                    Por razones organizativas la cantidad total de bailes debe ser fijada con antelación, de modo que se debe tener mucho cuidado al elegir el número de invitados de cada reino. Por ejemplo, si se decide que haya N = 20 bailes, una posibilidad es invitar 6 cortesanos de Cubiconia, 2 de Cuadradonia y 1 de Nlogonia, lo cual puede representarse con la terna (6, 2, 1). Esta es una opción válida ya que la cantidad total de bailes sería 6 × 2 + 6 × 1 + 2 × 1 = 20.\n\n                    Tradiciones cuyo origen ya nadie recuerda indican que el número de invitados de Cubiconia debe ser mayor o igual que el número de invitados de Cuadradonia, y a su vez el número de invitados de Cuadradonia debe ser mayor o igual que el número de invitados de Nlogonia. Es así que para N = 20 bailes hay exactamente 5 formas posibles de elegir el número de invitados de cada reino: (5, 4, 0), (4, 2, 2), (10, 2, 0), (20, 1, 0) y la ya mencionada (6, 2, 1).\n\n                    Con tantas restricciones el comité organizador de la ceremonia tiene problemas para encontrar las manera ideal de elegir el número de invitados de cada reino. La misión de ustedes es ayudar al comité indicando, para una cantidad total N de bailes, de cuántas formas distintas es posible elegir el número de invitados de cada reino para que se realicen N bailes respetando las restricciones mencionadas. Dos formas de elegir el número de invitados de cada reino se consideran distintas si difieren en el número de invitados de al menos uno de los reinos.","id":"1999","category":"Matemáticas","statistics":{"level":"4 / 10","submissions":302,"solved":179,"ratio":"59.27%"}}