{"output":"For each test case, print a line containing the size of the smallest sequence and the amount of sequences that Cino can choose, separated by a single space. It is guaranteed that a 64-bit integer signed is sufficient to store the answer","input":"The input consists of multiple test cases. Each test case is constituted by 3 lines. The first line of each test case contains three integers, N (1 ≤ N ≤ 50), X and Y (1 ≤ X, Y ≤ 103) representing respectively the number of sights, the size Cici sequence chosen and the size of the sequence chosen for Cini. The second line contains  X integers, representing the sequence chosen by Cici. The third line has Y integers representing the sequence chosen for Cini.The input ends with the final file (EOF).","level":9,"name":"Cici, Cini and Cino","has_images":false,"description":"Cici, Cini and Cino traveled to the North Pole, and want to know the main sights from there. To help them, Santa Claus decided to borrow three reindeer for them. The Santa's reindeer has the ability to teleport, making travel between the sights are instant.\n\nSanta Claus reported that there are N sights, and his reindeer can perform two types of tours:\n\nTour type 1: Given a sequence of sights you want to visit, the reindeer performs a ride at each point in the sequence,For example: Given the sequence <1, 2, 1>, the reindeer will stay for one hour in 1, after, one hour in 2, after,  and one hour in 1.\n\nTour type 2: Given a sequence of sights you want to visit, reindeer performs a type 1 tour using a non-empty subsequence of the sequence chosen. For example, if the chosen sequence is <1, 2, 1>, the reindeer can make any one of 6 different tours, randomly chosen for her: <1>, <2>, <1, 1> <1 2 >, <2, 1>, <1,2,1>.\n\nCici and Cini liked the surprise factor of type 2 tour, however, Cino opted for type 1. As Cici, Cino ang Cino and have different preferences, one can choose a different sequence of places. Knowing the sequences chosen by Cici and Cini, Cino will choose the smallest sequence in which it is guaranteed that at least one site is not visited by three friends simultaneously.\n\n\nFor example: Santa Claus reported that the North Pole has 3 distinct sights. Cici choose the sequence <1, 2>. Cini choose <2, 3>. So Cino can choose the sequences <1> and <3>, but can not choose the sequence <2>.","id":"2019","category":"Ad-Hoc","statistics":{"level":"9 / 10","submissions":74,"solved":17,"ratio":"22.97%"}}