{"output":"For each test case print the message \"Quantidade minima de passos = X\", where X is the total required, followed by the steps made to resolve, each step must be separated by a blank line. if you can't solve the problem print: \"Problema sem solucao\".","input":"The input consists of several test cases, each case will have 3 lines each with 3 numbers 0-8, where zero represents the blank space. Assume that the toy is always scrambled.\nThe entry ends with the end of the file.","level":9,"name":"Game of Eight","has_images":true,"description":"João is a boy who loves to play with logic games, he spends several hours of your day solving puzzles.\nCurrently the game that he's spending more time playing is the Sliding Puzzle, also known as Game of Eight, in which he has at hand a tray of 3 rows and 3 columns where each element of this board has a number or a blank space.\n\nThe object of the game is simple, given a scrambled board (Figure 1), João should leave it ordered (Figure 2) and the only movement possible to solve the problem is to move a number to the blank space.\nSolve the toy is not a problem for João, he's already doing it without difficulty, but he was intrigued to know what is the minimum number of moves needed to solve.\n\n\n \nFigure 1 - Figure 2\n\nWhat you need to do to help João in his curiosity is simple, it will give you the initial configuration of the board and you should show, if any, the least amount of possible steps to solve the toy and what steps are needed to find the solution.\nBut there is one detail, João is a very methodical kid, so when he is playing and there are several possibilities at any given time it uses the following priority to set the move:\n1) Move the piece that is on the blank space\n2) Move the piece that is under the blank space\n3) Move the piece that is on the right of the blank space\n4) Move the piece that is on the left of the blank space\nYou must use the same priority to solve the problem.","id":"2032","category":"Graph","statistics":{"level":"9 / 10","submissions":1051,"solved":253,"ratio":"24.07%"}}