{"output":"In each case, the output is composed of three lines. The first contains the \"DIFERENCA DE VALOR = \" message, followed by the value of the difference between the final value with simple interest and the final amount with compound interest. In the second line will display the \"JUROS SIMPLES = \" message, followed by the value of the difference between the amount to be borrowed and the final value with simple interest. And the third line will show the message \"JUROS COMPOSTO = \" followed by the value of the difference between the amount to be borrowed and the final amount with compound interest.\n\n- Not sure to put the spaces in the messages and by a line break at the end of each trip.","input":"The input consists of several test cases and ends with EOF. Each case contains two floating point values of double precision, a C (0.01 ≤ C ≤ 20000.00) and other i (0.01 ≤ i ≤ 1.00), representing, respectively, the loan amount and the interest rate, and an integer n (1 ≤ n ≤ 20) representing the amount of \"months\" concerning the deadline for payment of the loan to the moneylender, as with the applied interest.","level":7,"name":"Interest on Loan","has_images":false,"description":"Where can, Danilo purchase accessories for your computer because it works as a programmer and always seeks to improve the performance of your PC. Once Danilo resolved to do a general upgrade on your computer, but as I was without money at the time, he decided to request a loan on money with his friend Maclaud that is moneylender. Maclaud then decided to borrow the money to his friend Danilo and advised him to find what would be its debt if the regime were applied \"Simple Interest\" or \"Interest Compound\" since it would know that the moneylender would not increase the value.\n\nDanilo got confused and decided to go to your house and calculate what would be the final values according to each interest regime. But Daniel is not very good calculation and decided to ask the help of a programmer who was able to create a program that informed the loan amount, the interest rate \"monthly\" and the term \"months\" you need to repay the loan with interest, calculate and show:\n\n- The Difference between the final value with simple interest and the final amount with compound interest;\n\n- The Difference between the amount to be borrowed and the final value with simple interest;\n\n- The Difference between the amount to be borrowed and the final amount with compound interest;","id":"2033","category":"Matemáticas","statistics":{"level":"7 / 10","submissions":939,"solved":234,"ratio":"24.92%"}}