{"output":"Para cada caso de prueba, imprimir en la salida una línea conteniendo un entero que representa la cantidad de números canteros (respecto de B y C) que son mayores o iguales que D y menores o iguales que H.","input":"Cada caso de prueba se describe utilizando una línea. La línea contiene tres enteros D, H y B, y una cadena L. Los valores D y H indican los extremos del intervalo [D, H] a estudiar (1 ≤ D ≤ H ≤ 1016). El valor B es la base mencionada (2 ≤ B ≤ 10). La cadena L = L0L1 · · · LB−1 tiene exactamente B caracteres y describe al conjunto C también mencionado; el carácter Li es la letra “S” mayúscula cuando i ∈ C, y la letra “N” mayúscula en caso contrario (i = 0, 1, . . . , B − 1). El conjunto C no es vacío, es decir, al menos un carácter de L es “S”. El final de la entrada se indica con una línea que contiene tres veces el número −1 y un asterisco (“*”).","level":6,"name":"Cantor Generalizado","has_images":false,"description":"El matemático Georg Cantor fue un amante de los conjuntos y el infinito, pero no se llevaba tan bien con sus colegas. Tal es aíı que una mañana se despertó con la idea de definir un conjunto tan extraño que, al ser dado a conocer, dejaría al resto de los matemáticos sin poder dormir por unos cuantos días. Y lo logró.\n\n                    El conjunto que definió es el llamado conjunto de Cantor, y está formado por los números reales en el intervalo [0, 1] que tienen un desarrollo en base 3 que usa exclusivamente los dígitos 0 y 2. El conjunto de Cantor tiene propiedades sorprendentes, las cuales no mencionaremos aquí para que puedan dormir esta noche. Más aún, afortunadamente para todos, en este problema no trabajaremos con dicho conjunto, sino con una generalización del mismo sobre los números enteros.\n\n                    Diremos que un número es de Cantor y entero, o para abreviar cantero, si su expresión en una base B dada usa únicamente los dígitos de un conjunto C ⊆ {0, 1, . . . , B − 1} también dado. Notar que el hecho de que un número sea cantero depende de cómo elijamos B y C.\n\n                    El objetivo en este problema es aprender a contar números canteros, y así evitar que estos perturben el sueño de los matemáticos del mundo “entero”. Más precisamente, dados dos enteros D y H, junto con B y C, la tarea de ustedes consiste en determinar cuántos números canteros respecto de B y C hay desde D hasta H inclusive.","id":"2034","category":"Matemáticas","statistics":{"level":"6 / 10","submissions":58,"solved":24,"ratio":"41.38%"}}