{"output":"Para cada caso de prueba, imprimir en la salida una línea conteniendo un entero que representa la máxima cantidad total de letras que se pueden imprimir en un conjunto de N camisetas que sean válidas para ser usadas por los dos equipos.","input":"Cada caso de prueba se describe utilizando tres líneas. La primera línea contiene un entero N que indica la cantidad de jugadores en cada uno de los dos equipos (1 ≤ N ≤ 104 ). La segunda línea contiene los apellidos de los N jugadores de la selección Sub-18. La tercera línea contiene los apellidos de los N jugadores de la selección Sub-21. Cada apellido es una cadena no vacía de a lo sumo 100 caracteres formada únicamente por letras mayúsculas. En cada caso de prueba la cantidad total de letras en los 2N apellidos es a lo sumo 105 , y dos o más jugadores del mismo o de diferentes equipos pueden tener el mismo apellido.\n\n                    El final de la entrada se indica con una línea que contiene el número −1.","level":8,"name":"Diseño de Camisetas","has_images":false,"description":"El rugby argentino está viviendo uno de sus mejores momentos. Recientemente las selecciones Sub-18 y Sub-21 clasificaron para los respectivos mundiales. Los entrenadores de ambos equipos le encargaron a la Inigualable Comisión Productora de Camisetas (ICPC) la provisión de las camisetas para esos eventos deportivos. Cada uno de los dos equipos está compuesto por N jugadores. Como los dos mundiales no ocurren simultáneamente, se acordó con la ICPC la provisión de sólo N camisetas, a ser usadas tanto por un equipo como por el otro.\n\n                    Por tal motivo, las camisetas deben ser válidas para ser usadas por cada uno de los dos equipos. Las reglas de los mundiales dicen que cada jugador debe jugar con una camiseta que tenga impreso un número diferente del de sus compañeros, junto con un prefijo del apellido del jugador (no necesariamente diferente del de sus compañeros). Esto incluye los casos extremos de una camiseta sin apellido (prefijo de longitud 0), y de una camiseta con el apellido completo.\n\n                    Los expertos de la ICPC se dieron cuenta inmediatamente de que podrían entregar N camisetas sin apellidos, cada una de las cuales sería válida para ser usada por cualquiera. Sin embargo, los entrenadores prefieren que las camisetas tengan los prefijos lo más largos que sea posible, sin violar las reglas previstas para los mundiales. De ese modo pueden identificar a los jugadores más fácilmente mientras se desarrollan los partidos.\n\n                    Les pedimos que ayuden a la ICPC indicando la máxima cantidad total de letras que se pueden imprimir en un conjunto de N camisetas que sean válidas para ser usadas por los dos equipos. Por ejemplo, si en la selección Sub-18 juegan “PEREZ”, “GONZALEZ” y “LOPEZ”, mientras que en la selección Sub-21 juegan “GARCIA”, “PERALTA” y “RODRIGUEZ”, lo mejor es que una camiseta tenga el prefijo “G” de 1 letra (para que la usen “GONZALEZ” y “GARCIA”), otra tenga el prefijo “PER” de 3 letras (para que la usen “PEREZ” y “PERALTA”), y otra tenga un prefijo de 0 letras (para que la usen “LOPEZ” y “RODRIGUEZ”). Es así que la respuesta en este caso es 1 + 3 + 0 = 4.","id":"2035","category":"Strings","statistics":{"level":"8 / 10","submissions":263,"solved":82,"ratio":"31.18%"}}