{"output":"Para cada caso de prueba, imprimir en la salida una línea conteniendo un entero que representa la mínima cantidad de fichas que es necesario desplazar dentro de la hilera para que la distancia entre fichas consecutivas sea menor o igual que H, sin desplazar la primera ni la última ficha. Si es imposible lograrlo imprimir el número −1.","input":"Cada caso de prueba se describe utilizando dos líneas. La primera línea contiene dos enteros N y H que indican respectivamente la cantidad de fichas de dominó en la hilera, y la altura de cada una de las fichas (3 ≤ N ≤ 1000, 1 ≤ H ≤ 50). La segunda línea contiene N −1 enteros Di que representan las distancias entre pares de fichas consecutivas de la hilera, en el orden dado por la hilera (1 ≤ Di ≤ 100 para i = 1, 2, . . . , N − 1).\n\n                    El final de la entrada se indica con una línea que contiene dos veces el número −1.","level":10,"name":"Efecto Dominó","has_images":false,"description":"El efecto dominó es un fenómeno que ocurre cuando en una hilera de fichas de dominó, cada una apoyada sobre su cara más chica, se hace caer la ficha de uno de los extremos de la hilera en dirección a la ficha siguiente, la cual a su vez cae sobre una tercera ficha, y así sucesivamente hasta que todas las fichas caen. Para que el efecto se produzca es necesario que la distancia entre fichas consecutivas de la hilera sea menor o igual que la altura de las mismas. Emma se enteró hace poco de la existencia del efecto dominó, y enseguida quedó maravillada.\n\n                    Esta mañana Emma estuvo armando una hilera con las N fichas de dominó que le regaló su hermano Ezequiel. Justo cuando Emma estaba por hacer caer las fichas, llegó su abuela para llevarla a la plaza. Ezequiel sabe que Emma no tuvo en cuenta la distancia entre las fichas cuando armó la hilera, y que ella se frustraría mucho si no cayeran todas las fichas cuando hace caer la primera.\n\n                    Ezequiel quiere desplazar algunas fichas dentro de la hilera para que la distancia entre fichas consecutivas sea menor o igual que la altura H de las fichas. Para que Emma no advierta el cambio, Ezequiel quiere dejar en su lugar la primera ficha y la última ficha de la hilera, y desplazar la menor cantidad posible de fichas. ¿Cuál es la mínima cantidad de fichas que necesita reubicar Ezequiel?","id":"2036","category":"Paradigmas","statistics":{"level":"10 / 10","submissions":449,"solved":83,"ratio":"18.49%"}}