{"output":"Para cada caso de prueba, imprimir en la salida una línea conteniendo una cadena que representa la única lista de rivales del competidor 1 (Florencia) que es compatible con las listas de rivales de los otros competidores. Los rivales en la lista que se imprima deben aparecen en orden cronológico.","input":"Cada caso de prueba se describe utilizando dos líneas. La primera línea contiene un entero N que indica la cantidad de competidores (2 ≤ N ≤ 9). Los competidores son identifi- cados por enteros diferentes entre 1 y N. El competidor 1 es Florencia. La segunda línea contiene N−1 cadenas no vacías Li de a lo sumo 100 caracteres cada una (i = 2, 3, . . . , N). La cadena Li está formada únicamente por dígitos entre 1 y N, excepto el dígito i, y representa la lista de rivales del competidor i en orden cronológico. El competidor 1 aparece al menos una vez en alguna de las listas. En cada caso de prueba existe una única lista de rivales para el competidor 1 que es compatible con las listas de rivales dadas. El final de la entrada se indica con una línea que contiene el número −1.","level":9,"name":"Fixture Extraviado","has_images":false,"description":"El Torneo de Ajedrez Profesional (TAP) tiene una extraña forma de funcionamiento. En cada partida se enfrentan exactamente dos competidores, y no ocurre más de una partida a la vez, ya que se dispone de un único tablero. Luego de recibir las inscripciones de los competidores y asignarle a cada uno un número correlativo, la organización decide discrecionalmente qué partidas se van a realizar. Cada competidor puede enfrentar a cualquier otro cualquier cantidad de veces, e incluso es posible que algunos competidores no jueguen contra algunos otros. Una vez configurado el fixture general de partidas a jugarse, la organización le entrega a cada competidor una lista no vacía de los rivales que va a enfrentar en orden cronológico (el orden en que van a ocurrir las partidas).\n\n                    Florencia se inscribió en primer lugar, de modo que le asignaron el número 1. Luego de charlar un poco con los otros competidores, se dio cuenta de que había perdido su lista de rivales. Como no quiere molestar a la organización del TAP, le pidió al resto de los competidores que le dieran copias de las listas de rivales que ellos recibieron, para intentar con esa información reconstruir su propia lista. Florencia no está segura de si existe un único fixture general que sea compatible con las copias de las listas que le dieron los otros competidores. Pero afortunadamente, la lista que le podría haber dado a ella la organización del TAP sí es única. Lo que deben hacer ustedes es determinar esa lista.","id":"2037","category":"Ad-Hoc","statistics":{"level":"9 / 10","submissions":257,"solved":68,"ratio":"26.46%"}}