{"output":"Para cada caso de prueba, imprimir en la salida una línea conteniendo un entero que representa la máxima ganancia neta positiva que GigaFarma puede obtener por una cadena de ADN alienígena y producible. Si ninguna ganancia neta es positiva imprimir el valor 0. Si la ganancia neta puede ser arbitrariamente grande imprimir un asterisco (“*”).","input":"Cada caso de prueba se describe utilizando varias líneas. La primera línea contiene dos enteros G y P que representan respectivamente la cantidad de genes y de porciones (1 ≤ G, P ≤ 100).\n\n                    Cada una de las G líneas siguientes describe un gen distinto mediante una cadena S y un entero V ; la cadena S tiene entre 1 y 10 caracteres, y está formada únicamente por letras minúsculas que representan las bases del gen; el entero V indica el valor del gen (1 ≤ V ≤ 1000).\n\n                    Cada una de las P líneas siguientes describe una porción distinta mediante una cadena T y un entero C; la cadena T tiene entre 1 y 30 caracteres, y está formada únicamente por letras minúsculas y guiones medios (“-”) que representan respectivamente las bases y las uniones; esta cadena contiene al menos un guión, pero no tiene guiones iniciales, finales, ni consecutivos; el entero C indica el costo de la porción (1 ≤ C ≤ 1000).\n\n                    En cada caso de prueba los genes son todos diferentes, y las porciones son todas diferentes. El final de la entrada se indica con una línea que contiene dos veces el número −1.","level":10,"name":"Genética Alienígena","has_images":true,"description":"GigaFarma, una de las compañías farmacéuticas más grandes del mundo, se encuentra actualmente experimentando con ADN alienígena. Su objetivo es producir una cadena de ADN alienígena que le reporte el mayor beneficio posible a la hora de comercializarla.\n\n                    Una cadena de ADN alienígena puede verse como una secuencia no vacía de genes, conectados entre sí por uniones. A su vez, cada gen es una secuencia no vacía de bases. GigaFarma logró catalogar los genes que aparecen en las cadenas de ADN alienígena, ya que no toda secuencia de bases es un gen válido. Cada gen tiene un valor que depende de su funcionalidad, y cada cadena de ADN alienígena tiene un valor de mercado que es la suma de los valores de cada uno de sus genes.\n\n                    Para facilitar las cosas, vamos a representar a las diferentes bases con letras minúsculas, y a una unión con un guión medio (“-”). En el siguiente ejemplo podemos ver a la izquierda una posible lista de genes y sus valores; a la derecha aparecen algunas cadenas de ADN alienígena que pueden formarse a partir de ellos, con sus valores de mercado calculados.\n\n                    \n\n                    Una cadena de ADN producible es una cadena de ADN que GigaFarma puede producir. En la prática es una secuencia no vacía de porciones que la empresa puede sintetizar, sin conexiones adicionales de una a otra. Cada porción es una secuencia de bases y uniones, conteniendo al menos una unión, pero sin uniones iniciales, finales, ni consecutivas. Cada porción tiene un costo que depende de la dificultad para producirla, y cada cadena de ADN producible tiene un costo de producción que es la suma de los costos de cada una de sus porciones.En el ejemplo que aparece a continuación podemos ver a la izquierda una posible lista de porciones y sus costos; a la derecha aparecen algunas cadenas de ADN producible que pueden formarse a partir de ellas, con sus costos de producción asociados.\n\n                    \n\n                    Observar que puede existir más de una manera de formar algunas cadenas de ADN producible. Tal es el caso de “como-como-les” en el ejemplo, que puede obtenerse a partir de las porciones “como-co” y “mo-les” con costo de producción 7, o usando simplemente la porción “como-como-les” con costo de producción 12. Cuando existe más de una manera de sintetizar cierta cadena de ADN producible, GigaFarma siempre lo hace de alguna manera que tenga costo de producción mínimo.\n\n                    El conjunto de cadenas de ADN alienígena es infinito, lo mismo que el conjunto de cadenas de ADN producible. Pero GigaFarma no está interesada directamente en ninguno de esos dos conjuntos, sino en su intersección. Si revisamos los ejemplos anteriores, podemos notar que “como-les” es alienígena pero no producible, “mo-les” es producible pero no alienígena, y “como-como-les” es alienígena y producible.\n\n                    Por cada cadena de ADN alienígena y producible, la compa˜nía puede obtener una ganancia neta que es igual a su valor de mercado menos su costo de producción. Si esa ganancia neta no es positiva, la cadena nunca será producida. Dado que hay tanto material genético dando vueltas, GigaFarma pagaría cualquier cosa por saber cuál es la máxima ganancia neta positiva que puede obtener por alguna cadena de ADN alienígena y producible.","id":"2038","category":"Graph","statistics":{"level":"10 / 10","submissions":172,"solved":9,"ratio":"5.23%"}}