{"output":"Para cada caso de prueba, imprimir en la salida una línea conteniendo un racional que representa el área del perfil montañoso. Redondear el resultado al racional más cercano con 2 dígitos decimales. En caso de empates, redondear hacia arriba. Siempre utilizar exactamente 2 dígitos luego del punto decimal, incluso si eso significara terminar con un cero.","input":"Cada caso de prueba se describe utilizando varias líneas. La primera línea contiene un entero N que indica la cantidad de montañas (1 ≤ N ≤ 1000). Cada una de las N líneas siguientes describe una montaña distinta utilizando tres enteros I, D y H que representan respectivamente la coordenada en el eje X del extremo izquierdo de la base, lo mismo para el extremo derecho, y la altura (1 ≤ I, D, H ≤ 105 , I < D). En cada caso de prueba no hay dos montañas exactamente iguales (que coincidan en los tres valores I, D y H). El final de la entrada se indica con una línea que contiene el número −1.","level":10,"name":"Horizonte Montañoso","has_images":true,"description":"Para irse de vacaciones, Horacio y Hernán sacrificaron su participación en un importante torneo de programación. Mientras ustedes están acá, ellos est´án cerca de la Cordillera de los Andes, transitando la Ruta 40 de la República Argentina, y disfrutando de una agradable vista de montañas en el horizonte. Justo en este momento el cielo sobre la ruta tiene un color celeste uniforme, y la parte visible del perfil montañoso presenta texturas muy complejas y atractivas. Esto preocupa a Horacio y Hernán, porque piensan que las fotos que están tomando van a ser muy costosas de imprimir correctamente. Por tal motivo, en la próxima parada que hagan van a sacar sus computadoras portátiles, y van a hacer un programa para estimar la superficie correspondiente al perfil montañoso que es necesario imprimir en cada foto. ¿Pueden ustedes terminar el programa antes que ellos?\r\n\r\n                    Horacio y Hernán piensan modelar el perfil montañoso de la siguiente manera. Cada montaña se representa como un triángulo isósceles cuya base está apoyada sobre el eje X del plano XY . Dos lados iguales conectan los extremos de la base con el vértice opuesto a la misma, el cual indica la cima de la montaña. Para describir la posición y forma del triángulo se utilizan las coordenadas en el eje X de los extremos de la base, junto con la altura.\r\n\r\n                    La figura que aparece a continuación modela un perfil montañoso formado por 4 montañas que se superponen unas con otras. La superficie correspondiente al perfil montañoso que es necesario imprimir está marcada en rayado. La montaña más baja de la figura se describe con los valores I = 4 (extremo izquierdo de la base), D = 5 (extremo derecho de la base) y H = 1 (altura).\r\n\r\n                    \r\n\r\n                    En este problema se pide, dada la representación de las montañas, encontrar el área de la unión de todos los triángulos descriptos, de manera que las partes superpuestas se contabilicen una sola vez.","id":"2043","category":"Geometría Computacional","statistics":{"level":"10 / 10","submissions":108,"solved":27,"ratio":"25.00%"}}