{"output":"Para cada caso de prueba, imprimir en la salida una línea conteniendo un entero que representa la cantidad de veces que Inés va a ir a casa de Ignacio a cobrarle la deuda.","input":"Cada caso de prueba se describe utilizando dos líneas. La primera línea contiene un entero N que indica la cantidad de museos de ciencias que hay en Nlogonia (1 ≤ N ≤ 100). La segunda línea contiene N enteros Pi que representan los precios de las entradas a los diferentes museos en el orden en que van a ser visitados (1 ≤ Pi ≤ 100 para i = 1, 2, . . . , N). El final de la entrada se indica con una línea que contiene el número −1.","level":3,"name":"Incobrable","has_images":false,"description":"A Ignacio e Inés les gusta mucho la ciencia. Por suerte viven en Nlogonia, donde como todos sabemos, hay N museos de ciencias. Tanto Ignacio como Inés tienen los próximos N sábados libres, de modo que armaron un cronograma para visitar un museo de ciencias diferente cada uno de esos días.\n\n                    Ignacio es bastante tacaño, por lo que todos los sábados le dice a Inés que no trajo plata para pagar la entrada al museo, y le pide que ella pague por él. Inés siempre paga la entrada de Ignacio, y como lo conoce bien, sabe que si luego ella no le reclama el dinero, él nunca se lo va a devolver. Inés también sabe que cuando ella le reclama dinero a Ignacio, él ´unicamente acepta pagarle si la deuda es múltiplo de 100, ya que de lo contrario Ignacio argumenta que no tiene cambio para pagar y no le paga nada.\n\n                    Así las cosas, cada domingo después de ir a un museo, si la deuda acumulada es múltiplo de 100, Inés va a casa de Ignacio y le reclama el dinero. Como él no tiene excusa posible, paga sin protestar. Esto no le gusta para nada, pero se consuela pensando que si luego de visitar todos los museos la deuda acumulada no es múltiplo de 100, Inés no le va a reclamar esa parte.\n                    \n                    Inés necesita que le digan cuántas veces va a ir a casa de Ignacio a cobrarle la deuda. Para poder calcular esto, ella les puede decir los precios de las entradas a los N museos de ciencias de Nlogonia, en el orden en que ella e Ignacio los van a visitar.","id":"2044","category":"Matemáticas","statistics":{"level":"3 / 10","submissions":426,"solved":296,"ratio":"69.48%"}}