{"output":"Imprimir \"Jogador 1 ganha!\" si el jugador 1 ganó o \"Jogador 2 ganha!\" si el jugador 2 ganó(sin comillas).","input":"La entrada consiste en una línea con 5 enteros: p, j1, j2, r, a. ( 0 ≤  p, r, a ≤  1 e 1 ≤  j1, j2 ≤  100).\n\np es la elección del jugador 1 (si p = 1 entonces el jugador 1 escoge par, si p = 0 entonces el jugador 1 escoge impar). j1, j2, representa, respectivamente, los números que eligió el jugador 1 y el número que eligió el jugador 2. r representa si el jugador 1 engañó (si r = 1 entonces el jugador 1 engañó, si r = 0 cuando el/ella no ha engañado), a representa si el jugador 2 acusó al jugador 1 de engaño (si a = 1 entonces él / ella lo hizo, si a = 0 entonces él / ella no lo hizo).","level":2,"name":"Impar, Par o Engaño","has_images":false,"description":"Un nuevo juego llamado impar, par o engaño (OEC - Odd, Even or Cheating) es actualmente uno de los juegos más populares en el mundo. Este juego fue creado cuando algunos amigos no tenían conexión a Internet, sin móvil, sin ordenador, y prácticamente nada que hacer. El juego es tan popular que se creó el campeonato mundial de la OEC y cada país del mundo va a elegir un representante para competir en este campeonato.\n\nEl juego funciona así: se trata de un juego de dos jugadores, el jugador 1 elige entre pares o impares, a continuación, cada jugador elige un número entero positivo, si la suma de estos números es par y el jugador 1 escogió par, entonces el jugador 1 gana, si la suma es impar y el jugador 2 eligió impar, entonces el jugador 2 gana. Si el jugador 1 elige impar, él/ella gana cuando la suma es impar, y el jugador 2 gana cuando la suma es par. Nada nuevo, ¿verdad?\n\nPero ahora hay dos movimientos posibles, el jugador 1 puede engañar para asegurarse de que él / ella gane independientemente del resultado del juego convencional par o impar, y el jugador 2 puede acusar al jugador 1 de engaño. Con estos agregados en el juego si el jugador 1 engaña y el jugador 2 lo acusa a el / ella de engaño, el jugador 2 gana, si el jugador 2 no acusó y el jugador 1 está engañando a continuación, el jugador 1 gana, si el jugador 2 acusa del engaño, pero el jugador 1 no engañó, entonces el jugador 1 gana, si el jugador 1 no engaña y el jugador 2 no acusa al jugador 1 entonces el juego se jugará como se ha descrito anteriormente.\n\nUsted fue contratado por OECIO (Odd, Even or Cheating International Organization) para desarrollar un programa que dado una partida OEC determine el ganador.","id":"2059","category":"Principiante","statistics":{"level":"2 / 10","submissions":12674,"solved":5747,"ratio":"45.34%"}}