{"output":"Imprimir en la salida una línea conteniendo un entero que representa cuántas cantidades visibles de palmeras hay.","input":"La primera línea contiene un entero N que indica la cantidad de palmeras que están al costado de la ruta (1 ≤ N ≤ 1000). Cada una de las N líneas siguientes describe una palmera distinta utilizando dos enteros X e Y que representan las coordenadas de la palmera en el plano XY (1 ≤ X, Y ≤ 105 ). No hay dos palmeras en la misma posición (que coincidan en sus dos coordenadas).","level":10,"name":"Al Costado Del Camino","has_images":true,"description":"Al costado del camino, hay palmeras, hay un bar, hay sombra, hay algo más. En este problema, nos interesan particularmente las palmeras. \n\n                    Ana, Adán, Alan y Amanda organizaron un viaje. Mientras Ana y Adán se encargaban de nimiedades como hacer revisar el auto, preparar el equipaje y conseguir lugar para hospedarse, Alan y Amanda se dedicaban a lo más importante: estudiar los paisajes de palmeras a los que iban a tener acceso a lo largo del camino.\n\n                    La ruta que ahora recorren es totalmente recta, y para los propósitos de este problema la modelamos como la recta Y = 0 del plano XY . Al costado de la ruta con coordenada Y > 0 hay palmeras, de modo que modelamos cada una de ellas como un punto diferente del plano XY con coordenada Y > 0. Alan y Amanda notaron que desde cada punto de la ruta son visibles determinadas palmeras, y que en general las palmeras visibles varían a lo largo de la ruta. Una palmera es visible desde un punto de la ruta si y sólo si el segmento que une ambos puntos no pasa por ninguna otra palmera.\n\n                    En la siguiente figura los círculos sin relleno representan a las palmeras de la primera entrada de ejemplo, mientras que los círculos con relleno indican puntos posibles de la ruta.\n\n                    \n\n                    Desde el punto p son visibles las palmeras a, b y d, ya que la palmera c queda oculta detrás de la palmera a. Desde el punto q son visibles las palmeras a, c y d, ya que la palmera b queda oculta detrás de la palmera a. Desde el punto r son visibles todas las palmeras. Desde el punto s son visibles las palmeras a y d, ya que las palmeras b y c quedan ocultas detrás de la palmera d. \n\n                    Mientras Ana y Adán se turnan para manejar el auto, Alan y Amanda comentan entre ellos lo bueno que sería saber cuántas cantidades visibles de palmeras hay. Dado un conjunto de palmeras, un entero m es una cantidad visible de palmeras si y sólo si existe al menos un punto de la ruta (es decir, un punto con coordenada Y = 0) desde el cual exactamente m palmeras son visibles.\n\n                    En el ejemplo ilustrado más arriba, 2, 3 y 4 son cantidades visibles de palmeras, como lo testifican respectivamente los puntos s, p y r de la ruta. Por otro lado, 0 y 1 no son cantidades visibles, porque desde todo punto de la ruta al menos 2 palmeras son visibles. Finalmente, ningún m > 4 es una cantidad visible, ya que hay 4 palmeras en total. Como resultado, en nuestro ejemplo hay 3 cantidades visibles de palmeras. Notar que si m es una cantidad visible de palmeras, podría haber más de un punto de la ruta que testifique tal situación; en el ejemplo eso ocurre con los puntos p y q para la cantidad visible 3, así como para infinitos otros puntos además del punto r para la cantidad visible 4.\n\n                    Ana y Adán ya están cansados. Quieren que Alan y Amanda dejen las palmeras y al menos repartan la comida. Para eso es necesario que ustedes hagan un programa que calcule cuántas cantidades visibles de palmeras hay.","id":"2083","category":"Geometría Computacional","statistics":{"level":"10 / 10","submissions":297,"solved":44,"ratio":"14.81%"}}