{"output":"Imprimir en la salida una línea conteniendo un entero que representa el máximo nivel de alternativas de un camino desde la casa de Caperucita hasta la de su abuelita.","input":"La primera línea contiene dos enteros N y S que indican respectivamente la cantidad de claros y de senderos en el bosque (3 ≤ N ≤ 3 × 104 y 2 ≤ S ≤ 105 ). Los claros son identificados por enteros diferentes entre 1 y N y están ordenados de oeste a este, de modo que si 1 ≤ i < j ≤ N el claro i está más al oeste que el claro j. La casa de Caperucita está en el claro 1, y la casa de la abuelita está en el claro N.\n\n                    Cada una de las S líneas siguientes describe un sendero utilizando dos enteros I y J que representan que hay un sendero entre entre el claro I y el claro J (1 ≤ I < J ≤ N). Hay al menos un camino desde la casa de Caperucita hasta la casa de la abuelita, y el máximo nivel de alternativas dentro del conjunto de tales caminos es menor o igual que 1018.","level":8,"name":"Caperucita Roja","has_images":false,"description":"Erase una vez una niña muy alegre a la que llamaban Caperucita Roja porque siempre vestía una caperuza de color rojo. Caperucita disfrutaba mucho de sus paseos por el bosque, durante los cuales recolectaba frutos en su canastita para llevárselos a su abuelita, quien era conocida por preparar las tartas más deliciosas de toda la región. De lo que definitivamente no disfrutaba Caperucita era de los peligros del bosque, y en particular del malvado lobo que siempre estaba hambriento y al acecho. \n\n                    Un día, Caperucita decide ir desde su casa hasta la de su abuelita, recolectando frutos del bosque en el camino y tratando de hacer el paseo de la manera más segura posible. La casa de Caperucita está en un claro del extremo oeste del bosque, la casa de su abuelita en un claro del extremo este, y dentro del bosque entre ambas hay algunos otros claros con árboles frutales. El bosque es muy espeso, por lo que la única forma de atravesarlo es utilizando senderos entre los distintos claros, los cuales por suerte Caperucita conoce muy bien. Para no perderse Caperucita se mueve siempre por senderos que la llevan a un punto estrictamente al este del punto en el que se encuentra. Para no ser atrapada por el lobo Caperucita encuentra imprescindible evitar una emboscada, y para ello siempre tiene en cuenta la cantidad de caminos distintos que la llevan desde su posición actual hasta la casa de su abuelita.\n\n                    Un camino en el bosque es una sucesión de claros ordenados de oeste a este, de manera que cada claro está conectado con el siguiente por un sendero. Un camino hasta la casa de la abuelita es simplemente un camino cuyo último claro contiene dicha casa. Para cada claro, su nivel de alternativas es la cantidad de caminos que van desde él hasta la casa de la abuelita. Para cada camino, su nivel de alternativas es la suma de los niveles de alternativas de cada claro que compone ese camino. Para no ser capturada por el lobo, Caperucita desea encontrar el camino con máximo nivel de alternativas que empieza por su casa y termina en la de su abuelita. Como miembros de la sociedad Ayuda a Caperucita a Moverse (ACM), están llamados a ayudarla a encontrar ese valor máximo, y cuando lo hayan hecho, colorín, colorado, este problema habrá terminado.","id":"2085","category":"Graph","statistics":{"level":"8 / 10","submissions":202,"solved":54,"ratio":"26.73%"}}