{"output":"Imprimir en la salida M líneas. La i-ésima línea debe indicar el resultado de la i-ésima mudanza utilizando dos enteros da y dh que representan las distancias en unidades nlogónicas desde la casa involucrada en la mudanza hasta la primera casa cuya familia sigue al mismo equipo, en sentido antihorario y horario respectivamente.","input":"La primera línea contiene dos enteros N y F que indican respectivamente la cantidad de casas alrededor del lago y la cantidad de equipos de fútbol que hay en Nlogonia (3 ≤ N ≤ 105 y 1 ≤ F ≤ 106 ). La segunda línea contiene tres enteros A, B y C que determinan el equipo que sigue inicialmente la familia en cada casa según se describe en el enunciado (0 ≤ A, B, C < F). La tercera línea contiene un entero M que indica la cantidad de mudanzas que se suceden a la orilla del lago (1 ≤ M ≤ 105 ). Cada una de las M líneas siguientes describe una mudanza utilizando dos enteros I y E que representan que a la casa número I se ha mudado una familia que sigue al equipo E (1 ≤ I ≤ N y 0 ≤ E < F). Las mudanzas aparecen en el orden en que se suceden, y deben ser tenidas en cuenta por el comité para las posteriores bienvenidas.","level":9,"name":"¿Dónde Vemos el Partido?","has_images":true,"description":"En el reino de Nlogonia hay un lago conocido como el “Gran O” por su forma perfectamente circular. A la orilla de este lago hay N casas, separada cada una de sus vecinas por una unidad nlogónica de distancia. Las casas están numeradas de 1 a N en sentido horario, como se muestra en la siguiente figura para el caso N = 8.\n\n                    \n\n                    De este modo, si i < j, la distancia en sentido horario desde la casa número i hasta la casa número j es j − i, mientras que la distancia en sentido antihorario es N − j + i. La distancia desde una casa hasta sí misma es N en ambos sentidos. Es bien sabido que la gente de Nlogonia es fanática del fútbol, así que cuando una familia se muda a una casa que está a la orilla del lago, es muy importante que pueda saber quiénes son sus vecinos más cercanos que son fanáticos del mismo equipo. Esto no siempre es fácil, siendo que puede haber muchas casas alrededor del lago, muchos equipos de fútbol distintos en Nlogonia, y gran cantidad de mudanzas. Dada una sucesión de M mudanzas, la gente que vive a la orilla del lago quiere darle la bienvenida a cada nueva familia que llega a una casa y decirle a qué distancia están las casas más cercanas cuyas familias simpatizan con su mismo equipo, tanto en sentido antihorario como horario. Notar que si no hay ninguna otra casa alrededor del lago cuya familia siga al mismo equipo que los recién llegados, la distancia en ambos sentidos sería N, ya que la casa más cercana sería la casa de la mudanza. ¿Quieren formar parte del comité de bienvenida? En Nlogonia hay F equipos de fútbol, identificados por enteros diferentes entre 0 y F −1. Como no queremos que pierdan tiempo preguntando casa por casa a qué equipo se sigue allí, vamos a suponer que inicialmente la familia que vive en la casa número i es fanática del equipo número ei , siendo este número generado en forma pseudo-aleatoria por la fórmula recursiva,\n\n                    e1 = A y ei = (B x ei-1 + C) mod F para i = 2, 3, ..., N,\n\n                    donde A, B y C son constantes y la expresión x mód y representa el resto de la división entera de x por y.","id":"2092","category":"Estructuras de Datos y Bibliotecas","statistics":{"level":"9 / 10","submissions":450,"solved":38,"ratio":"8.44%"}}