{"output":"Imprimir en la salida una lÍnea conteniendo un entero que representa la longitud mÍnima de un separador aceptable para el log dado.","input":"Una única línea que contiene el log, que es una cadena no vacía de a lo sumo 105 dígitos binarios.","level":9,"name":"Escape al Escape","has_images":false,"description":"Un protocolo de comunicaciones es un conjunto de reglas para transmitir información en un sistema de comunicaciones. El trabajo de Elisa es escribir programas para implementar partes de dichos protocolos. Muchas veces es necesario transmitir secuencias de campos, y para saber dónde termina un campo y empieza el siguiente se intercala un separador entre cada par de campos consecutivos. Usar un separador simple como espacio, coma, o punto y coma, tiene el inconveniente de que a veces los campos a transmitir contienen esos mismos carácteres. La solución estándar para estos casos es insertar un carácter de “escape” justo antes de cada separador que aparece dentro de un campo, de modo de poder distinguirlo de un separador verdadero. Elisa cree que esta solución va a incrementar mucho la longitud de los datos a transmitir, por lo que decidió usar un separador lo suficientemente complejo como para que nunca esté contenido en los datos. Así piensa escapar de la ineficiente alternativa de escapar los separadores. \n\n                    Para elegir el separador ideal, Elisa recopiló un log, que no es otra cosa que una cadena muy larga de carácteres representativa de los datos que su protocolo va a manejar. Luego de pensar un rato en el asunto, Elisa llegó a la conclusión de que cualquier cadena de carácteres no vacía que no aparezca dentro del log sería un separador aceptable para utilizar en su protocolo. Pero como a ella le interesa minimizar la longitud de los datos a transmitir, quiso saber la longitud mínima que un separador aceptable puede tener. \n\n                    De inmediato se puso a escribir un programa para calcular tal longitud, y lo está probando para el caso particular en el que tanto el log como los separadores aceptables contienen únicamente dígitos binarios (“0” y “1”). ¿Pueden ustedes anticipar los resultados?","id":"2093","category":"Strings","statistics":{"level":"9 / 10","submissions":325,"solved":106,"ratio":"32.62%"}}