{"output":"Imprimir en la salida una lÍnea conteniendo un racional que representa el radio mÍnimo de un cÍrculo que abarca al menos P plantas. Imprimir el resultado utilizando exactamente 4 dÍgitos luego del punto decimal, redondeando de ser necesario.","input":"La primera lÍnea contiene dos enteros N y P que indican respectivamente la cantidad de plantas que hay en el jardÍn y la cantidad mÍnima de plantas que Florencio quiere cortar (1 ≤ P ≤ N ≤ 500). Cada una de las N lÍneas siguientes describe una planta distinta utilizando dos enteros X e Y que representan las coordenadas de la planta en el plano XY (1 ≤ X, Y ≤ 105 ). No hay dos plantas en la misma posición (que coincidan en sus dos coordenadas).","level":10,"name":"Flores","has_images":false,"description":"En Babilonia crecen unas plantas con flores que son muy apreciadas entre los habitantes. Florencio es un habitante de Babilonia que tiene un jardín con N plantas de esta especie y quiere recolectar algunas de sus flores. Como Florencio es bastante perezoso no quiere esforzarse mucho para recolectar las flores. Es así que ha decidido caminar hasta algún punto de su jardín y mediante un movimiento circular de su guadaña cortar una buena cantidad de plantas para luego recolectar sus flores. Florencio es muy hábil usando la guadaña y con ella abarca un círculo perfecto centrado en donde él está parado, lo que le permite cortar todas las plantas que estén en ese círculo, incluyendo su borde. Cuanto más alto levanta Florencio su guadaña, mayor es el radio del círculo que con ella abarca.\n\n                Florencio quiere cortar al menos P plantas, pero su pereza es tal que quiere hacerlo levantando la herramienta lo menos posible. Florencio consiguió una imagen satelital de su jardín donde aparecen todas sus plantas, y luego consiguió que alguien la convirtiera en una lista donde cada planta está representada por sus coordenadas en el plano XY . Ahora está sentado afuera, con su guadaña en mano, esperando que tu equipo le diga el radio mínimo de un círculo que abarca al menos P plantas.","id":"2094","category":"Geometría Computacional","statistics":{"level":"10 / 10","submissions":318,"solved":29,"ratio":"9.12%"}}