{"output":"Imprimir en la salida P líneas, cada una conteniendo un entero, con las respuestas a las preguntas hechas por Horacio en el orden en el que aparecen en la entrada.","input":"La primera línea contiene un entero P que indica la cantidad de preguntas que Horacio quiere hacerles (1 ≤ P ≤ 105 ). Cada una de las P líneas siguientes describe una pregunta utilizando tres enteros A, B y K que representan que Horacio quiere saber cuántos valores distintos de n cumplen que A ≤ n ≤ B y el orden del juego que comienza con n es K (2 ≤ A ≤ B ≤ 106 y 1 ≤ K ≤ 106 ).","level":7,"name":"Horacio y Sus Primos","has_images":false,"description":"A Horacio le gusta jugar escribiendo números naturales en el pizarrón que tiene en su dormitorio. Uno de sus juegos preferidos consiste en escribir primero un número n, luego la suma de todos los primos distintos que dividen a n, y así siguiendo hasta que el número escrito en el pizarrón sea un número primo. Por ejemplo, si Horacio comienza escribiendo el número n = 90, como 90 = 2 × 32 × 5 el siguiente número escrito será 2 + 3 + 5 = 10; a continuación, como 10 = 2×5, Horacio escribirá el número 2 + 5 = 7; finalmente, como 7 es un número primo, aquí terminará el juego.\n                    Formalmente, en este juego cada número natural n ≥ 2 define una secuencia cuyo primer elemento es n, y cada nuevo elemento es la suma de todos los números primos que dividen al elemento anterior de la secuencia. El orden del juego es la posición del primer número primo de la secuencia, y coincide con la cantidad de números que quedan escritos en el pizarrón una vez que termina el juego. Para el ejemplo del párrafo anterior, con n = 90 el orden del juego es K = 3, ya que los números escritos serán 90, 10 y 7.\n                    Ahora bien, no todos los juegos divierten por igual a Horacio, y en este caso resulta que él prefiere comenzar escribiendo un número n tal que el orden del juego correspondiente sea un valor K en particular. A Horacio le gustaría saber cuántos valores distintos de n entre A y B inclusive cumplen con esa condición, pero como no sabe programar necesita que alguien lo haga por él. ¿Ustedes pueden ayudarlo?","id":"2096","category":"Matemáticas","statistics":{"level":"7 / 10","submissions":189,"solved":74,"ratio":"39.15%"}}