{"output":"Imprimir en la salida una línea conteniendo un entero que representa el tiempo máximo en segundos que se puede demorar recolectando el tesoro de manera tal de poder volver al barco sin ser alcanzado por la neblina mortífera. Imprimir el número “-1” si es imposible volver al barco incluso emprendiendo el regreso en el instante en que se descubre el tesoro.","input":"La primera línea contiene dos enteros F y C que indican respectivamente la cantidad de filas y columnas de la grilla que representa a la isla, la cual está formada por al menos dos celdas (1 ≤ F, C ≤ 500 y F × C ≥ 2). Cada una de las F líneas siguientes contiene C valores. En la i-ésima de estas F líneas, el j-ésimo valor es un entero Hij que indica la altura de la celda en la fila i y la columna j (1 ≤ Hij ≤ 106 para i = 1, 2, . . . , F y j = 1, 2, . . . , C).","level":5,"name":"Isla Del Tesoro","has_images":false,"description":"Encontrar los tesoros escondidos hace siglos por piratas en las islas del Caribe no es tarea fácil, pero más difícil aún es vivir para contarlo. Esto es porque, como todos saben, los piratas tenían poderes sobrenaturales que usaban para maldecir a la persona que tomara su tesoro sin permiso.\n\n                    Una maldición muy común entre los piratas más poderosos, y para la cual siempre conviene estar bien preparado, se conoce hoy como la neblina mortífera. Esta maldición consiste en que, cuando el tesoro de un pirata es encontrado, una especie de neblina venenosa se eleva desde la tierra hasta finalmente cubrir la isla entera. Todo ser vivo que sea alcanzado por la neblina muere al instante, algo especialmente poco deseable para quien acaba de encontrar un tesoro. La única forma de salvarse es volver al barco pasando siempre por zonas que no hayan sido todavía alcanzadas por la neblina, y así huir con la porción del tesoro que haya podido rescatarse. En este problema nos interesa saber cuál es el tiempo máximo que se puede demorar recolectando el tesoro de manera tal de poder volver al barco con vida.\n\n                    Para simplificar el problema, vamos a considerar que una isla puede representarse con una grilla de F filas y C columnas, en la que la celda de la i-ésima fila y la j-ésima columna tiene altura Hij sobre el nivel del mar. Más aún, vamos a suponer que el tesoro siempre se encuentra en la celda de la fila 1 y la columna 1, por ser esta la más alejada del único lugar donde puede atracar un barco, que es la celda en la fila F y la columna C. La neblina mortífera aparece al nivel del mar en el instante en que se descubre el tesoro, y sube por toda la isla a razón de una unidad de altura por segundo, de modo que luego de t segundos no se puede estar en ninguna celda de altura menor o igual que t. Para volver al barco se puede pasar de una celda a otra únicamente si comparten un lado, es decir que estando en determinada celda sólo es posible moverse horizontalmente a la celda anterior o siguiente en la misma fila, o verticalmente a la celda anterior o siguiente en la misma columna, pero no está permitido moverse en diagonal ni salir de los límites de la isla. Cada movimiento de una celda a otra demora un segundo.","id":"2098","category":"Graph","statistics":{"level":"5 / 10","submissions":45,"solved":17,"ratio":"37.78%"}}