{"output":"Imprimir en la salida una línea conteniendo un entero que representa la cantidad de maneras diferentes de distribuir N piedras en montañas de modo tal que Jaimito tenga asegurada la victoria en el juego contra Jimena. Como la respuesta puede ser un número muy grande, sólo deben imprimir el resto de su división por 109 + 7.","input":"Una única línea que contiene un entero N, que indica la cantidad de piedras que posee Jaimito (2 ≤ N ≤ 1000).","level":5,"name":"Jugando Con Piedras","has_images":false,"description":"A Jaimito le encanta jugar con las N piedras idénticas que le regalaron para su cumpleaños apilándolas para formar con ellas montañas de diversos tamaños. Su felicidad sería absoluta de no ser por su madre, Jimena, quien siempre le recuerda que al final de cada día llega el Tiempo de Acomodar las Piedras (TAP). Es en ese momento cuando Jaimito debe desarmar las montañas de piedras que con tanto esfuerzo construyó. Como Jimena sabe cuánto le molesta a su hijo el TAP, le propone un juego para que la tarea se vuelva más divertida. Jaimito y su madre juegan alternadamente por turnos, con Jaimito comenzando el juego por ser el menor.\n\n                    Inicialmente hay varias montañas, cada una de las cuales está compuesta por una determinada cantidad de piedras. En su turno, cada jugador elige una montaña que tenga más de una piedra y la divide para formar dos montañas no necesariamente del mismo tamaño. El juego continúa hasta que alguno de los dos jugadores no puede realizar una jugada válida, momento en el que se declara a dicho jugador como el perdedor, y al otro como ganador.\n\n                    Jaimito es muy inteligente, y se ha dado cuenta de que puede distribuir las N piedras para formar las montañas de manera estratégica, de modo tal que al comenzar a jugar con esa distribución ´el ya tenga la victoria asegurada en el TAP. Por cómo se desarrolla el juego, Jaimito no considera que dos distribuciones iniciales son diferentes si únicamente difieren en el orden en el que se encuentran las montañas. Esto significa que para considerar que dos distribuciones iniciales son diferentes, las mismas deben tener distinta cantidad de montañas, o si la cantidad de montañas es la misma entonces las piedras deben estar distribuidas de manera distinta dentro de las montañas. Por ejemplo, si Jaimito tiene N = 4 piedras, hay cinco distribuciones iniciales diferentes: cuatro montañas de una piedra cada una; dos montañas de una piedra y otra de dos piedras; una montaña de una piedra y otra de tres piedras; dos montañas de dos piedras; y, por último, una única montaña de cuatro piedras. Como Jaimito no quiere que su madre se dé cuenta de que está haciendo trampa, quiere cambiar la distribución inicial de las N piedras todos los días. Está convencido de que hay muchas distribuciones iniciales diferentes que le aseguran ganar el juego, pero aún no sabe con certeza cuántas. Por ejemplo, en el caso de N = 4 piedras, Jaimito tiene sólo dos elecciones posibles: una única montaña de cuatro piedras, o dos montañas de una piedra y otra de dos piedras. La tarea de tu equipo en este problema es ayudar a Jaimito a contar de cuántas maneras diferentes puede distribuir sus N piedras en montañas de modo tal de tener asegurada la victoria en el juego contra Jimena. Así Jaimito podrá quedarse tranquilo sabiendo cuántos días puede ganar el juego sin que su madre sospeche de sus buenas intenciones.","id":"2099","category":"Paradigmas","statistics":{"level":"5 / 10","submissions":121,"solved":60,"ratio":"49.59%"}}