{"output":"The output consists of Q integers. The integers represent, in order, the ID numbers the tutors of all students in order in which they were requested.","input":"The input consists of four lines. The first one contains an integer N (2 ≤ N ≤ 100 000), the number of students in Farias Brito. The second line contains N distinct integers Xi (1 ≤ Xi ≤ 109), representing the students’ ID numbers in the order in which they were added to the system. The third line contains the integer Q (1 ≤ Q ≤ 99 999). The fourth line contains Q integers from 1 to N representing the students whose tutors are asked (information regarding the first student shall not be requested).","level":10,"name":"Tutors","has_images":true,"description":"Every time a new student joins the Educational Organization Farias Brito, he or she gets assigned to a tutor to help him know everyone and everything in the school.\n\nThe school’s system to determine each new student’s tutor was designed by a mad man called Succa Liaudzionis. Succa decided to use each student’s ID number to follow the pattern of a binary search tree (because reasons), like this:\n\n\n\tThe first student, with ID X1, becomes the root of the tree and thus has no tutor.\n\tThe numbers X2, X3, …, Xn are added one by one to the tree. To add a number Xi one must traverse the tree starting from the root and using the following rules:\n\n\n\n\tThe pointer is initially set to the root of the tree.\n\tIf Xi is smaller than the ID of the current node, then its left child becomes the current node. Otherwise, the right child does.\n\tIf at some point the required child does not exist, the new node is created containing the value of Xi. The ID of the tutor of the current student is the parent Xi  in the tree.\n\n\nFor example, if the order in which the students were added was (3, 1, 4, 2, 5), the tree would look like this:\n\n\n\nSucca was in need of extra space in his computer and decided to erase all information regarding the students’ tutors. Now, Succa’s boss, Jeixeira Túnior, asked him for the very same information about Q he had just deleted! Succa consider asking each student who his/hers tutor is, but that would take a lot of time.\n\nOn the other hand, Succa still knows the order in which the students were added to tree. Since Succa is not as brilliant as he is mad, he needs your help to use this information to tell him each student’s tutor.","id":"2120","category":"Estructuras de Datos y Bibliotecas","statistics":{"level":"10 / 10","submissions":248,"solved":55,"ratio":"22.18%"}}