{"output":"Imprimir una sola línea conteniendo 3 valores que representan, en este orden, el número de públicos en Valinor, el máximo número de elfos en un público en Valinor y la máxima suma de salarios de los elfos de un público en Valinor. Imprimir el último valor con exactamente 2 dígitos después de la coma.","input":"La entrada consiste de 3 líneas. La primera línea consiste de 2 enteros positivos N y D (N ≤ 105, D ≤ 107), que representan la cantidad de elfos en Valinor y el parámetro que define el concepto de grupo de edad. La segunda línea consiste de N enteros ai (1 ≤ i ≤ N, 0 ≤ ai ≤ 107), que representan las edades de los elfos. Por último, la tercera línea consiste de N valores ci (1 ≤ i ≤ N, 0.00 ≤ ci ≤ 10000.00), con exactamente 2 dígitos luego de la coma, que representan los salarios de los elfos, respetando el orden de los elfos de la línea anterior.","level":9,"name":"URI - Uireb Rhom uin Iavas","has_images":false,"description":"La Uireb Rhom uin Iavas (que se traduce como: Eterna Trompeta del Otoño), es una importante empresa en Valinor, y está investigando diferentes públicos del reino bendito. Para URI, un público es un conjunto no-vacio y maximal de elfos S tal que cualesquiera 2 elfos de S pertenecen al mismo grupo de edad. Por cierto, URI considera que 2 elfos pertenecen al mismo grupo de edad si y solo si la diferencia entre sus edades no excede un parámetro D determinado. Por ejemplo, si D = 500, si Aegnor, Beleg y Celeborn tienen 1300, 500 y 1000 años, Aegnor y Celeborn son considerados del mismo grupo de edad, así como también Beleg y Celeborn, pero no Aegnor y Beleg. Más aún, si los únicos elfos en Valinor fueran Aegnor, Beleg, Celeborn y Daeron, con el último de 700 años de edad, los 2 públicos serían {Aegnor, Celeborn} y {Beleg, Celeborn, Daeron}. Notar que el conjunto {Beleg, Celeborn}, a pesar de tener 2 elfos del mismo grupo de edad, no es considerado un público porque no es maximal (podemos agregar un elfo y que sigan siendo todos del mismo grupo de edad!).\n\nURI quiere saber qué es mejor para lanzar un producto: enfocar en un público lo más grande posible, o enfocar en uno quizás más pequeño, pero de gran poder adquisitivo. Entonces, la información que necesita URI es crucial para que la compañía tome la mejor decisión!","id":"2181","category":"Paradigmas","statistics":{"level":"9 / 10","submissions":490,"solved":70,"ratio":"14.29%"}}