{"output":"Imprimir una sola línea, con la cantidad inicial más pequeña de  puntos de vida que Bia necesita para ser capaz de superar el desafío. Si no es posible llegar a la última sala, imprime -1.","input":"La primera línea contiene dos números enteros N, K indicando, respectivamente, la dimensión de la matriz y la cantidad de habitaciones inmunes que Bia obtiene cuando ella recoge los cinco objetos mágicos. (2 ≤ N ≤ 100, 1 ≤ K ≤ 10).\n\nLuego tenemos N líneas que describen la matriz, cada una de estas líneas contendrá la información de N habitaciones, los carácteres: ‘I’, ‘F’, ‘#’, ‘P’, ‘O’, ‘W’, ‘E’, ‘R’, o un entero D, todo se ha descrito anteriormente.\n\nLa entrada finaliza con un \"end of file\" (EOF).","level":10,"name":"Batalla Final","has_images":false,"description":"Bia está jugando un juego de zombies y ella está a punto de comenzar el desafío final. Vamos a modelar el reto como una matriz NxN, donde la meta de Bia es salir de la habitación situada en la posición [1, 1] y llegar a la habitación de la posición [N, N]. Sin embargo, como nada en esta vida es tan simple, hay habitaciones que contienen zombies, habitaciones que están bloqueadas, y habitaciones que contienen objetos mágicos para ser capturados, y cuando se unen, Bia gana un gran poder.\n\n\n\tLa habitación [1, 1] contiene siempre un carácter ‘I’ y la habitación [N, N] un carácter ‘F’, es decir, significan respectivamente, el comienzo y el final del desafío.\n\tLas habitaciones cerradas estarán representadas por el carácter ‘#’, lo que significa que es imposible pasar a través de ellas.\n\tLa habitación con un número entero D significa que hay zombies y, cuando Bia pasa a través de ella, pierde D puntos de vida.\n\tLas otras habitaciones contienen una de las siguientes letras: ‘P’, ‘O’, ‘W’, ‘E’ o ‘R’, que son las iniciales de cada uno de los cinco objetos mágicos. Cuando Bia pasa a través de una habitación con cualquiera de estos elementos, ella lo recoge y pone en su mochila, y en el momento exacto en el que se recogen todos ellos, Bia se vuelve inmune a los zombies en las próximas K habitaciones que ella ingrese. Es posible tener sólo uno de cada elemento a la vez en la mochila, y, cuando se usa, se pierde, y puede ser recogido de nuevo durante la batalla.\n\n\nSi Bia recoge los cinco elementos mientras sigue bajo el efecto de una unión anterior, la cantidad de espacio inmunológico no se acumulará, volverá al valor máximo de K.\n\nSu tarea consiste en averiguar cuál es la cantidad de puntos de salud de Bia más baja posible en la partida, para que ella pueda ganar el desafío, dado que ella siempre elige la mejor ruta posible. Ella gana el reto si llega a la habitación [N, N] con al menos 1 punto de vida.\n\nSi Bia está de pie en la habitación [X, Y], ella sólo puede caminar a la habitación [X+1, Y] o [X, Y+1].","id":"2183","category":"Paradigmas","statistics":{"level":"10 / 10","submissions":273,"solved":66,"ratio":"24.18%"}}