{"output":"Por cada operación 1, imprime una sola línea que representa la cantidad de ocurrencias de caracteres C en el intervalo entre las posiciones A y B.\n\nPor cada operación 2, imprime la primera y la última ocurrencia del carácter C en el rango entre las posiciones A y B. Si no hay ningún carácter  C en el rango, imprimir -1.\n\nAl final de las N operaciones, imprimir la cadena resultante.","input":"La primer línea de entrada consiste en dos números enteros L (1 ≤ L ≤ 106) y N (1 ≤ N ≤ 105) que representan el número de letras que forman el nombre inicial S, y el número de rondas, respectivamente. La segunda lía contiene el string S, que representa el nombre inicial del perro de Prant. Luego, las siguientes N líneas, representan las N rondas.\n\nSe garantiza que el string S contiene sólo letras minúsculas.","level":10,"name":"Bino, Prant y la Indecision","has_images":false,"description":"Como tu sabes, Prant es un niño muy indeciso. En este caso la resulta difícil elegir el nombre para su perro. Luego de elegir el nombre S para su perro, Bino le propuso un reto. El desafío de Bino consiste de N rondas, y en cada una se pueden realizar las siguientes operaciones:\n\n1 A B C: Devuelve el número de apariciones de un carácter C en el rango entre las posiciones A y B. Por ejemplo, para S = \"abcda\", A = 1, B = 5 y C = 'a', la respuesta es 2.\n\n2 A B C: Encuentra la primera y última aparición de un carácter C en el intervalo entre las posiciones A y B. Por ejemplo, para S = \"abcda\", A = 1, B = 5 y C = 'a', la primera ocurrencia de C está en la posición 1, y la última en la posición 5.\n\n3 A B: I Invierte todas las letras en el rango entre las posiciones A y B. Por ejemplo, para S = \"abcd\", A = 2 y B = 4, luego de la operación S = \"adcb\".\n\n4 A C: Agrega el carácter C antes del carácter que está en la posición A. Por ejemplo, para S = \"abcd\", A = 2 y C = 'z', luego de la operación S = \"azbcd\".","id":"2186","category":"Estructuras de Datos y Bibliotecas","statistics":{"level":"10 / 10","submissions":339,"solved":42,"ratio":"12.39%"}}