{"output":"For each test case, display a single line beginning with the case number. If there is a solution, display the maximum number of widgets that can be added to the chip. Display “impossible” if there is no solution.\r\n\r\n\t\t\t\t\tFollow the format of the sample output.","input":"The input consists of several test cases. Each case starts with a line containing three integers: The size of the chip N (1 ≤ N ≤ 40), and A and B (1 ≤ B ≤ 1000, 0 ≤ A ≤ B) as described above. Each of the following N lines contains N characters describing the slots, one of ‘.’, ‘/’ or ‘C’, as described above.\r\n\r\n\t\t\t\t\tThe last test case is followed by a line containing three zeros.","level":2,"name":"Chips Challenge","has_images":false,"description":"A prominent microprocessor company has enlisted your help to lay out some interchangeable components (widgets) on some of their computer chips. Each chip’s design is an N ×N square of slots. One slot can hold a single component, and you are to try to fit in as many widgets as possible.\r\n\r\n\t\t\t\t\tModern processor designs are complex, of course. You unfortunately have several restrictions:\r\n\r\n\t\t\t\t\t\r\n\t\t\t\t\t\tSome of the slots are disabled.\r\n\t\t\t\t\t\tSome of the slots are already occupied by other components and cannot be used for widgets.\r\n\t\t\t\t\t\tThere are sibling memory buses connected to the horizontal and vertical edges of the chip and their bandwidth loads need to match. As such, there must be exactly as many components in the first row as in the first column, exactly as many in the second row as in the second column, and so on. Component counts include both the components already specified on the chip and the added widgets.\r\n\t\t\t\t\t\tSimilarly, the power supply is connected at the end of each row and column. To avoid hot spots, any given row or column must have no more than A/B of the total components on the chip for a given A and B.\r\n\t\t\t\t\t\r\n\r\n\t\t\t\t\tA specification for a chip is N lines of N characters, where ‘.’ indicates an open slot, ‘/’ indicates a disabled slot, and ‘C’ indicates a slot already occupied by a component. For example:\r\n\r\n\t\t\t\t\tCC/..\r\n\r\n\t\t\t\t\t././/\r\n\r\n\t\t\t\t\t..C.C\r\n\r\n\t\t\t\t\t/.C..\r\n\r\n\t\t\t\t\t/./C/\r\n\r\n\t\t\t\t\tIf no more than 3/10 of the components may be in any one row or column, the maximum number of widgets that can be added to this 5 × 5 chip is 7. A possible arrangement is below, where ‘W’ indicates a widget added in an open slot.\r\n\r\n\t\t\t\t\tCC/W.\r\n\r\n\t\t\t\t\tW/W//\r\n\r\n\t\t\t\t\tW.C.C\r\n\r\n\t\t\t\t\t/.CWW\r\n\r\n\t\t\t\t\t/W/C/","id":"2195","category":"Ad-Hoc","statistics":{"level":"2 / 10","submissions":6,"solved":3,"ratio":"50.00%"}}