{"output":"For each test case, display its case number followed by the minimum number m of cells that must be infiltrated to obtain complete control of the ACM. Then display m numbers c1, . . . , cm in any order, indicating the list of cells to infiltrate (cells are numbered from 1 to n). If more than one set of m cells gives complete control, any one will be accepted.","input":"The first line of a test case contains the number n of cells the ACM has (1 ≤ n ≤ 75). Each of the next n lines contains a binary string of length n where the ith character of the jth line is 1 if cell j controls cell i, and 0 otherwise (1 ≤ i, j ≤ n).\n\n\t\t\t\t\tThe ith character of the ith line is 0 and for i != j, either the ith character of the jth line is 1 or the jth character of the ith line is 1, but not both.","level":10,"name":"Infiltration","has_images":false,"description":"Good morning, agent W-12. Your mission, should you choose to accept it, is as follows.\n\n\t\t\t\t\tWe are infiltrating the ever so insidious Association of Chaos and Mischief (ACM) in order to take down their command structure. Unfortunately, they appear to be prepared for such an eventuality, and have given their command structure an annoyingly complex design which makes our infiltration quite difficult.\n\n\t\t\t\t\tThe ACM command structure is divided into several cells. For each pair of cells A and B, either A controls B or B controls A. But this “control” relation can be cyclic, so it could happen that A controls B and B controls C and C controls A.\n\n\t\t\t\t\tWe can send in agents to infiltrate any particular cell, which gives us control over that cell and the cells that it controls, but not any other cells. So in the example above, infiltrating A would give us control over A and B, but not C.\n\n\t\t\t\t\tFor a successful infiltration of the ACM, we must obtain control over all of its cells, otherwise the cells that are out of our control will discover us and start causing some of their trademark chaos and mischief. As you know, we’re on a tight spending leash from higher authority these days, so we need to execute this mission as efficiently as possible. Your mission is to figure out the minimum number of cells we need to infiltrate in order to succeed.\n\n\t\t\t\t\tThis mission briefing will self-destruct in five hours. Good luck!","id":"2209","category":"Ad-Hoc","statistics":{"level":"undefined","submissions":-1,"solved":-1,"ratio":"undefined"}}