{"output":"For each test case, display its case number followed by:\n\n\t\t\t\t\t\n\t\t\t\t\t\t0 if the safe opens without inserting a mirror.\n\t\t\t\t\t\tk r c if the safe does not open without inserting a mirror, there are exactly k positions where inserting a mirror opens the safe, and (r, c) is the lexicographically smallest such row, column position. A position where both a \u001e/ and a \\\u001f mirror open the safe counts just once.\n\t\t\t\t\t\t'impossible' if the safe cannot be opened with or without inserting a mirror.","input":"Each test case describes a single safe and starts with a line containing four integer numbers r, c, m, and n (1 ≤ r, c ≤ 1 000 000 and 0 ≤ m, n ≤ 200 000). The mechanism’s grid has r rows and c columns. Each of the next m lines contains two integer numbers ri and ci (1 ≤ ri ≤ r and 1 ≤ ci ≤ c) specifying that there is a /\u001e mirror in row ri column ci . The following n lines specify the positions of the \u001f\\ mirrors in the same way. The m + n positions of the mirrors are pairwise distinct.","level":7,"name":"A Safe Bet","has_images":true,"description":"Safe Ltd. is a company that manufactures high-quality safes. Its latest invention is an optical closure mechanism that uses a laser beam passing through a rectangular grid with several mirrors.\n\n\t\t\t\t\t \n\n\t\t\t\t\tWhen the laser is activated, a beam enters the top row of the grid horizontally from the left. The beam is reflected by every mirror that it hits. Each mirror has a 45 degree diagonal orientation, either / or \\ \u001f. If the beam exits the bottom row of the grid horizontally to the right, it is detected and the safe opens (see the left side of the figure above). Otherwise the safe remains closed and an alarm is raised.\n\n\t\t\t\t\tEach safe has a missing mirror, which prevents the laser beam from traveling successfully through the grid (see the right side of the figure above). The safe has a mechanism that enables the user to drop a single mirror into any empty grid cell. A legitimate user knows the correct position and orientation of the missing mirror ( /\u001e in row 4 column 3 above) and can thus open the safe. Without this knowledge the user has to guess correctly, which can be difficult for safes with large grids.\n\n\t\t\t\t\tYour job is to determine if particular safes are actually secure. A secure safe does not open right away without inserting a mirror, and there is at least one valid location and orientation for the missing mirror. There may indeed be multiple such locations and orientations.","id":"2213","category":"Ad-Hoc","statistics":{"level":"7 / 10","submissions":18,"solved":6,"ratio":"33.33%"}}