{"output":"For each input set of test his program to produce a set of rows in the output. The first line should contain a test set identifier in the format \"Teste n\", where n is sequentially numbered from 1. Then your program must write one line for each tank set of tests. Each line should contain an integer representing the difference (in cents) between the amount deposited in piggy banks of Hansel and Zezinho. Let a blank line at the end of each test set. The spelling shown in Example output below should be followed strictly.","input":"The input consists of several test sets. The first line of a test set contains an integer N (0 ≤ N ≤ 100), indicating the number of deposits in piggy banks. The N following lines describe each of a deposit in piggy banks; the deposit is indicated by two integer values J e Z (0 ≤ J,Z ≤ 100), separated by a blank space, representing respectively the values in cents, deposited in the vaults of the grandsons Hansel and Zezinho. The end of input is indicated by N = 0.","level":3,"name":"Grandma Vitória's Piggy Banks","has_images":false,"description":"Grandma Victoria maintains since the birth of the grandsons Hansel and Zezinho , a ritual that is the delight of boys. She keeps all the coins received as change in two small piggy banks, one for each grandson. When one of piggy banks becomes full, she calls the two grandsons for a lively lunch at the end of which the delivery boys saved the coins in each piggy banks.\r\n\r\nShe was always very zealous about the equal distribution of the collected change. Where by reason of the value of coins, she can not put the same amount in the two piggy banks, she memorizes the difference in order to make up for it next deposit.\r\n\r\nGrandma Victoria is getting old and is afraid that memory lapses to do commit injustices with her grandsons, failing to compensate for differences between the piggy banks. Your task is to help Grandma Victoria, writing a computer program that displays the differences between the deposits, so that it does not have to worry about memorizing them.","id":"2247","category":"Ad-Hoc","statistics":{"level":"3 / 10","submissions":1336,"solved":597,"ratio":"44.69%"}}