{"output":"For each entry in the class your program should produce three lines in the output. The first line should contain a test set identifier in the format \"Turma n\", where n is numbered from 1. The second line should contain the codes of the students who obtained the highest average in the class. The students of codes must appear in the same order of entry, and each must be followed by a blank space. The third line should be left blank. The format shown in no  the sample output below should be followed strictly.","input":"The input consists of several test sets, representing several classes. The first line of a set of tests contains an integer number N (1 ≤ N ≤ 1000) indicating the total number of students in the class. The N following lines contain, each, a pair of integers C (1 ≤ C ≤ 20000) and M (0 ≤ M ≤ 100), respectively indicating the code and the average of a student. The end of input is indicated by a class with N = 0.","level":6,"name":"Internship","has_images":false,"description":"You got an internship to work as a programmer in the office of your school. As a first task, Dona Vilma, the coordinator, asked you to enhance a program that was developed by the former trainee. This program has as input a list of names and final average of students in a class, and provides the student with the highest average in the class. Dona Vilma want to use the program to reward the best student from each school class. The program developed by the former intern is on the following pages (Pascal program on page 5, C program on page 6, C ++ program on page 7).\r\n\r\nAs you can see, the program in its current form has a flaw: if there tied students with the best average in the class, it prints only the first student that appears in the list.\r\n\r\nDona Vilma wants you to change the program so that it produces a list of all students in the class who have obtained the highest average, and not just one. Can you help her in this task?","id":"2248","category":"Ad-Hoc","statistics":{"level":"6 / 10","submissions":2256,"solved":576,"ratio":"25.53%"}}