{"output":"For each test set, your program must write three lines in the output. The first line should contain a test set identifier in the format \"Teste n\", where n is sequentially numbered from 1. The second line should contain the number of movements that are performed by the given algorithm to solve the problem of Torres Hanoi with N disks. The third line should be left blank. The spelling shown in Example output below should be followed strictly.","input":"The input has multiple test sets. Each test set consists of a single line containing a single integer N (0 ≤ N ≤ 30), indicating the number of disks. The end of input is indicated by N = 0.","level":4,"name":"Towers of Hanoi","has_images":true,"description":"The puzzle Towers of Hanoi is very old and known, consisting of a set of N disks of different sizes and three vertical pins, in which the disks can be fitted.\r\n\r\n\t\t\t\t\t\r\n\r\n\t\t\t\t\tEach pin may contain a stack with any number of disks, since each disk is not placed above the other smaller sized disc. The initial configuration consists of all disks on pin 1. The aim of the puzzle is to move all disks to one of the other pins, always obeying the restriction not put a disc on another smaller.\r\n\r\n\t\t\t\t\tAn algorithm to solve this problem is the following.\r\n\r\n\t\t\t\t\tprocedure Hanoi(N, Orig, Dest, Temp)\r\n\r\n\t\t\t\t\t   if N = 1 so\r\n\r\n\t\t\t\t\t      move the smaller disc Orig pin for pin Dest;\r\n\r\n\t\t\t\t\t   if no\r\n\r\n\t\t\t\t\t      Hanoi(N-1, Orig, Temp, Dest);\r\n\r\n\t\t\t\t\t      moving the Nth lower disc Src Dest pin for pin;\r\n\r\n\t\t\t\t\t      Hanoi(N-1, Temp, Dest, Orig);\r\n\r\n\t\t\t\t\t   end-if\r\n\r\n\t\t\t\t\tend\r\n\r\n\t\t\t\t\tYour task is to write a program to determine how many moves to change a disk from a pin to the other will be executed by the above algorithm to solve the puzzle.","id":"2251","category":"Ad-Hoc","statistics":{"level":"4 / 10","submissions":1245,"solved":605,"ratio":"48.59%"}}