{"output":"Seu programa deve imprimir, na saída padrão, uma única linha, contendo a letra S se for possível fazer um arquivamento perfeito ou N caso contrário.","input":"A entrada contém um único conjunto de testes, que deve ser lido do dispositivo de entrada padrão (normalmente o teclado). A primeira linha da entrada contém dois inteiros P e N que indicam, respectivamente, o número de posições possíveis para se colar as abas (1 ≤ P ≤ 1.000) o número pastas a serem armazenadas (1 ≤ N ≤ 1.000.000). As N linhas seguintes contém um inteiro I (1 ≤ I ≤ P ) cada representando a posição onde a aba da I -ésima pasta foi colada.","level":5,"name":"Pastas","has_images":false,"description":"Estela é uma secretária dedicada da OBI (Organização Burocrática Internacional), um megaconglomerado empresarial voltado a criação de documentos e preenchimento de formulários. Todo dia ela recebe milhares de pastas suspensas e seu objetivo é organizá-las de uma forma que seja simples recuperar uma pasta do arquivo.\r\n\r\nCada pasta possui uma pequena aba, que fica anexada à pasta e é visível quando a pasta está suspensa em seu arquivo. Todo funcionário fixa a aba em uma das posições especificadas pelo manual de fixação de abas, embora ele possa escolher, ao acaso, qualquer uma das posições descritas no manual. Tais posições são numeradas de 1 até P .\r\n\r\nEstela notou que fica consideravelmente mais fácil encontrar as pastas se elas forem arquivadas da seguinte forma: primeiro uma pasta com aba na posição 1, depois uma com aba na posição 2, e assim sucessivamente, até que uma pasta com aba na posição P seja arquivada. Logo após, repete-se o processo, arquivando uma pasta com aba na posição 1. Para Estela, um conjunto de pastas é arquivado de forma perfeita se todas as pastas desse conjunto forem arquivadas da forma descrita anteriormente, ou seja:\r\n\r\n\r\n\tImediatamente após toda pasta com aba na posição I , I < P , existe uma pasta com aba na posição I + 1 ou não há nenhuma pasta.\r\n\tImediatamente após toda pasta com aba na posição P , existe uma pasta com aba na posição 1 ou não há nenhuma pasta.\r\n\tTodas as pastas do conjunto são armazenadas.\r\n\r\n\r\nDado um conjunto de pastas e a posição de suas abas, determinar se é possível arquivar esse conjunto de pastas de forma perfeita.","id":"2324","category":"Ad-Hoc","statistics":{"level":"5 / 10","submissions":237,"solved":97,"ratio":"40.93%"}}