{"output":"Seu programa deve imprimir uma única linha contendo o valor da matriz C na linha e coluna especificadas.","input":"A primeira linha da entrada contém um inteiro N, indicando as dimensões das matrizes A, B e C (2 ≤ N ≤ 105). A linha seguinte contém seis inteiros P, Q, R, S, X e Y, indicando os parâmetros das matrizes A e B (2 ≤ X, Y ≤ 104; 0 ≤ P, Q < X; 0 ≤ R, S < Y).\n\n\t\t\t\t\tFinalmente, a última linha da entrada contém dois inteiros I e J, indicando a linha e a coluna da matriz C a serem consultados (1 ≤ I, J ≤ N).","level":6,"name":"Multiplicação de Matrizes","has_images":false,"description":"O conglomerado indiano Tutu é um conjunto de empresas que atua nos mais diversos ramos da indústria, produzindo desde sapatos até aviões e foguetes. Por ser tão diversificada, precisa de grandes e rápidos sistemas para cálculos de contabilidade.\n\n\t\t\t\t\tUm dos módulos mais importantes desse sistema é o de fornecimento de produtos, onde fica a base de dados de produtos e fornecedores. Um mesmo produto pode ser fornecido por vários fornecedores diferentes.\n\n\t\t\t\t\tO sistema possui duas grandes matrizes: a matriz A, onde cada linha representa um produto e cada coluna representa um fornecedor. O valor da matriz na linha m e coluna n representa o preço do produto m se for comprado do fornecedor n.\n\n\t\t\t\t\tA outra grande matriz é a B, onde cada linha representa um dia do mês e cada coluna é um produto. O valor da matriz na linha m e coluna n representa a quantidade do produto n a ser adquirido no dia m. Tal empresa tem uma política de fidelidade com seus fornecedores, e uma das práticas efetuadas pela empresa é, em um determinado dia, comprar todos os produtos necessários de um único fornecedor. Isto é, em um dia todos os produtos adquiridos serão comprados do fornecedor x, no outro dia do fornecedor y, e assim por diante.\n\n\t\t\t\t\tPara auxiliar a escolha de qual fornecedor será o escolhido no dia, foi gerada outra matriz C, que é o resultado da multiplicação das matrizes A × B. Essa matriz diz o quanto será gasto pela empresa se adquirir todos os produtos de um determinado fornecedor em um determinado dia.\n\n\t\t\t\t\tAs matrizes A e B são quadradas (o número de linhas é igual ao número de colunas) e têm valores definidos pelas fórmulas:\n\n\t\t\t\t\tAij = (P × i + Q × j) (mod X)\n\t\t\t\t\tBij = (R × i + S × j) (mod Y)\n\n\t\t\t\t\tonde i é o índice da linha da matriz e j é o índice da coluna da matriz (todos os índices vão de 1 até N). Os inteiros P, Q, R, S, X e Y são parâmetros constantes, que definem as duas matrizes A e B.\n\n\t\t\t\t\tEscreva um programa que, dados os parâmetros das matrizes A e B, e a posição de uma das entradas as matriz C, calcula o valor daquela entrada.","id":"2385","category":"Ad-Hoc","statistics":{"level":"6 / 10","submissions":386,"solved":92,"ratio":"23.83%"}}