{"output":"A saída deve conter uma única linha, indicando o número mínimo de partes em que Bob precisa quebrar a sequência original para que ele termine apenas com PAs.","input":"A primeira linha da entrada é composta por um inteiro N(1 ≤ N ≤ 105), o número de elementos da sequência. Na segunda linha existem N inteiros ai (-105 ≤ ai ≤ 105​), os elementos da sequência.","level":3,"name":"Progressões Aritméticas","has_images":false,"description":"Bob é um aluno do ensino médio que gosta muito de matemática. Na última aula ele aprendeu o que são Progressões Aritméticas (PAs) e ficou fascinado por elas. Pelo que Bob entendeu, Progressões Aritméticas são sequências de números nas quais a diferença entre dois elementos consecutivos é sempre igual a uma constante r, chamada de razão da PA.\r\n\r\nUm exemplo de Progressão Aritmética de razão 2 é −1, 1, 3, 5. Além disso, toda sequência com um ou dois elementos é sempre uma Progressão Aritmética. Por outro lado, 5, 6, 8, 9, 10 não é uma PA porque a diferença entre elementos consecutivos não é constante: a diferença entre os dois primeiros elementos é 6−5 = 1, enquanto a diferença entre o terceiro e o segundo elementos é 8−6 = 2.\r\n\r\nBob percebeu que qualquer sequência, mesmo que a mesma não seja uma Progressão Aritmética, pode ser quebrada em sequências menores que são PAs. Por exemplo, vimos que a sequência 5, 6, 8, 9, 10 não é uma PA, mas podemos quebrar ela entre o 6 e o 8 para obtermos as sequências 5, 6 e 8, 9, 10, que são PAs. Note que não existe como quebrar a sequência em menos partes se quisermos ter apenas PAs no fim do procedimento.\r\n\r\nBob é fascinado por programação mas ainda não sabe programar muito bem, e por isso pediu sua ajuda: ele não está conseguindo descobrir como quebrar sequências muito grandes de um jeito eficiente; por isso, pediu que você escrevesse um programa para, dada uma sequência qualquer, imprimir o número mínimo de partes em que precisamos quebrar a sequência para termos apenas Progressões Aritméticas no término do processo. Caso a sequência original já seja uma PA, podemos terminar o processo com uma única parte, e portanto a resposta para esse caso é 1.\r\n\r\nÉ fácil verificar que a sequência −2, 0, 2, 3, 3, 4, 6 (do segundo caso de teste abaixo) não é uma PA, pois 2−0 ≠ 3−2. Verificando manualmente, você pode constatar que não é possível particionar a sequência em duas de tal forma que ambas as partes sejam PAs. Entretanto, existe uma maneira de particionar a sequência em 3 PAs: [−2, 0, 2] [3, 3] [4, 6]. Portanto, temos que a resposta para este exemplo é 3.\r\n\r\nNo terceiro caso de teste abaixo, a sequência −2, 0, 3, 6 pode ser particionada de várias formas. As únicas maneiras que resultam em PAs são as seguintes:\r\n\r\n\r\n\tCom 4 partes temos 1 possibilidade:\r\n\t[−2] [0] [3] [6]\r\n\t\r\n\tCom 3 partes temos 3 possibilidades:\r\n\t[−2, 0] [3] [6]\r\n\r\n\t[−2] [0, 3] [6]\r\n\r\n\t[−2] [0] [3, 6]\r\n\t\r\n\tCom 2 partes temos 2 possibilidades:\r\n\t[−2, 0] [3, 6]\r\n\r\n\t[−2] [0, 3, 6]","id":"2391","category":"Ad-Hoc","statistics":{"level":"3 / 10","submissions":217,"solved":111,"ratio":"51.15%"}}