{"output":"Seu programa deve imprimir uma única linha, contendo apenas um inteiro, o total de pontos obtidos por Juquinha.","input":"A primeira linha da entrada contém dois inteiros positivos, C (1 ≤ C ≤ 105) e T (1 ≤ T ≤ 105), que representam, respectivamente, o número de círculos do alvo e o número de tiros.\r\n\r\nCada uma das C linhas seguintes contém um inteiro positivo. O i-ésimo inteiro Ri (1 ≤ Ri ≤ 106 para 1 ≤ i ≤ C) ,Ri > Ri-1 para 2 ≤ i ≤ C) representa o raio do i-ésimo círculo. Os raios Ri são fornecidos em ordem crescente.\r\n\r\nCada uma das T linhas seguintes contém um par X, Y (-105 ≤ X, Y ≤ 105) de inteiros, que representam as coordenadas de cada tiro.","level":7,"name":"Tiro ao Alvo","has_images":true,"description":"Recentemente Juquinha ganhou de aniversário um joguinho bem clássico: Tiro ao Alvo. Ele arrumou um ótimo lugar em seu quarto para se divertir com o jogo, porém após ler todas as regras do jogo ele percebeu que precisa da sua ajuda para calcular a pontuação obtida.\r\n\r\nSegundo as regras, o alvo do jogo é composto por C círculos, todos centrados na origem (0,0). Juquinha atira T vezes e após cada tiro informa suas coordenadas. A pontuação de cada tiro é feita da seguinte forma: para cada círculo em que o tiro estiver contido Juquinha recebe um ponto.\r\n\r\nConsidere por exemplo a figura abaixo. O tiro marcado com a letra A recebe zero pontos, pois não está contido por nenhum círculo. O tiro marcado com a letra B recebe um ponto, pois está contido por um círculo (o mais externo). O tiro marcado com a letra C recebe dois pontos, pois está contido por dois círculos (note que este caso mostra que tiros exatamente na borda de um círculo são considerados como contidos pelo círculo). Já o tiro marcado com a letra D recebe três pontos, pois está contido pelos três círculos. Considerando todos os pontos, a pontuação total de Juquinha é de 13 pontos.\r\n\r\n\r\n\r\nDados os raios de C círculos centrados na origem e as coordenadas dos T tiros realizados por Juquinha, escreva um programa que calcula o total de pontos que Juquinha obteve.","id":"2432","category":"Ad-Hoc","statistics":{"level":"7 / 10","submissions":1266,"solved":334,"ratio":"26.38%"}}