{"output":"For each question in each test case, print the greatest distance the horse walked between point (x1, y1) and point (x2, y2), with accuracy of two decimal places.","input":"The first line of input contains the number of points N (2 ≤ N ≤ 104) and the number of questions P (2 ≤ P ≤ 104). The next N  lines contains a point (x, y), (0 ≤ x, y ≤ 104), representing the point in which the horse was recognized, that is, his current point. No two equal recognition points will be given in the input. Then, the next P  lines contains two points: (x1, y1) and (x2, y2), indicating the question of the greatest distance walked between them.","level":4,"name":"É Na Batida do Cavalo!","has_images":false,"description":"Furacão is a famous bookmaker, best known for winning every single horse racing bet in the past 10 years. Some say it's fraud, some say he has foolproof strategies to always win. Anyway, he's undeniable a great bookmaker. However, he's tired of winning so much, and thus, he has challenged the one who can make him lose. Considering this, CARRETA Furacão (Clube de Apostas para o Recomeço e para a Realização do Extermínio do Tal Apostador Furacão) was created with the sole purpose of making Furacão lose.\n\n\t\t\t\t\tThe first \"horse racing\" promoted by CARRETA Furacão will occur in a very different way from traditional racing: There'll be only one horse and this one, instead of racing, will walk the whole course in beat gait, after all, this \"race\" has the purpose of defeating the Bookmaker. The \"race\" will occur as follows: the horse starts its gait at a given point, and every time he passes by a course recognition point, the distance between the current point and the previous one will be calculated, in other words, at the end of the gait, there will be several isolated distances, each of them related to two points.\n\n\t\t\t\t\tThe challenge proposed to the Bookmaker is that he answers several questions such as \"What is the greatest distance the horse walks from point (x1, y1) to point (x2, y2)?\" in no more than 1 second! CARRETA Furacão is sure he's going to lose this time, but Furacão is a very smart man, so he perceived the possibility of hiring a programmer to do this work for him, that is, to create a program he can use in the event day to win the bet.\n\n\t\t\t\t\tUpon knowing that you are a good programmer and that you take part in illegal activities if you get the 'good green', Furacão has hired you without a second thought. Therefore, your task is to write a program that outputs the greatest distance the horse walks between two given points. Keep in mind that there's only one way between two points.","id":"2488","category":"Estructuras de Datos y Bibliotecas","statistics":{"level":"4 / 10","submissions":91,"solved":59,"ratio":"64.84%"}}