{"output":"For each test case, if Habay decides to eat at the restaurant, print the average popularity of the chosen dishes (with accuracy of two decimal places); otherwise, print the average popularity of all the dishes together (same accuracy) and then print a blank space and the exclamation \"NO!\", indicating that Habay will leave the restaurant berserk.","input":"The input has several test cases. Each test case contains two integers Q (2 ≤ Q ≤ 100) and D (1 ≤ D ≤ 100), indicating the number of dishes and Habay's available money, respectively. The next Q lines contains the amount of protein (1 ≤ P ≤ 200), the cost (1 ≤ C ≤ 100) and the popularity (1 ≤ R ≤ 10) of the respective dish. No dishes will have the same amount of protein. Read input until Q = D = 0.","level":10,"name":"Habay e Robfilho – Os Fujões","has_images":false,"description":"Habay and Robfilho, veteran programming contest competitors, this year participated in the first phase of the Regionals as reserves. However, at the event site, there weren't enough computers for them to test their codes. Unhappy with the situation, they solved every problem on paper in 30 minutes, personally handed them to the judges and decided to go \"get some grub\" in the nearest restaurant.\n\n\t\t\t\t\tThe restaurant chosen has some peculiarities: costumers have access to the statistics and characteristics of each dish, such as popularity and nutrients. Moreover, there's a huge variety of dishes, for the happiness of Habay. As a great vegan, Habay decided that he would choose the dishes with the highest amount of protein, but ended up facing a dilemma: if the dishes chosen are less popular, his rate will go down in the social network RateMe. However, if he chooses the most popular dishes but doesn't consume the maximum amount of protein, he'll have his conscience guilty because he won't be fully contributing to his health.\n\n\t\t\t\t\tAlthough Habay loves popularity, he prioritizes his health and thus he will choose the dishes with the highest amount of protein, but with one condition: the average popularity of the chosen dishes must be greater than the average popularity of all the dishes together, otherwise Habay won't eat at that restaurant. Also, since Habay likes variety, he won't choose the same dish more than once, and logically, he won't be able to spend more than the available money.\n\n\t\t\t\t\tSo, help Habay decide whether he should eat at this restaurant or not. Regarding Robfilho, he will choose the heaviest dishes because he's \"mighty hungry\" and so he won't need help.","id":"2491","category":"Paradigmas","statistics":{"level":"10 / 10","submissions":60,"solved":11,"ratio":"18.33%"}}