{"output":"Como en el ejemplo dado, compruebe que la etiqueta se ha utilizado correctamente. Su programa debe informar \"Successful !!\" si la sintaxis es correcta o \"error\" si falta algo. El mensaje se debe mostrar sin las comillas, con el salto de línea al final.","input":"La entrada contiene un entero 0 < N <100 que indica el número de situaciones que se va a comprobar. Las líneas siguientes corresponden a las situaciones, cada una con un entero K (0 o 1) (que será el medio de identificación de la etiqueta) y luego viene una línea con el código S (0> S <200) a ser comprobado.","level":10,"name":"¡Ayude al profesor Webscript!","has_images":false,"description":"El profesor Webscript, uno de los renombrados profesores del Instituto Federal de Muzambinho, enseña a sus alumnos a desarrollar sitios totalmente responsivos y prácticos, sin la necesidad de marcos. Él ayuda a los más diversos tipos de alumnos de toda la escuela, pero se cansó de enseñar la sintaxis correcta de las etiquetas (\">\" cerrar y \"<\" abre), de manera correcta. Entonces, para volver la paz y la tranquilidad que tenía, él solicita su ayuda.\nHabrá diversos tipos de tag, no es necesario que los textos entre las señales de las etiquetas, su programa deberá indicar si una etiqueta se utilizó correctamente o no. No olvide que su programa debe seguir algunos criterios como en el ejemplo siguiente.\n\nI - El primer parámetro indica el tipo de etiqueta:\n1 - Cuando la etiqueta es única.\n0 - Cuando la etiqueta tiene dos pares de señales;\n\n\nII - Los signos como \">\" o \"<\" sólo se utilizarán para indicar el cierre o la apertura de una etiqueta:\n0 <p> Inicio> Descarga> Sublime <\/ p> -> error\n1 <input type = \"text\" name = \"Next>\"> -> error\n0 <ul> <li> Ola <\/ li> <\/ ul> -> Successful\n1 <span> <br> -> correcto\n0 <> <\/ li> -> error\n\n\nCuando insertamos el parámetro, sólo existieron etiquetas del patrón elegido, por ejemplo: si colocamos 0 (cuando la etiqueta tiene dos pares de señales) el programa sólo va a verificar etiquetas con dos pares de señales, lo mismo sucede cuando ponemos 1 (Cuando la etiqueta etiqueta es única). Entonces en una única etiqueta no habrá los dos tipos.","id":"2684","category":"Ad-Hoc","statistics":{"level":"10 / 10","submissions":458,"solved":28,"ratio":"6.11%"}}