{"output":"Imprima la línea y la columna, de esa forma (fila> x columna> y) de la silla donde la media de las adyacentes sea menor que su altura y la distancia hasta la salida sea la mínima posible.","input":"Será un entero A se refiere a su altura, y luego una breve radiografía de 13x13 del refectorio. \"0\" los lugares donde él puede sentarse, la salida \"77\", las paredes \"88\", \"11\" patio, \"99\" corredores. La salida será por EOF.","level":10,"name":"Eligiendo un Lugar","has_images":true,"description":"A comida do refeitório é muito boa, todos los días de los estudiantes esperan ansiosamente para degustar sus delicios. Webscrit Junior (WBJ), que tiene un máximo de dos filas, y se encuentra con el refeitório casi lotado, así que con algunas sillas vagas \"0\". Como WBJ es muy observador, andando por corredores \"99\", busca lugares disponibles \"0\" para sentar. Un lugar en el que se puede sentar en un lugar donde hay una altura de las personas adyacentes en el lugar donde hay un menor que su tamaño y en el otro lado de la salida (que se encuentra en la línea 1 columna 8, apenas para facíilitar una vista). Todo el cuidado de los niños por correr el libro \"11\", y no perder ningún segundo de su materia preferida (AED).\n\n\n\nAtención:\n\n\n\tComo las paredes \"88\", o espacio para el refeitório \"11\", o aún el último lugar de la mesa (nas quinas), son las posiciones desconsideradas por (WEJ);\n\tA cada silla que WEJ pasa 1 considerado;\n\tLos pasos de WEJ hasta una mesa no son contados;\n\tUna silla válida, es aquela en la que sus medios de comunicación son desapercibidos (\"99\") são menores que su altura;\n\tNo tener hijos, no tener una silla que atende los requesitos;\n\tos \"00\" de la figura servem para mostrar onde como cadeiras ficão.\n\n\n(L = 3 | C = 3) e 2 (L = 6 | C = 6) atendiendo los criterios de los medios de comunicación, podemos llegar a concluir que, a cadeira 1 está más cerca de la salida de la silla 2, para el número de sillas que (WBJ) pasar a una salida, es menor. E é más cerca de una silla 3 (L = 8 | C = 12) que además de estar en la mesa de la mesa (um local desconsideável) está listo.\n\nMientras está en la fila, resolver el problema para que pronto para que o ajude en la opción de mejor lugar.","id":"2688","category":"Graph","statistics":{"level":"10 / 10","submissions":131,"solved":9,"ratio":"6.87%"}}