{"output":"La salida se imprimirá según la figura anterior.","input":"No hay.","level":5,"name":"Salida 4","has_images":false,"description":"Su profesor de programación le gustaría que usted hiciera un programa con las siguientes características:\n\n\n\tCrear 16 variables enteras;\n\tAsignar a ellos valores de 0 a 15 a cada una de las variables anteriores;\n\tTener 39 rasgos (-) en la primera línea;\n\tTener una | en el primer trazo, décimo tercero, vigésimo tercero y del trigésimo noveno trazo de la primera línea, debajo del cuarto trazo debe comenzar a escribir \"decimal\", debajo del 16º trazo debe comenzar a escribir \"octal\", debajo del 26º trazo debe comenzar a escribir \"octal\" escribir \"Hexadecimal\" y el resto llenar con espacio en blanco;\n\tRepita el procedimiento 1;\n\tTener una | en el primer trazo, décimo tercero, vigésimo tercero y del trigésimo noveno trazo de la primera línea, debajo del octavo trazo, debe imprimir el valor de la primera variable en valor decimal, debajo del décimo octavo traza, debe imprimir el valor de la primera variable en valor octal, debajo del 31º rastro debe imprimir el valor de la primera variable en valor hexadecimal y el resto llenar con espacio en blanco;\n\tRepita el procedimiento 6 para las otras 15 variables;\n\tRepita el procedimiento 1.\n\n\nAl final debe quedar igual a la siguiente imagen:\n\n \n--------------------------------------- (39 traços)\n| decimal   |  octal  |  Hexadecimal  |\n---------------------------------------\n|      0    |    0    |       0       |\n|      1    |    1    |       1       |\n|      2    |    2    |       2       |\n|      3    |    3    |       3       |\n|      4    |    4    |       4       |\n|      5    |    5    |       5       |\n|      6    |    6    |       6       |\n|      7    |    7    |       7       |\n|      8    |   10    |       8       |\n|      9    |   11    |       9       |\n|     10    |   12    |       A       |\n|     11    |   13    |       B       |\n|     12    |   14    |       C       |\n|     13    |   15    |       D       |\n|     14    |   16    |       E       |\n|     15    |   17    |       F       |\n--------------------------------------- (39 traços)","id":"2750","category":"Principiante","statistics":{"level":"5 / 10","submissions":4893,"solved":1316,"ratio":"26.90%"}}