{"output":"Para cada archivo de la entrada, tendrá un archivo de salida. El archivo de salida tiene doce líneas de la forma descrita en el ítem 7 y 8. Como muestra el siguiente ejemplo de salida.","input":"La entrada consta de varios archivos de prueba. En cada archivo de prueba tiene dos líneas. En la primera línea tiene dos números reales A y B (-1000.0 ≤ A, B ≤ 1000.0), separados por espacio en blanco. En la segunda línea tiene dos números reales C y D (-1000.0 ≤ C, D ≤ 1000.0), separados por espacio en blanco. Como se muestra en el siguiente ejemplo de entrada.","level":7,"name":"Entrada y Salida de Números Reales","has_images":false,"description":"Su profesor desea hacer un programa con las siguientes características:\n\n\n\tCree dos variables para almacenar números reales de precisión simple;\n\tCree dos variables para almacenar números reales de precisión doble;\n\tLea el primer número de precisión simple que siempre tendrá un decimal;\n\tLea el segundo número de precisión simple que siempre tendrá dos decimales;\n\tLea el primer número de doble precisión que siempre tendrá tres decimales;\n\tLea el segundo número de precisión doble que siempre tendrá cuatro decimales;\n\tImprima la letra A, un espacio en blanco, el signo igual, un espacio en blanco, el número almacenado en la primera variable leída en el paso 3, una virgula, un espacio en blanco, la letra B, un espacio en blanco, de igual, un espacio en blanco, el número almacenado en la segunda variable leída en el paso 4. No olvide saltar línea;\n\tImprima la letra C, un espacio en blanco, el signo igual, un espacio en blanco, el número almacenado en la primera variable leída en el paso 5, una virgula, un espacio en blanco, la letra D, un espacio en blanco, de igual, un espacio en blanco, el número almacenado en la segunda variable leída en el paso 6. No olvide saltar línea;\n\tRepita el procedimiento 7, imprimiendo los números con un decimal;\n\tRepita el procedimiento 8, imprimiendo los números con un decimal;\n\tRepita el procedimiento 7, imprimiendo los números con dos decimales;\n\tRepita el procedimiento 8, imprimiendo los números con dos decimales;\n\tRepita el procedimiento 7, imprimiendo los números con tres decimales;\n\tRepita el procedimiento 8, imprimiendo los números con tres decimales;\n\tRepita el procedimiento 7, imprimiendo los números con tres decimales y en forma de notación científica con el carácter E;\n\tRepita el procedimiento 8, imprimiendo los números con tres decimales y en forma de notación científica con el carácter E;\n\tRepita el procedimiento 7, imprimiendo solamente la parte entera del número;\n\tRepita el procedimiento 8, imprimiendo solamente la parte entera del número.","id":"2758","category":"Principiante","statistics":{"level":"7 / 10","submissions":1960,"solved":700,"ratio":"35.71%"}}