{"output":"Your program should produce two lines on the output. The first line describes the response to Subtask A and should contain a single character. The character must be S to indicate that it is possible to decrease the total of cleared checks with an equivalent check list, or N to indicate that it is not possible to decrease the total of cleared checks.\n\nIf your program also resolves Subtask B, the second line describes the response to this subtask and must contain an integer, the minimum value of the total cleared checks, in an equivalent list. If your program does not resolve Subtask B, you can leave the line blank or put an arbitrary integer value.","input":"The first line contains two integers, M (1 ≤ M ≤ 10⁶) and N (2 ≤ N ≤ 10³), where M is the number of checks issued and N is the number of inhabitants of the city. The inhabitants are identified by integers from 1 to N. Each of the following M lines describes a check from the list and contains three integers X (1 ≤ X ≤ N), V (1 ≤ V ≤ 10²) and Y (1 ≤ Y ≤ N, Y! = X) which indicates that X issued a check of V monies in favor of Y. There may be more than one check from X to Y. It is also possible that there are checks from X to Y and from Y to X, but not from X to X.","level":5,"name":"Compensation Camera","has_images":true,"description":"In a city, many people lend money to other people. The thing has reached such a point that there are people who are both debtor and creditor. People then resolved to pay their debts and each issued the checks to pay their debts. For example, in figure (a), person C issued a check of 5 monies to person A, and person D issued a check of 3 monies to person C. That is, person C received from person D and paid person A. Even worse, there is a vicious cycle in which person D issued a check of 3 monies to person C, who in turn issued a check of 2 monies to person B, which in turn issued a check of 1 cash for person D. The situation shown in item (a) of the Figure below is described through a check list, with four triples of the form (X, V, Y), to indicate that X issued a check of V monies for Y. In the same Figure, in item (b), the situation is described with a list of only three checks.\n\t\t\t\t\nHowever, since two lists are equivalent: the balance in a person's bank account is the same on both check lists. In both cases, once all checks have been cleared, a person with a termination of 5 or more accounts in your account, a person terminated in your account, a person with a limit of 4 monies less in your account and the account D person will end up with 2 monies for less in your account.\n\nWe will then define equivalence of check lists issued: two check lists are equivalent if at the end of the process of clearing all checks the following holds for each person: his bank balance at the end of the clearing of a list is the same as the bank balance of the person at the end of the compensation of the other list. The total of compensated values ​​in item (a) of the figure is equal to 11 monies whereas in item (b) the total is only 6 monies! This problem has two subtasks:\n\n• Subtask A: Determine, given a checklist, whether or not it is possible to decrease the total of cleared values ​​using another equivalent checklist.\n\n• Subtask B: Determine the minimum total of cleared values ​​in an equivalent checklist.\n\nYou should write a program that solves only Subtask A or solves both subtasks. You should write a program that solves only Subtask A or solves both subtasks.","id":"2781","category":"Principiante","statistics":{"level":"5 / 10","submissions":387,"solved":128,"ratio":"33.07%"}}