{"output":"Su algoritmo debe imprimir una línea que contiene un entero D, indicando la duración de la presentación de la música.","input":"En la primera línea habrá un entero N, indicando cuántos cantantes son parte del Coral del Norte (3 < N <= 20).\n\nEnseguida habrá N enteros Fi, cada uno indicando por cuánto tiempo cada uno de los cantantes consiguen cantar sin perder el aliento (1 <= Fi <= 10, para todo 1 <= i <= N).","level":5,"name":"Coral del Norte","has_images":false,"description":"Hay un grupo de cantantes, residentes de la región Norte de Brasil, que son muy famosos por sus interpretaciones de las canciones clásicas.\n\nCada uno de los integrantes de este grupo tiene diferentes características vocales, como la facilidad para alcanzar notas graves o agudas, agilidad en el intercambio de las notas, control de vibración, entre otras muchas habilidades.\n\nUna de las características más importantes es conocer cuántos segundos un cantante es capaz de cantar la misma nota sin perder el aliento. Al perder el aliento, el cantante necesita de 1 segundo para recuperarse.\n\nEl coral quiere cantar una nueva música, en la que siempre deben existir exactamente 3 vocalistas cantando 3 notas al mismo tiempo. Cuando un vocalista se queda sin aire, otro vocalista debe asumir su lugar inmediatamente, garantizando que la nota continúe sonando. Otra característica de esta canción es que todos los vocalistas siempre deben esforzarse al máximo, es decir, siempre van a cantar hasta quedarse sin aliento.\n\nPara que la presentación sea breve, el coral quisiera cantar esa canción en el menor tiempo posible, es decir, las 3 notas deben dejar de sonar al mismo tiempo y cuanto antes.\n\nDada la cantidad de miembros del coral, y conociendo la cantidad de tiempo que cada uno de ellos consigue cantar sin perder el aliento, diga cuál será la duración de la presentación de la nueva música.","id":"2799","category":"Paradigmas","statistics":{"level":"5 / 10","submissions":14,"solved":5,"ratio":"35.71%"}}