{"output":"Para cada receta imprima una línea que contenga la frase \"porcao tipica\" caso la receta sea típica, o \"porcao comum\" en caso de que no lo sea.","input":"La entrada comienza con un entero N, indicando cuántos son los ingredientes típicos de la región (1 <= N <= 50). Enseguida habrá N nombres, representando los N ingredientes típicos de la región.\n\nEnseguida habrá un entero M, indicando cuántas recetas deben ser analizadas (1 <= M <= 100).\n\nEnseguida habrá M conjuntos de entrada, cada uno representando una receta. Cada uno de estos conjuntos iniciará con un nombre Si y un número Ki, que representa el nombre de la receta y la cantidad de componentes (típicos, comunes o porciones de otra receta) que componen esta receta (1 <= Ki <= 50).\nEn seguida habrá Ki nombres, cada uno representando cada uno de los componentes de la receta Si.\n\nLos nombres de todos los ingredientes y recetas, contienen solamente letras del alfabeto (mayúsculas o minúsculas) y guiones, teniendo una longitud máxima de 50 caracteres.","level":10,"name":"Ingredientes Típicos","has_images":false,"description":"La región Norte de Brasil es cuna de una rica y creativa culinaria. Destacan dentro de los ingredientes típicos: condimentos únicos, combinaciones de diversos productos y modos de preparación bien específicos. Los platos de la región siempre encantan a los residentes y enamoran a los turistas.\n\nEn esta culinaria se emplean dos tipos de ingredientes: ingredientes típicos del Norte, e ingredientes comunes, también usados en el resto del país. Una porción o receta destaca por una mezcla de ingredientes (típicos y/o comunes), y es considerada típica si más de la mitad de sus componentes son típicos.\n\nRafael que está visitando la región Norte por primera vez, después de degustar algunas comidas se quedó muy satisfecho con la gastronomía nordestina. Él percibió que cuantos más componentes típicos estaban incluidos en su porción, más era sorprendido su paladar, él estaba realmente adorando y comenzó a tomar nota de las recetas.\n\nDespués de realizar algunas anotaciones de las muchas recetas nordestinas, Rafael pidió su ayuda para clasificar en típicas o comunes las recetas disponibles. Los habitantes de la región le comentaron no olvidar que la clasificación de la receta depende del número de ingredientes típicos en la lista de productos utilizados. Conociendo la lista de ingredientes típicos, ayude a Rafael a determinar la clasificación de las recetas.","id":"2806","category":"Ad-Hoc","statistics":{"level":"10 / 10","submissions":194,"solved":24,"ratio":"12.37%"}}