{"output":"Habrá una línea para cada consulta del tipo \"c\" conteniendo el nombre del rival de Farcos.","input":"La entrada se compondrá de varios casos de prueba. La primera línea de la entrada contiene dos números enteros N (1 <= N <= 105) y K (1 <= K <= N) correspondiendo respectivamente a la cantidad de alumnos inicialmente en la llamada y la posición de Farcos a lo largo de los años anteriores. Se siguen N líneas, cada una conteniendo un nombre compuesto únicamente por letras minúsculas del alfabeto inglés sin espacios. La siguiente línea de entrada tiene un entero Q (1<=Q<=105) informando la cantidad de consultas a continuación. Siguen Q líneas, cada una sigue uno de tres posibles formatos:\r\n\r\n\r\n\tm NOMBRE (significa que fue matriculado el alumno NOMBRE)\r\n\tt NOMBRE (significa que el alumno NOMBRE fue transferido)\r\n\tc (significa una consulta para saber el rival actual de Farcos)\r\n\r\n\r\nLa entrada termina cuando N = K = 0.","level":4,"name":"Laércio","has_images":false,"description":"Durante los primeros años de estudio en la escuela, Farcos siempre tenía el mismo número en el registro escolar. Es decir, la posición en que su nombre aparecía en las listas (ordenadas lexicográficamente) de presencia de las clases, siempre era la misma. Pero este hecho comenzó a mudar al llegar al primer año de su enseñanza media.\r\nEn la enseñanza media, Farcos fue para una nueva escuela y por ser una escuela muy rígida el flujo de alumnos nuevos matriculados y de alumnos trasladados de allí a otras escuelas era mayor de lo esperado. Con eso Farcos no mantenía su posición en la lista de llamadas y antes de que percibía, por puro capricho, pasaba a no gustar del alumno que acababa por quedarse en su posición. Llegando a considerarlo su mayor y único rival.\r\nSu tarea es, dado el historial de matrículas y transferencias que ocurrieron en la clase de Farcos, responder a varias consultas sobre quién es su actual rival.\r\nDos alumnos nunca tienen el mismo nombre y ningún estudiante transferido vuelve a estudiar en la escuela de Farcos.","id":"2812","category":"Principiante","statistics":{"level":"4 / 10","submissions":922,"solved":306,"ratio":"33.19%"}}