{"output":"The output consists of a single line containing the lowest cost in thousands of reais to mount the network according to specifications.","input":"The first line of the entry contains an integer N (1 ≤ N ≤ 450) representing the number of locations participating in the Marathon. The next N lines contains N integers separated by whitespace each.\n\nIn the i-th line of the j-th column there is an integer C that has its meaning depending on its position:\n\n\n\tIf i > j, C (0 ≤ C ≤ 1) has a value of 1 if there is already a fiber optic cable between the i-th and the j-th location, or 0, otherwise.\n\tIf i < j, C (1 ≤ C ≤ 103) represents the cost, in thousands of reais, of building a direct connection between i-th and the j-th seat if it does not exist, or otherwise remove the cable.\n\tIf i = j, C is 0 and can be ignored since there will never be a need to place or remove a fiber optic cable between a seat and itself.\n\n\nNote that the rows are numbered from top to bottom starting from 1 and the columns from left to right also starting from 1.","level":5,"name":"Optical Fiber","has_images":true,"description":"The North Region is one of the five regions of Brazil defined by the Brazilian Institute of Geography and Statistics (IBGE) in 1969. With an area of ​​3 853 676,948 km² - the largest among the five regions - it covers 45.25% of the national territory, bigger than the area of ​​India and slightly smaller than the European Union. If it were a country, it would be the 7th largest in the world in area. Its population, also according to the Brazilian Institute of Geography and Statistics (IBGE), is 18.1 million inhabitants in 2018, equivalent to the population of Chile. It is formed by seven states: Acre, Amapá, Amazonas, Pará, Rondônia, Roraima and Tocantins, which have 22, 16, 62, 144, 52, 15 and 139 municipalities respectively.\n\n\t\t\t\t\n\n\t\t\t\tIt is in this Region that the Northern Programming Marathon is based. A competition that, due to the fact that it has several locations simultaneously testing - at most one per municipality - needs a good internet connection in all of them to guarantee equal conditions in the marathon enviroment.\n\nTo try to solve this problem, the organizers of the Marathon intend to do an ambitious project: connect all the locations through fiber optic cables. However, this is a very expensive technology, so they want to design this connections network in order to minimize the costs.\n\nThis network will be a minimal point-to-point network, which means that communication between any two points should be possible and unique. There is no two different routes for data traffic between the same pair of points.\n\nStill in order to reduce costs, while maintaining the minimum connection, the project takes advantage of some cables already existing between locations or even remove some.\n\nYour task is, given the costs of putting the nonexistent cables and removing the ones you already have, calculate the lowest cost to make that network under the specified conditions.","id":"2941","category":"Graph","statistics":{"level":"5 / 10","submissions":78,"solved":39,"ratio":"50.00%"}}