{"output":"You must print an integer that represents the minimum number of roads to be built by the government.","input":"The entry consists of a single test case.\n\t\t\t\t The first line is composed of three integers V (1 ≤ V ≤ 2\\(\\times\\)104), E (0 ≤ E ≤ 2\\(\\times\\)105), S (1 ≤ S ≤ V), the number of companies in the Manaus Free Trade Zone, the number of non-flooded roads and the company that will be the center of the distribution operation respectively.\n\t\t\t\tFollow then E lines, each with two integers X and Y (1 ≤ X,Y ≤ V) that indicate that there is a road that connects company X to company Y.","level":5,"name":"Emergency in Manaus","has_images":false,"description":"In the city of Manaus there is an important industrial center that contains a great variety of companies from different sectors. This region is known as the Manaus Free Trade Zone.\n\t\t\t\t In order to facilitate the flow of raw materials from the city to the industrial pole, the Manaus government has built several roads that connect the companies to each other.\n\t\t\t\t Due to the sudden large volume of rainfall, several of the roads built by the government were flooded, thus generating slowness in the distribution of the raw material.\n\t\t\t\t The government of Manaus together with the State Council of Traffic Engineering of Amazonas, developed a solution, in the short term, in order to not completely freeze the Free Trade Zone. This measure consists of building some emergency roads and keeping all factories connected even though indirectly, but different from the previous configuration, the new system will have the following restrictions: \n\t\t\t\t\n\t\t\t\t\t All roads can now only be used in one direction, hoping to use the other lane to increase the flow; \n\t\t\t\t\t All trucks will arrive by a single company S and will be distributed to other companies from the roads starting from S.\n\t\t\t\t\t\n\t\t\t\tThe government needs to be agile as each day costs millions, so they count on you to determine the minimum amount of roads that need to be built in order that all other businesses can be reached from the company S.","id":"2944","category":"Ad-Hoc","statistics":{"level":"5 / 10","submissions":151,"solved":29,"ratio":"19.21%"}}