{"output":"The output consists of a single line containing the largest sum of notes that the class can get.","input":"The first line of input consists of an integer K (1 ≤ K ≤ 102) representing the number of questions in the test. The second line of the input consists K uppercase letters of the English alphabet without blanks representing the Desafortunato's answers. The third line contains an integer N (1 ≤ N ≤ 102) representing the number of Desafortunato's classmates. The next N lines contains K uppercase letter of english alphabet each without white space. Each line corresponds to the answer sheet of a Desafortunato's colleague.","level":5,"name":"Correct Answers","has_images":true,"description":"Desafortunato is a high school student in a prestigious school. The tests in this school are famous for having a well defined format but also for being of a very high level. They are always objective, that is, they are composed of a statement and several options of answer listed with capital letters, but, unlike the traditional objective tests, each question of the test in that college has 26 options of answer, using all the letters of the English alphabet. And only one of these options is correct.\n\n\n\n\nThis year, the Desafortunato class intends to win the best class of the college award, which grants some privileges to extra-class activities. And to achieve this goal the class must have the highest sum of grades in the final exam. What worried enough Desafortunato that after having done the final test he fears not to have performed well.\n\n\nConcerned also with the prize at stake and knowing that Desafortunato is well known for his bad luck, the class wants to estimate what their chances of winning considering the worst of cases about their unlucky colleague: He failing in all the answers.\n\n\nGiven the copy of the answer sheets of all the students in the class and considering that Desafortunato get wrong all questions of the test, calculate what the largest sum of grades that the class can still achieve.\n\n\nRemember that in a answer sheet the first letter corresponds to the student's answer to the first question of proof, the second letter corresponds to the answer of the second question and so on.","id":"2947","category":"Ad-Hoc","statistics":{"level":"5 / 10","submissions":144,"solved":97,"ratio":"67.36%"}}