{"output":"For each question, there should be one of the following answers:\n\n\"Lets que lets\", if it is possible to get from one neighborhood to another;\n\n\"Deu ruim\", if it is not possible to get from one neighborhood to another.","input":"The first line of the entry contains three integers N (0 < N ≤ 400), M (0 ≤ M ≤ (( N -1)* N ))/2) and P (0 ≤ P ≤ 105), indicating respectively the number of neighborhoods, the number of connections in the city of Harari and how many questions were asked. The next M lines describe the connections, where each line has 2 integers, A and B (0 < A , B ≤ N) indicating that such a connection connects these two neighborhoods. The next P lines describe the questions asked, where in each row there will be two integers, K and L, asking whether or not it is possible to go from K to L for the available connections.","level":1,"name":"StopAll","has_images":false,"description":"Harari was a very intelligent young man who loved to eat and drink. One day, she went out with her friends, and after a night of lots of laughs and good drinks, she got the idea of ​​buying a very good ginger yogurt that was in fashion right now called ParaTudo. When taking it with his friends, he noticed that the yogurt really stopped his entire digestive system and everyone panicked needing to go each to their respective home. Due to the good drinks they took, the friends were lost in the city, and were afraid of not being able to get to their homes, especially since many streets were closed because of the upcoming Carnival. Given the number of neighborhoods in the city and their connections (all of these connections being possible to be crossed by both directions), answer the various questions of Harari and his friends, where each question should answer if, from neighborhood A, it is possible to reach a neighborhood B by the available connections.","id":"2959","category":"Graph","statistics":{"level":"1 / 10","submissions":27,"solved":19,"ratio":"70.37%"}}